[
  {
    "id": 1,
    "category": 1,
    "name": "Little Grebe",
    "sinhala": "පුංචි ගෙඹිතුරුවා",
    "scientific": "Tachybaptus Ruficollis Capensis",
    "image": "little_grebe.jpg",
    "desc": "Grebes are small to medium-sized diving birds. They breed on fresh water, but often visit the sea whilst migrating and in winter. They have lobed toes and are excellent swimmers and divers; however, their feet are placed far back on their bodies, making them quite ungainly on land. There are 19 species worldwide. Of these, one species has been recorded in Sri Lanka.",
    "migrant": 0,
    "endemic": 0,
    "code": "R"
  },
  {
    "id": 2,
    "category": 2,
    "name": "Little Cormorant",
    "sinhala": "පුංචි දියකාවා",
    "scientific": "Phalacrocorax Niger",
    "image": "little_cormorant.jpg",
    "desc": "The little cormorant is a member of the cormorant family of seabirds. Slightly smaller than the Indian cormorant it lacks a peaked head and has a shorter beak.It forages singly or sometimes in loose groups in lowland freshwater bodies, including small ponds, large lakes, streams and sometimes coastal estuaries.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR"
  },
  {
    "id": 3,
    "category": 2,
    "name": "Indian Cormorant",
    "sinhala": "ඉන්දියානු දියකාවා",
    "scientific": "Phalacrocorax Fuscicollis",
    "image": "indian_cormorant.jpg",
    "desc": "The Indian cormorant or Indian shag is a member of the cormorant family. It is found mainly along the inland waters of the Indian Subcontinent but extending west to Sind and east to Thailand and Cambodia. It is a gregarious species that can be easily distinguished from the similar sized little cormorant by its blue eye, small head with a sloping forehead and a long narrow bill ending in a hooked tip.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR"
  },
  {
    "id": 4,
    "category": 2,
    "name": "Great Cormorant",
    "sinhala": "ඉන්දියානු දියකාවා",
    "scientific": "Phalacrocorax Carbo Sinensis",
    "image": "great_cormorant.jpg",
    "desc": "The great cormorant, known as the great black cormorant across the Northern Hemisphere, the black cormorant in Australia, the large cormorant in India and the black shag further south in New Zealand, is a widespread member of the cormorant family of seabirds.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR"
  },
  {
    "id": 5,
    "category": 3,
    "name": "Darter",
    "sinhala": "අභිකාවා",
    "scientific": "Anhinga melanogaster",
    "image": "darter.jpg",
    "desc": "The darter is a water bird of tropical South Asia and Southeast Asia. It has a long and slender neck with a straight, pointed bill and, like the cormorant, it hunts for fish while its body is submerged in water.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 6,
    "category": 4,
    "name": "Spot-billed Pelican",
    "sinhala": "තිත්හොට පැස්තුඩුවා",
    "scientific": "Pelecanus philippensis",
    "image": "spot_billed_pelican.jpg",
    "desc": "The spot-billed pelican or grey pelican is a member of the pelican family. It breeds in southern Asia from southern Pakistan across India east to Indonesia. It is a bird of large inland and coastal waters, especially large lakes.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 7,
    "category": 5,
    "name": "Yellow Bittern",
    "sinhala": "කහ මැටි කොකා",
    "scientific": "Ixobrychus sinensis",
    "image": "yellow_bittern.jpg",
    "desc": "The yellow bittern is a small bittern. It is of Old World origins, breeding in the northern Indian Subcontinent, east to Japan and Indonesia. It is mainly resident, but some northern birds migrate short distances.",
    "migrant": 1,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 8,
    "category": 5,
    "name": "Black Bittern",
    "sinhala": "කළු මැටි කොකා",
    "scientific": "Dupetor flavicollis flavicollis",
    "image": "black_bittern.jpg",
    "desc": "The black bittern is a bittern of Old World origin, breeding in tropical Asia from Bangladesh, Pakistan, India, and Sri Lanka east to China, Indonesia, and Australia. It is mainly resident, but some northern birds migrate short distances.",
    "migrant": 1,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 9,
    "category": 5,
    "name": "Malayan Night Heron",
    "sinhala": "මලයානු රෑ කොකා",
    "scientific": "Gorsachius melanolophus melanolophus",
    "image": "malayan_night_heron.jpg",
    "desc": "The Malayan night heron, also known as Malaysian night heron and tiger bittern, is a medium-sized heron. It is distributed in southern and eastern Asia.",
    "migrant": 1,
    "endemic": 0,
    "code": "S"
  },
  {
    "id": 10,
    "category": 5,
    "name": "Black-crowned Night Heron",
    "sinhala": "රෑ කොකා",
    "scientific": "Nycticorax nycticorax nycticorax",
    "image": "black_crowned_night_heron.jpg",
    "desc": "The black-crowned night heron, or black-capped night heron, commonly shortened to just night heron in Eurasia, is a medium-sized heron found throughout a large part of the world, except in the coldest regions and Australasia.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 11,
    "category": 5,
    "name": "Little Heron",
    "sinhala": "කුඩා පලා කොකා",
    "scientific": "Butorides striatus javanicus",
    "image": "little_heron.jpg",
    "desc": "The striated heron (Butorides striata) also known as mangrove heron, little heron or green-backed heron, is a small heron, about 44 cm tall. Striated herons are mostly non-migratory and noted for some interesting behavioral traits. Their breeding habitat is small wetlands in the Old World tropics from west Africa to Japan and Australia, and in South America.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 12,
    "category": 5,
    "name": "Indian Pond Heron",
    "sinhala": "කණ කොකා",
    "scientific": "Ardeola grayii grayii",
    "image": "indian_pond_heron.jpg",
    "desc": "The Indian pond heron or paddybird (Ardeola grayii) is a small heron. It is of Old World origins, breeding in southern Iran and east to Pakistan, India, Burma, Bangladesh and Sri Lanka. They are widespread and common but can be easily missed when they stalk prey at the edge of small water-bodies or even when they roost close to human habitations.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR"
  },
  {
    "id": 13,
    "category": 5,
    "name": "Eastern Cattle Egret",
    "sinhala": "ගව කොකා",
    "scientific": "Bubulcus coromandus",
    "image": "eastern_cattle_egret.jpg",
    "desc": "The eastern cattle egret is a species of heron (family Ardeidae) found in the tropics, subtropics and warm temperate zones. Most taxonomic authorities lump this species and the western cattle egret together as subspecies of the cattle egret, but some (including the International Ornithologists Union) separate them.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR"
  },
  {
    "id": 14,
    "category": 5,
    "name": "Western Reef Egret",
    "sinhala": "මූදුපර ඇළි කොකා",
    "scientific": "Egretta gularis schistacea",
    "image": "western_reef_egret.jpg",
    "desc": "The western reef heron also called the western reef egret, is a medium-sized heron found in southern Europe, Africa and parts of Asia. It has a mainly coastal distribution and occurs in several plumage forms: a slaty-grey plumage in which it can only be confused with the rather uncommon dark morph of the Little Egret (Egretta garzetta); a white form which can look very similar to the little egret although the bill tends to be paler and larger and the black form with white throat E. g. gularis of West Africa.",
    "migrant": 1,
    "endemic": 0,
    "code": "S"
  },
  {
    "id": 15,
    "category": 5,
    "name": "Little Egret",
    "sinhala": "මූදුපර ඇළි කොකා",
    "scientific": "Egretta garzetta garzetta",
    "image": "little_egret.jpg",
    "desc": "The little egret is a species of small heron in the family Ardeidae. The genus name comes from the Provençal French Aigrette, egret, a diminutive of Aigron, heron. The species epithet garzetta is from the Italian name for this bird, garzetta or sgarzetta. It is a white bird with a slender black beak, long black legs and, in the western race, yellow feet.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR"
  },
  {
    "id": 16,
    "category": 5,
    "name": "Little Egret",
    "sinhala": "පුංචි ඇළි කොකා",
    "scientific": "Egretta garzetta garzetta",
    "image": "little_egret.jpg",
    "desc": "The little egret is a species of small heron in the family Ardeidae. The genus name comes from the Provençal French Aigrette, egret, a diminutive of Aigron, heron. The species epithet garzetta is from the Italian name for this bird, garzetta or sgarzetta. It is a white bird with a slender black beak, long black legs and, in the western race, yellow feet.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR"
  },
  {
    "id": 17,
    "category": 5,
    "name": "Intermediate Egret",
    "sinhala": "සුදු මැදි කොකා",
    "scientific": "Mesophoyx intermedia intermedia",
    "image": "intermediate_egret.jpg",
    "desc": "The intermediate egret, median egret, smaller egret, or yellow-billed egret (Ardea intermedia) is a medium-sized heron. Some taxonomists put the species in the genus Egretta or Mesophoyx. It is a resident breeder from east Africa across the Indian subcontinent to Southeast Asia and Australia.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR"
  },
  {
    "id": 18,
    "category": 5,
    "name": "Great Egret",
    "sinhala": "මහ සුදු කොකා",
    "scientific": "Casmerodius alba",
    "image": "great_egret.jpg",
    "desc": "The great egret, also known as the common egret, large egret, or great white egret or great white heron is a large, widely distributed egret, with four subspecies found in Asia, Africa, the Americas, and southern Europe.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR"
  },
  {
    "id": 19,
    "category": 5,
    "name": "Grey Heron",
    "sinhala": "අළු කොකා",
    "scientific": "Ardea cinerea cinerea",
    "image": "grey_heron.jpg",
    "desc": "The grey heron (Ardea cinerea), is a wading bird of the heron family Ardeidae, native throughout temperate Europe and Asia and also parts of Africa. It is resident in the milder south and west, but many birds retreat in winter from the ice in colder regions.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 20,
    "category": 5,
    "name": "Purple Heron",
    "sinhala": "කරවැල් කොකා",
    "scientific": "Ardea purpurea manilensis",
    "image": "purple_heron.jpg",
    "desc": "The purple heron (Ardea purpurea) is a wide-ranging species of wading bird in the heron family, Ardeidae. The scientific name comes from Latin ardea heron, and purpureus, coloured purple. It breeds in Africa, central and southern Europe, and southern and eastern Asia.",
    "migrant": 0,
    "endemic": 0,
    "code": "R"
  },
  {
    "id": 21,
    "category": 6,
    "name": "Painted Stork",
    "sinhala": "ලතුවැකියා",
    "scientific": "Mycteria leucocephala",
    "image": "painted_stork.jpg",
    "desc": "The painted stork (Mycteria leucocephala) is a large wader in the stork family. It is found in the wetlands of the plains of tropical Asia south of the Himalayas in the Indian Subcontinent and extending into Southeast Asia. Their distinctive pink tertial feathers of the adults give them their name. They forage in flocks in shallow waters along rivers or lakes. They immerse their half open beaks in water and sweep them from side to side and snap up their prey of small fish that are sensed by touch.",
    "migrant": 0,
    "endemic": 0,
    "code": "R"
  },
  {
    "id": 22,
    "category": 6,
    "name": "Asian Openbill",
    "sinhala": "ආසියා විවරතුඩුවා",
    "scientific": "Anastomus oscitans",
    "image": "asian_openbill.jpg",
    "desc": "The Asian openbill or Asian openbill stork (Anastomus oscitans) is a large wading bird in the stork family Ciconiidae. This distinctive stork is found mainly in the Indian subcontinent and Southeast Asia. It is greyish or white with glossy black wings and tail and the adults have a gap between the arched upper mandible and recurved lower mandible.",
    "migrant": 0,
    "endemic": 0,
    "code": "R"
  },
  {
    "id": 23,
    "category": 6,
    "name": "Woolly-necked Stork",
    "sinhala": "පාදිලි මානාවා",
    "scientific": "Ciconia episcopus episcopus",
    "image": "woolly_necked_stork.jpg",
    "desc": "The woolly-necked stork or whitenecked stork (Ciconia episcopus) is a large wading bird in the stork family Ciconiidae. It breeds singly, or in small loose colonies. It is distributed in a wide variety of habitats including marshes in forests, agricultural areas, and freshwater wetlands.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 24,
    "category": 6,
    "name": "Black-necked Stork",
    "sinhala": "අලි මානාවා",
    "scientific": "Ephippiorhynchus asiaticus asiaticus",
    "image": "black_necked_stork.jpg",
    "desc": "The black-necked stork (Ephippiorhynchus asiaticus) is a tall long-necked wading bird in the stork family. It is a resident species across the Indian Subcontinent and Southeast Asia with a disjunct population in Australia. It lives in wetland habitats and certain crops such as rice and wheat where it forages for a wide range of animal prey.",
    "migrant": 0,
    "endemic": 0,
    "code": "HSR"
  },
  {
    "id": 25,
    "category": 6,
    "name": "Lesser Adjutant",
    "sinhala": "හීන් බහුරු මානාවා",
    "scientific": "Leptoptilos javanicus",
    "image": "lesser_adjutant.jpg",
    "desc": "The lesser adjutant (Leptoptilos javanicus) is a large wading bird in the stork family Ciconiidae. Like other members of its genus, it has a bare neck and head. It is however more closely associated with wetland habitats where it is solitary and is less likely to scavenge than the related greater adjutant. It is a widespread species found from India through Southeast Asia to Java.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR"
  },
  {
    "id": 26,
    "category": 7,
    "name": "Glossy Ibis",
    "sinhala": "සිලුටු දෑතුඩුවා",
    "scientific": "Plegadis falcinellus falcinellus",
    "image": "glossy_ibis.jpg",
    "desc": "The glossy ibis (Plegadis falcinellus) is a wading bird in the ibis family Threskiornithidae. The scientific name derives from Ancient Greek plegados and Latin, falcis, both meaning sickle and referring to the distinctive shape of the bill.",
    "migrant": 1,
    "endemic": 0,
    "code": "S"
  },
  {
    "id": 27,
    "category": 7,
    "name": "Black-headed Ibis",
    "sinhala": "සුදු දෑතුඩුවා",
    "scientific": "Threskiornis melanocephalus",
    "image": "black_headed_ibis.jpg",
    "desc": "The black-headed ibis (Threskiornis melanocephalus), also known as the Oriental white ibis, Indian white ibis, and black-necked ibis, is a species of wading bird of the ibis family Threskiornithidae which breeds in the South- and Southeast Asia from India to the west and as far east as Japan.",
    "migrant": 0,
    "endemic": 0,
    "code": "R"
  },
  {
    "id": 28,
    "category": 7,
    "name": "Eurasian Spoonbill",
    "sinhala": "යුරාසියා හැඳිඅලවා",
    "scientific": "Platalea leucorodia leucorodia",
    "image": "eurasian_spoonbill.jpg",
    "desc": "The Eurasian spoonbill or common spoonbill (Platalea leucorodia) is a wading bird of the ibis and spoonbill family Threskiornithidae. The genus name Platalea is from Latin and means broad, referring to the distinctive shape of the bill, and leucorodia is from Ancient Greek leukerodios spoonbill, itself derived from leukos, white and erodios heron.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR"
  },
  {
    "id": 29,
    "category": 8,
    "name": "Greater Flamingo",
    "sinhala": "රජ සියක්කාරයෝ",
    "scientific": "Phoenicopterus ruber roseus",
    "image": "greater_flamingo.jpg",
    "desc": "The greater flamingo (Phoenicopterus roseus) is the most widespread and largest species of the flamingo family. It is found in Africa, on the Indian subcontinent, in the Middle East, and in southern Europe.",
    "migrant": 1,
    "endemic": 0,
    "code": ""
  }
]