[
  {
    "id": 1,
    "category": 1,
    "name": "Little Grebe",
    "sinhala": "පුංචි ගෙඹිතුරුවා",
    "scientific": "Tachybaptus Ruficollis Capensis",
    "image": "little_grebe.jpg",
    "desc": "Grebes are small to medium-sized diving birds. They breed on fresh water, but often visit the sea whilst migrating and in winter. They have lobed toes and are excellent swimmers and divers; however, their feet are placed far back on their bodies, making them quite ungainly on land. There are 19 species worldwide. Of these, one species has been recorded in Sri Lanka.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_grebe"
  },
  {
    "id": 2,
    "category": 2,
    "name": "Little Cormorant",
    "sinhala": "පුංචි දියකාවා",
    "scientific": "Phalacrocorax Niger",
    "image": "little_cormorant.jpg",
    "desc": "The little cormorant is a member of the cormorant family of seabirds. Slightly smaller than the Indian cormorant it lacks a peaked head and has a shorter beak.It forages singly or sometimes in loose groups in lowland freshwater bodies, including small ponds, large lakes, streams and sometimes coastal estuaries.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_cormorant"
  },
  {
    "id": 3,
    "category": 2,
    "name": "Indian Cormorant",
    "sinhala": "ඉන්දියානු දියකාවා",
    "scientific": "Phalacrocorax Fuscicollis",
    "image": "indian_cormorant.jpg",
    "desc": "The Indian cormorant or Indian shag is a member of the cormorant family. It is found mainly along the inland waters of the Indian Subcontinent but extending west to Sind and east to Thailand and Cambodia. It is a gregarious species that can be easily distinguished from the similar sized little cormorant by its blue eye, small head with a sloping forehead and a long narrow bill ending in a hooked tip.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_cormorant"
  },
  {
    "id": 4,
    "category": 2,
    "name": "Great Cormorant",
    "sinhala": "මහ දියකාවා",
    "scientific": "Phalacrocorax Carbo Sinensis",
    "image": "great_cormorant.jpg",
    "desc": "The great cormorant, known as the great black cormorant across the Northern Hemisphere, the black cormorant in Australia, the large cormorant in India and the black shag further south in New Zealand, is a widespread member of the cormorant family of seabirds.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_cormorant"
  },
  {
    "id": 5,
    "category": 3,
    "name": "Darter",
    "sinhala": "අභිකාවා",
    "scientific": "Anhinga Melanogaster",
    "image": "darter.jpg",
    "desc": "The darter is a water bird of tropical South Asia and Southeast Asia. It has a long and slender neck with a straight, pointed bill and, like the cormorant, it hunts for fish while its body is submerged in water.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Darter"
  },
  {
    "id": 6,
    "category": 4,
    "name": "Spot-billed Pelican",
    "sinhala": "තිත්හොට පැස්තුඩුවා",
    "scientific": "Pelecanus Philippensis",
    "image": "spot_billed_pelican.jpg",
    "desc": "The spot-billed pelican or grey pelican is a member of the pelican family. It breeds in southern Asia from southern Pakistan across India east to Indonesia. It is a bird of large inland and coastal waters, especially large lakes.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Spot-billed_pelican"
  },
  {
    "id": 7,
    "category": 5,
    "name": "Yellow Bittern",
    "sinhala": "කහ මැටි කොකා",
    "scientific": "Ixobrychus Sinensis",
    "image": "yellow_bittern.jpg",
    "desc": "The yellow bittern is a small bittern. It is of Old World origins, breeding in the northern Indian Subcontinent, east to Japan and Indonesia. It is mainly resident, but some northern birds migrate short distances.",
    "migrant": 1,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow_bittern"
  },
  {
    "id": 8,
    "category": 5,
    "name": "Black Bittern",
    "sinhala": "කළු මැටි කොකා",
    "scientific": "Dupetor Flavicollis Flavicollis",
    "image": "black_bittern.jpg",
    "desc": "The black bittern is a bittern of Old World origin, breeding in tropical Asia from Bangladesh, Pakistan, India, and Sri Lanka east to China, Indonesia, and Australia. It is mainly resident, but some northern birds migrate short distances.",
    "migrant": 1,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black_bittern"
  },
  {
    "id": 9,
    "category": 5,
    "name": "Malayan Night Heron",
    "sinhala": "මලයානු රෑ කොකා",
    "scientific": "Gorsachius melanolophus melanolophus",
    "image": "malayan_night_heron.jpg",
    "desc": "The Malayan night heron, also known as Malaysian night heron and tiger bittern, is a medium-sized heron. It is distributed in southern and eastern Asia.",
    "migrant": 1,
    "endemic": 0,
    "code": "S",
    "wikipedia": "https://en.wikipedia.org/wiki/Malayan_night_heron"
  },
  {
    "id": 10,
    "category": 5,
    "name": "Black-crowned Night Heron",
    "sinhala": "රෑ කොකා",
    "scientific": "Nycticorax Nycticorax Nycticorax",
    "image": "black_crowned_night_heron.jpg",
    "desc": "The black-crowned night heron, or black-capped night heron, commonly shortened to just night heron in Eurasia, is a medium-sized heron found throughout a large part of the world, except in the coldest regions and Australasia.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-crowned_night_heron"
  },
  {
    "id": 11,
    "category": 5,
    "name": "Little Heron",
    "sinhala": "කුඩා පලා කොකා",
    "scientific": "Butorides Striatus Javanicus",
    "image": "little_heron.jpg",
    "desc": "The striated heron also known as mangrove heron, little heron or green-backed heron, is a small heron, about 44 cm tall. Striated herons are mostly non-migratory and noted for some interesting behavioral traits. Their breeding habitat is small wetlands in the Old World tropics from west Africa to Japan and Australia, and in South America.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Striated_heron"
  },
  {
    "id": 12,
    "category": 5,
    "name": "Indian Pond Heron",
    "sinhala": "කණ කොකා",
    "scientific": "Ardeola Grayii Grayii",
    "image": "indian_pond_heron.jpg",
    "desc": "The Indian pond heron or paddybird (Ardeola grayii) is a small heron. It is of Old World origins, breeding in southern Iran and east to Pakistan, India, Burma, Bangladesh and Sri Lanka. They are widespread and common but can be easily missed when they stalk prey at the edge of small water-bodies or even when they roost close to human habitations.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_pond_heron"
  },
  {
    "id": 13,
    "category": 5,
    "name": "Eastern Cattle Egret",
    "sinhala": "ගව කොකා",
    "scientific": "Bubulcus Coromandus",
    "image": "eastern_cattle_egret.jpg",
    "desc": "The eastern cattle egret is a species of heron (family Ardeidae) found in the tropics, subtropics and warm temperate zones. Most taxonomic authorities lump this species and the western cattle egret together as subspecies of the cattle egret, but some (including the International Ornithologists Union) separate them.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Eastern_cattle_egret"
  },
  {
    "id": 14,
    "category": 5,
    "name": "Western Reef Egret",
    "sinhala": "මූදුපර ඇළි කොකා",
    "scientific": "Egretta Gularis Schistacea",
    "image": "western_reef_egret.jpg",
    "desc": "The western reef heron also called the western reef egret, is a medium-sized heron found in southern Europe, Africa and parts of Asia. It has a mainly coastal distribution and occurs in several plumage forms: a slaty-grey plumage in which it can only be confused with the rather uncommon dark morph of the Little Egret (Egretta garzetta); a white form which can look very similar to the little egret although the bill tends to be paler and larger and the black form with white throat E. g. gularis of West Africa.",
    "migrant": 1,
    "endemic": 0,
    "code": "S",
    "wikipedia": "https://en.wikipedia.org/wiki/Western_reef_heron"
  },
  {
    "id": 15,
    "category": 5,
    "name": "Little Egret",
    "sinhala": "පුංචි ඇළි කොකා",
    "scientific": "Egretta Garzetta Garzetta",
    "image": "little_egret.jpg",
    "desc": "The little egret is a species of small heron in the family Ardeidae. The genus name comes from the Provençal French Aigrette, egret, a diminutive of Aigron, heron. The species epithet garzetta is from the Italian name for this bird, garzetta or sgarzetta. It is a white bird with a slender black beak, long black legs and, in the western race, yellow feet.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_egret"
  },
  {
    "id": 16,
    "category": 5,
    "name": "Intermediate Egret",
    "sinhala": "සුදු මැදි කොකා",
    "scientific": "Mesophoyx Intermedia Intermedia",
    "image": "intermediate_egret.jpg",
    "desc": "The intermediate egret, median egret, smaller egret, or yellow-billed egret (Ardea intermedia) is a medium-sized heron. Some taxonomists put the species in the genus Egretta or Mesophoyx. It is a resident breeder from east Africa across the Indian subcontinent to Southeast Asia and Australia.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Intermediate_egret"
  },
  {
    "id": 17,
    "category": 5,
    "name": "Great Egret",
    "sinhala": "මහ සුදු කොකා",
    "scientific": "Casmerodius Alba",
    "image": "great_egret.jpg",
    "desc": "The great egret, also known as the common egret, large egret, or great white egret or great white heron is a large, widely distributed egret, with four subspecies found in Asia, Africa, the Americas, and southern Europe.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_egret"
  },
  {
    "id": 18,
    "category": 5,
    "name": "Grey Heron",
    "sinhala": "අළු කොකා",
    "scientific": "Ardea cinerea cinerea",
    "image": "grey_heron.jpg",
    "desc": "The grey heron is a wading bird of the heron family Ardeidae, native throughout temperate Europe and Asia and also parts of Africa. It is resident in the milder south and west, but many birds retreat in winter from the ice in colder regions.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey_heron"
  },
  {
    "id": 19,
    "category": 5,
    "name": "Purple Heron",
    "sinhala": "කරවැල් කොකා",
    "scientific": "Ardea Purpurea Manilensis",
    "image": "purple_heron.jpg",
    "desc": "The purple heron is a wide-ranging species of wading bird in the heron family, Ardeidae. The scientific name comes from Latin ardea heron, and purpureus, coloured purple. It breeds in Africa, central and southern Europe, and southern and eastern Asia.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Purple_heron"
  },
  {
    "id": 20,
    "category": 6,
    "name": "Painted Stork",
    "sinhala": "ලතුවැකියා",
    "scientific": "Mycteria Leucocephala",
    "image": "painted_stork.jpg",
    "desc": "The painted stork is a large wader in the stork family. It is found in the wetlands of the plains of tropical Asia south of the Himalayas in the Indian Subcontinent and extending into Southeast Asia. Their distinctive pink tertial feathers of the adults give them their name. They forage in flocks in shallow waters along rivers or lakes. They immerse their half open beaks in water and sweep them from side to side and snap up their prey of small fish that are sensed by touch.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Painted_stork"
  },
  {
    "id": 21,
    "category": 6,
    "name": "Asian Openbill",
    "sinhala": "ආසියා විවරතුඩුවා",
    "scientific": "Anastomus oscitans",
    "image": "asian_openbill.jpg",
    "desc": "The Asian openbill or Asian openbill stork is a large wading bird in the stork family Ciconiidae. This distinctive stork is found mainly in the Indian subcontinent and Southeast Asia. It is greyish or white with glossy black wings and tail and the adults have a gap between the arched upper mandible and recurved lower mandible.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Asian_openbill"
  },
  {
    "id": 22,
    "category": 6,
    "name": "Woolly-necked Stork",
    "sinhala": "පාදිලි මානාවා",
    "scientific": "Ciconia Episcopus Episcopus",
    "image": "woolly_necked_stork.jpg",
    "desc": "The woolly-necked stork or whitenecked stork is a large wading bird in the stork family Ciconiidae. It breeds singly, or in small loose colonies. It is distributed in a wide variety of habitats including marshes in forests, agricultural areas, and freshwater wetlands.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Woolly-necked_stork"
  },
  {
    "id": 23,
    "category": 6,
    "name": "Black-Necked Stork",
    "sinhala": "අලි මානාවා",
    "scientific": "Ephippiorhynchus Asiaticus Asiaticus",
    "image": "black_necked_stork.jpg",
    "desc": "The black-necked stork is a tall long-necked wading bird in the stork family. It is a resident species across the Indian Subcontinent and Southeast Asia with a disjunct population in Australia. It lives in wetland habitats and certain crops such as rice and wheat where it forages for a wide range of animal prey.",
    "migrant": 0,
    "endemic": 0,
    "code": "HSR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-necked_stork"
  },
  {
    "id": 24,
    "category": 6,
    "name": "Lesser Adjutant",
    "sinhala": "හීන් බහුරු මානාවා",
    "scientific": "Leptoptilos Javanicus",
    "image": "lesser_adjutant.jpg",
    "desc": "The lesser adjutant is a large wading bird in the stork family Ciconiidae. Like other members of its genus, it has a bare neck and head. It is however more closely associated with wetland habitats where it is solitary and is less likely to scavenge than the related greater adjutant. It is a widespread species found from India through Southeast Asia to Java.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_adjutant"
  },
  {
    "id": 25,
    "category": 7,
    "name": "Glossy Ibis",
    "sinhala": "සිලුටු දෑතුඩුවා",
    "scientific": "Plegadis falcinellus falcinellus",
    "image": "glossy_ibis.jpg",
    "desc": "The glossy ibis is a wading bird in the ibis family Threskiornithidae. The scientific name derives from Ancient Greek plegados and Latin, falcis, both meaning sickle and referring to the distinctive shape of the bill.",
    "migrant": 1,
    "endemic": 0,
    "code": "S",
    "wikipedia": "https://en.wikipedia.org/wiki/Glossy_ibis"
  },
  {
    "id": 26,
    "category": 7,
    "name": "Black-Headed Ibis",
    "sinhala": "සුදු දෑතුඩුවා",
    "scientific": "Threskiornis melanocephalus",
    "image": "black_headed_ibis.jpg",
    "desc": "The black-headed ibis, also known as the Oriental white ibis, Indian white ibis, and black-necked ibis, is a species of wading bird of the ibis family Threskiornithidae which breeds in the South- and Southeast Asia from India to the west and as far east as Japan.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-headed_ibis"
  },
  {
    "id": 27,
    "category": 7,
    "name": "Eurasian Spoonbill",
    "sinhala": "යුරාසියා හැඳිඅලවා",
    "scientific": "Platalea Leucorodia Leucorodia",
    "image": "eurasian_spoonbill.jpg",
    "desc": "The Eurasian spoonbill or common spoonbill is a wading bird of the ibis and spoonbill family Threskiornithidae. The genus name Platalea is from Latin and means broad, referring to the distinctive shape of the bill, and leucorodia is from Ancient Greek leukerodios spoonbill, itself derived from leukos, white and erodios heron.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_spoonbill"
  },
  {
    "id": 28,
    "category": 8,
    "name": "Greater Flamingo",
    "sinhala": "රජ සියක්කාරයෝ",
    "scientific": "Phoenicopterus Ruber Roseus",
    "image": "greater_flamingo.jpg",
    "desc": "The greater flamingo is the most widespread and largest species of the flamingo family. It is found in Africa, on the Indian subcontinent, in the Middle East, and in southern Europe.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_flamingo"
  },
  {
    "id": 29,
    "category": 9,
    "name": "Lesser Whistling-Duck",
    "sinhala": "කුඩා තඹ සේරුවා",
    "scientific": "Dendrocygna Javanica",
    "image": "lesser_whistling_duck.jpg",
    "desc": "The lesser whistling duck, also known as Indian whistling duck or lesser whistling teal, is a species of whistling duck that breeds in the Indian subcontinent and Southeast Asia. They are nocturnal feeders that during the day may be found in flocks around lakes and wet paddy fields. They can perch on trees and sometimes build their nest in the hollow of a tree.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_whistling_duck"
  },
  {
    "id": 30,
    "category": 9,
    "name": "Cotton Pygmy-Goose",
    "sinhala": "මල් සේරුවා",
    "scientific": "Nettapus Coromandelianus Coromandelianus",
    "image": "cotton_pygmy_goose.jpg",
    "desc": "The cotton pygmy goose or cotton teal is a small perching duck which breeds in Pakistan, India, Bangladesh, Southeast Asia and south to Queensland. Small individuals of this species are the smallest waterfowl on earth, at as little as 160 g (5.6 oz) and 26 cm (10 in). The goose-like bill is short and deep at the base. The head is rounded and the legs are short. The plumage is mostly white.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Cotton_pygmy_goose"
  },
  {
    "id": 31,
    "category": 9,
    "name": "Eurasian Wigeon",
    "sinhala": "විජානිය සේරුවා",
    "scientific": "Anas Penelope",
    "image": "eurasian_wigeon.jpg",
    "desc": "The Eurasian wigeon, also known as widgeon is one of three species of wigeon in the dabbling duck genus Mareca. It is common and widespread within its range. This dabbling duck is 42–52 cm (17–20 in) long with a 71–80 cm (28–31 in) wingspan, and a weight of 500–1,073 g (1.102–2.366 lb). The breeding male has grey flanks and back, with a black rear end, a dark green speculum and a brilliant white patch on upper wings, obvious in flight or at rest. It has a pink breast, white belly, and a chestnut head with a creamy crown. In non-breeding (eclipse) plumage, the drake looks more like the female. The female is light brown, with plumage much like a female American wigeon. It can be distinguished from most other ducks, apart from American wigeon, on shape. However, that species has a paler head and white axillaries on its underwing. The female can be a rufous morph with a redder head, and a gray morph with a more gray head.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_wigeon"
  },
  {
    "id": 32,
    "category": 9,
    "name": "Common Teal",
    "sinhala": "යුරෝපීය සේරුවා",
    "scientific": "Anas Crecca Crecca",
    "image": "common_teal.jpg",
    "desc": "The Eurasian teal or common teal is a common and widespread duck which breeds in temperate Eurasia and migrates south in winter. The Eurasian teal is often called simply the teal due to being the only one of these small dabbling ducks in much of its range. The bird gives its name to the blue-green colour teal.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_teal"
  },
  {
    "id": 33,
    "category": 9,
    "name": "Spot-Billed Duck",
    "sinhala": "තිත් හොට සේරුවා",
    "scientific": "Anas Poecilorhyncha Poecilorhyncha",
    "image": "spot_billed_duck.jpg",
    "desc": "The Indian spot-billed duck is a large dabbling duck that is a non-migratory breeding duck throughout freshwater wetlands in the Indian subcontinent. The name is derived from the red spot at the base of the bill that is found in the mainland Indian population. When in water it can be recognized from a long distance by the white tertials that form a stripe on the side, and in flight it is distinguished by the green speculum with a broad white band at the base.",
    "migrant": 1,
    "endemic": 0,
    "code": "SHRM",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_spot-billed_duck"
  },
  {
    "id": 34,
    "category": 9,
    "name": "Northern Pintail",
    "sinhala": "උතුරු උල්පෙඳ සේරුවා",
    "scientific": "Anas Acuta Acuta",
    "image": "northern_pintail.jpg",
    "desc": "The pintail or northern pintail is a duck with wide geographic distribution that breeds in the northern areas of Europe, Asia and North America. It is migratory and winters south of its breeding range to the equator. Unusually for a bird with such a large range, it has no geographical subspecies if the possibly conspecific duck Eaton's pintail is considered to be a separate species.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Northern_pintail"
  },
  {
    "id": 35,
    "category": 9,
    "name": "Garganey",
    "sinhala": "ගාගනී සේරුවා",
    "scientific": "Anas Querquedula",
    "image": "garganey.jpg",
    "desc": "The garganey is a small dabbling duck. It breeds in much of Europe and western Asia, but is strictly migratory, with the entire population moving to southern Africa, India (in particular Santragachi), and Australasia in winter, where large flocks can occur. This species was first described by Linnaeus in 1758. Like other small ducks such as the common teal, this species rises easily from the water with a fast twisting wader-like flight.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Garganey"
  },
  {
    "id": 36,
    "category": 9,
    "name": "Northern Shoveller",
    "sinhala": "උතුරු ශවල සේරුවා",
    "scientific": "Anas Clypeata",
    "image": "northern_shoveller.jpg",
    "desc": "The northern shoveler, known simply in Britain as the shoveler, is a common and widespread duck. It breeds in northern areas of Europe and Asia and across most of North America, wintering in southern Europe, Africa, the Indian subcontinent, Southeast Asia, and Central, and northern South America. It is a rare vagrant to Australia. In North America, it breeds along the southern edge of Hudson Bay and west of this body of water, and as far south as the Great Lakes west to Colorado, Nevada, and Oregon.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Northern_shoveler"
  },
  {
    "id": 37,
    "category": 9,
    "name": "Tufted Duck",
    "sinhala": "කුඩුම්බි මඩ සේරුවා",
    "scientific": "Aythya Fuligula",
    "image": "tufted_duck.jpg",
    "desc": "The tufted duck is a small diving duck with a population of close to one million birds, found in northern Eurasia. The scientific name is derived from Ancient Greek aithuia an unidentified seabird mentioned by authors including Hesychius and Aristotle, and Latin, fuligo 'soot' and gula 'throat'.",
    "migrant": 0,
    "endemic": 0,
    "code": "",
    "wikipedia": "https://en.wikipedia.org/wiki/Tufted_duck"
  },
  {
    "id": 38,
    "category": 10,
    "name": "Oriental Honey-Buzzard",
    "sinhala": "සිලුවැති බඹරුකුස්සා",
    "scientific": "Pernis Ptilorhynchus Orientails",
    "image": "oriental_honey_buzzard.jpg",
    "desc": "The crested honey buzzard is a bird of prey in the family Accipitridae, which also includes many other diurnal raptors such as kites, eagles, and harriers. This species is also known as the Oriental honey buzzard.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Crested_honey_buzzard"
  },
  {
    "id": 39,
    "category": 10,
    "name": "Oriental Honey-Buzzard(Indian)",
    "sinhala": "සිලුවැති බඹරඋකුස්සා",
    "scientific": "Pernis Ptilorhynchus Ruficollis",
    "image": "oriental_honey_buzzard_ind.jpg",
    "desc": "The crested honey buzzard is a bird of prey in the family Accipitridae, which also includes many other diurnal raptors such as kites, eagles, and harriers. This species is also known as the Oriental honey buzzard.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Crested_honey_buzzard"
  },
  {
    "id": 40,
    "category": 10,
    "name": "Black-Shouldered Kite",
    "sinhala": "උරිස් කළු පතනුඋකුස්සා",
    "scientific": "Elanus Caeruleus Vociferus",
    "image": "black_shouldered_kite.jpg",
    "desc": "The black-shouldered kite, also known as the Australian black-shouldered kite, is a small raptor found in open habitat throughout Australia. It resembles similar species found in Africa, Eurasia and North America, including the black-winged kite, a species that has in the past also been called 'black-shouldered kite'. Measuring around 35 cm (14 in) in length with a wingspan of 80–100 cm (31–39 in), the adult black-shouldered kite has predominantly grey-white plumage and prominent black markings above its red eyes.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-shouldered_kite"
  },
  {
    "id": 41,
    "category": 10,
    "name": "Black Kite",
    "sinhala": "බොර පරඋකුස්සා",
    "scientific": "Milvus Migrans Govinda",
    "image": "black_kite.jpg",
    "desc": "The black kite is a medium-sized bird of prey in the family Accipitridae, which also includes many other diurnal raptors. It is thought to be the world's most abundant species of Accipitridae, although some populations have experienced dramatic declines or fluctuations. Current global population estimates run up to 6 million individuals. Unlike others of the group, black kites are opportunistic hunters and are more likely to scavenge. They spend a lot of time soaring and gliding in thermals in search of food.",
    "migrant": 1,
    "endemic": 0,
    "code": "SRM",
    "wikipedia": "https://en.wikipedia.org/wiki/Black_kite"
  },
  {
    "id": 42,
    "category": 10,
    "name": "Brahminy Kite",
    "sinhala": "බමුණු පියාඋකුස්සා",
    "scientific": "Haliastur Indus Indus",
    "image": "brahminy_kite.jpg",
    "desc": "The brahminy kite, also known as the red-backed sea-eagle in Australia, is a medium-sized bird of prey in the family Accipitridae, which also includes many other diurnal raptors, such as eagles, buzzards, and harriers. They are found in the Indian subcontinent, Southeast Asia, and Australia. They are found mainly on the coast and in inland wetlands, where they feed on dead fish and other prey. Adults have a reddish-brown body plumage contrasting with their white head and breast which make them easy to distinguish from other birds of prey.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Brahminy_kite"
  },
  {
    "id": 43,
    "category": 10,
    "name": "White-Bellied Sea Eagle",
    "sinhala": "සේතෝදර මූදු රාජාලියා",
    "scientific": "Haliaeetus Leucogaster",
    "image": "white_bellied_sea_eagle.jpg",
    "desc": "The white-bellied sea eagle, also known as the white-breasted sea eagle, is a large diurnal bird of prey in the family Accipitridae. Resident from India and Sri Lanka through Southeast Asia to Australia on coasts and major waterways, the white-bellied sea eagle breeds and hunts near water, and fish form around half of its diet. Opportunistic, it consumes carrion and a wide variety of animals.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/White-bellied_sea_eagle"
  },
  {
    "id": 44,
    "category": 10,
    "name": "Grey-Headed Fish Eagle",
    "sinhala": "රජ අළුහිස් මසුඋකුස්සා",
    "scientific": "Icthyophaga Icthyaetus",
    "image": "grey_headed_fish_eagle.jpg",
    "desc": "The grey-headed fish eagle is a fish-eating bird of prey from South East Asia. It is a large stocky raptor with adults having dark brown upper body, grey head and lighter underbelly and white legs. Juveniles are paler with darker streaking. It is often confused with the lesser fish eagle (Haliaeetus humilis) and the Pallas's fish eagle. The lesser fish eagle is similar in plumage but smaller and the Pallas’s fish eagle shares the same habitat and feeding behaviour but is larger with longer wings and darker underparts. Is often called tank eagle in Sri Lanka due to its fondness for irrigation tanks.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey-headed_fish_eagle"
  },
  {
    "id": 45,
    "category": 10,
    "name": "Crested Serpent Eagle",
    "sinhala": "සිළු සරපඋකුස්සා",
    "scientific": "Spilornis Cheela Spilogaster",
    "image": "crested_serpent_eagle.jpg",
    "desc": "The crested serpent eagle is a medium-sized bird of prey that is found in forested habitats across tropical Asia. Within its widespread range across the Indian Subcontinent, Southeast Asia and East Asia, there are considerable variations and some authorities prefer to treat several of its subspecies as completely separate species.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Crested_serpent_eagle"
  },
  {
    "id": 46,
    "category": 10,
    "name": "Pallid Harrier",
    "sinhala": "සුදුමැලි හැරිඋකුස්සා",
    "scientific": "Circus Macrourus",
    "image": "pallid_harrier.jpg",
    "desc": "The pale or pallid harrier is a migratory bird of prey of the harrier family. The scientific name is derived from the Ancient Greek. It breeds in southern parts of eastern Europe and central Asia (such as Iran) and winters mainly in India and southeast Asia. It is a very rare vagrant to Great Britain and western Europe.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Pallid_harrier"
  },
  {
    "id": 47,
    "category": 10,
    "name": "Shikra",
    "sinhala": "කුරුළුගොයා",
    "scientific": "Accipiter Badius Badius",
    "image": "shikra.jpg",
    "desc": "The shikra is a small bird of prey in the family Accipitridae found widely distributed in Asia and Africa where it is also called the little banded goshawk. The African forms may represent a separate species but have usually been considered as subspecies of the shikra. The shikra is very similar in appearance to other sparrowhawk species including the Chinese goshawk and Eurasian sparrowhawk. They have a sharp two note call and have the typical flap and glide flight. Their calls are imitated by drongos and the common hawk-cuckoo resembles it in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Shikra"
  },
  {
    "id": 48,
    "category": 10,
    "name": "Common Buzzard",
    "sinhala": "යුරාසියා ලැසි උකුස්සා",
    "scientific": "Buteo Buteo Japonicus",
    "image": "common_buzzard.jpg",
    "desc": "The common buzzard is a medium-to-large bird of prey whose range covers most of Europe and extends into Asia. Over much of its range, it is resident year-round, but birds from the colder parts of the Northern Hemisphere typically migrate south (some well into the Southern Hemisphere) for the northern winter.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_buzzard"
  },
  {
    "id": 49,
    "category": 10,
    "name": "Black Eagle",
    "sinhala": "කළු උකුස්සා",
    "scientific": "Ictinaetus Malayensis Perniger",
    "image": "black_eagle.jpg",
    "desc": "The black eagle is a bird of prey. Like all eagles, it is in the family Accipitridae, and is the only member of the genus Ictinaetus. They soar over forests in the hilly regions of tropical and subtropical South and Southeast Asia, as well as southeastern China. They hunt mammals and birds, particularly at their nests. They are easily identified by their widely splayed and long primary 'fingers', the characteristic silhouette, slow flight and yellow ceres and legs that contrast with their dark feathers.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black_eagle"
  },
  {
    "id": 50,
    "category": 10,
    "name": "Crested Hawk Eagle",
    "sinhala": "පෙරළි කොන්ඩ උකුස්සා",
    "scientific": "Spizaetus Cirrhatus Ceylanensis",
    "image": "crested_hawk_eagle.jpg",
    "desc": "The changeable hawk-eagle or crested hawk-eagle is a bird of prey species of the family Accipitridae. It was formerly placed in the genus Spizaetus, but studies pointed to the group being paraphyletic resulting in the Old World members being placed in Nisaetus (Hodgson, 1836) and separated from the New World species.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Changeable_hawk-eagle"
  },
  {
    "id": 51,
    "category": 10,
    "name": "Mountain Hawk Eagle",
    "sinhala": "හෙල් කොණ්ඩ උකුස්සා",
    "scientific": "Spizaetus Nipalensis Kelaarti",
    "image": "mountain_hawk_eagle.jpg",
    "desc": "The mountain hawk-eagle or Hodgson's hawk-eagle (Nisaetus nipalensis, earlier treated under Spizaetus) is a bird of prey. Like all eagles, it is in the family Accipitridae. It breeds in the Indian subcontinent, from India, Nepal (hence the epithet nipalensis) through Bangladesh to Thailand, Taiwan, Indonesia and Japan.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Mountain_hawk-eagle"
  },
  {
    "id": 52,
    "category": 11,
    "name": "Common Kestrel",
    "sinhala": "පරි සාරිඋකුස්සා",
    "scientific": "Falco Tinnunculus Tinnunculus",
    "image": "common_kestrel.jpg",
    "desc": "The common kestrel is a bird of prey species belonging to the kestrel group of the falcon family Falconidae. It is also known as the European kestrel, Eurasian kestrel, or Old World kestrel. In Britain, where no other kestrel species occurs, it is generally just called 'the kestrel'.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_kestrel"
  },
  {
    "id": 53,
    "category": 12,
    "name": "Grey Francolin",
    "sinhala": "අළු වටු-කුකුළා",
    "scientific": "Francolinus Pondicerianus Pondicerianus",
    "image": "grey_francolin.jpg",
    "desc": "The grey francolin is a species of francolin found in the plains and drier parts of the Indian subcontinent. This species was formerly also called the grey partridge, not to be confused with the European grey partridge. They are found in open cultivated lands as well as scrub forest and their local name of teetar is based on their calls, a loud and repeated Ka-tee-tar...tee-tar which is produced by one or more birds. The term teetar can also refer to other partridges and quails. During the breeding season calling males attract challengers and decoys were used to trap these birds especially for fighting.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey_francolin"
  },
  {
    "id": 54,
    "category": 12,
    "name": "Ceylon Junglefowl",
    "sinhala": "ශ්‍රී ලංකා වලි-කුකුළා",
    "scientific": "Gallus Lafayettii",
    "image": "ceylon_junglefowl.jpg",
    "desc": "The Sri Lankan junglefowl, also known as the Ceylon junglefowl, is a member of the Galliformes bird order which is endemic to Sri Lanka, where it is the national bird. It is closely related to the red junglefowl (G. gallus), the wild junglefowl from which the chicken was domesticated. The specific name of the Sri Lankan junglefowl commemorates the French aristocrat Gilbert du Motier, marquis de La Fayette.",
    "migrant": 0,
    "endemic": 1,
    "code": "CE",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lankan_junglefowl"
  },
  {
    "id": 55,
    "category": 12,
    "name": "Indian Peafowl",
    "sinhala": "මොනරා",
    "scientific": "Pavo Cristatus",
    "image": "indian_peafowl.jpg",
    "desc": "The Indian peafowl or blue peafowl, a large and brightly coloured bird, is a species of peafowl native to South Asia, but introduced in many other parts of the world. The male, or peacock, is predominantly blue with a fan-like crest of spatula-tipped wire-like feathers and is best known for the long train made up of elongated upper-tail covert feathers which bear colourful eyespots. These stiff feathers are raised into a fan and quivered in a display during courtship. Despite the length and size of these covert feathers, peacocks are still capable of flight.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_peafowl"
  },
  {
    "id": 56,
    "category": 13,
    "name": "Barred Buttonquail",
    "sinhala": "බෝල වටුයුරුවා",
    "scientific": "Turnix Suscitator Leggei",
    "image": "barred_buttonquail.jpg",
    "desc": "The barred buttonquail or common bustard-quail is a buttonquail, one of a small family of birds which resemble, but are unrelated to, the true quails. This species is resident from India across tropical Asia to south China, Indonesia and the Philippines.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Barred_buttonquail"
  },
  {
    "id": 57,
    "category": 14,
    "name": "White-Breasted Waterhen",
    "sinhala": "ළය සුදු කොරවක්කා",
    "scientific": "Amaurornis phoenicurus phoenicurus",
    "image": "white_breasted_waterhen.jpg",
    "desc": "The white-breasted waterhen is a waterbird of the rail and crake family, Rallidae, that is widely distributed across South and Southeast Asia. They are dark slaty birds with a clean white face, breast and belly. They are somewhat bolder than most other rails and are often seen stepping slowly with their tail cocked upright in open marshes or even drains near busy roads. They are largely crepuscular in activity and during the breeding season, just after the first rains, make loud and repetitive croaking calls.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/White-breasted_waterhen"
  },
  {
    "id": 58,
    "category": 14,
    "name": "Common Moorhen",
    "sinhala": "පොදු ගැලිනුවා",
    "scientific": "Gallinula Chloropus Indica",
    "image": "common_moorhen.jpg",
    "desc": "The common moorhen (also known as the waterhen and as the swamp chicken) is a bird species in the family Rallidae. It is distributed across many parts of the Old World. The common moorhen lives around well-vegetated marshes, ponds, canals and other wetlands. The species is not found in the polar regions or many tropical rainforests.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_moorhen"
  },
  {
    "id": 59,
    "category": 14,
    "name": "Purple Swamphen",
    "sinhala": "පොදු දම් කිතලා",
    "scientific": "Porphyrio Porphyrio Poliocephalus",
    "image": "purple_swamphen.jpg",
    "desc": "The western swamphen is a swamphen in the rail family Rallidae, one of the six species of purple swamphen. From the French name talève sultane, it is also known as the sultana bird. This chicken-sized bird, with its large feet, bright plumage and red bill and frontal shield is easily recognisable in its native range. It used to be considered the nominate subspecies of the purple swamphen. It is found on the Iberian Peninsula, in France, Sardinia and western North Africa to Tunisia.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Western_swamphen"
  },
  {
    "id": 60,
    "category": 14,
    "name": "Watercock",
    "sinhala": "කෝරා",
    "scientific": "Gallicrex Cinerea Cinerea",
    "image": "watercock.jpg",
    "desc": "The watercock is a waterbird in the rail and crake family, Rallidae. It is the only member of the genus Gallicrex. Traditionally held to be closely related to moorhens (which the adult male visually closely resembles), it is actually member of a mostly tropical Asian clade containing also Aenigmatolimnas, Amaurornis, Himantornis and Megacrex.",
    "migrant": 1,
    "endemic": 0,
    "code": "URSM",
    "wikipedia": "https://en.wikipedia.org/wiki/Watercock"
  },
  {
    "id": 61,
    "category": 14,
    "name": "Common Coot",
    "sinhala": "පොදු කළු කිතලා",
    "scientific": "Fulica Atra Atra",
    "image": "common_coot.jpg",
    "desc": "The Eurasian coot, also known as the common coot, is a member of the rail and crake bird family, the Rallidae. The scientific name is from Latin; Fulica is 'coot', and atra is 'black'. It is found in Europe, Asia, Australia and parts of Africa. The Australian subspecies is known as the Australian coot.",
    "migrant": 1,
    "endemic": 0,
    "code": "URSM",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_coot"
  },
  {
    "id": 62,
    "category": 15,
    "name": "Pheasant-Tailed Jacana",
    "sinhala": "සැවුල් පෙඳ දියසෑනා",
    "scientific": "Hydrophasianus Chirurgus",
    "image": "pheasant_tailed_jacana.jpg",
    "desc": "The pheasant-tailed jacana is a jacana in the monotypic genus Hydrophasianus. Jacanas are a group of waders in the family Jacanidae that are identifiable by their wide feet and claws which enable them to walk on floating vegetation in shallow lakes, their preferred habitat. The pheasant-tailed jacana is capable of swimming, although it usually walks on the vegetation. The females are more colourful than the males and are polyandrous.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Pheasant-tailed_jacana"
  },
  {
    "id": 63,
    "category": 16,
    "name": "Greater Painted Snipe",
    "sinhala": "රජ උලු කැස්වටුවා",
    "scientific": "Rostratula Benghalensis Benghalensis",
    "image": "greater_painted_snipe.jpg",
    "desc": "The greater painted-snipe is a species of wader in the family Rostratulidae. It is found in marshes in Africa, South Asia and South-east Asia. Medium-sized, plump wading bird. Long reddish-brown bill, slightly decurved at tip, and distinct white or pinkish eye patch. Rounded, buff-spotted wings and short tail. White of breast extends up around top of folded wing. The painted-snipe is not related to the true snipes and differs from them in habits, flight and appearance, being far more colorful and having longer legs than the snipes.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_painted-snipe"
  },
  {
    "id": 64,
    "category": 17,
    "name": "Eurasian Oystercatcher",
    "sinhala": "ආසියා බොලුගුල්ලා",
    "scientific": "Haematopus Ostralegus Longipes",
    "image": "eurasian_oystercatcher.jpg",
    "desc": "The Eurasian oystercatcher also known as the common pied oystercatcher, or palaearctic oystercatcher, or (in Europe) just oystercatcher, is a wader in the oystercatcher bird family Haematopodidae. It is the most widespread of the oystercatchers, with three races breeding in western Europe, central Eurasia, Kamchatka, China, and the western coast of Korea. No other oystercatcher occurs within this area.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_oystercatcher"
  },
  {
    "id": 65,
    "category": 18,
    "name": "Black-winged Stilt",
    "sinhala": "කළුපිය ඉපල්පාවා",
    "scientific": "Himantopus Himantopus Himantopus",
    "image": "black_winged_stilt.jpg",
    "desc": "The black-winged stilt is a widely distributed very long-legged wader in the avocet and stilt family. Adults are 33–36 cm (13–14 in) long. They have long pink legs, a long thin black bill and are blackish above and white below, with a white head and neck with a varying amount of black. Males have a black back, often with greenish gloss. Females' backs have a brown hue, contrasting with the black remiges.",
    "migrant": 1,
    "endemic": 0,
    "code": "CRM",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-winged_stilt"
  },
  {
    "id": 66,
    "category": 19,
    "name": "Indian Thick-Knee",
    "sinhala": "යුරාසියා ගොළුකිරළුවා",
    "scientific": "Burhinus Indicus",
    "image": "indian_thick_knee.jpg",
    "desc": "The Indian stone-curlew or Indian thick-knee is a species of bird in the family Burhinidae. It was formerly included as a subspecies of the Eurasian stone-curlew. This species is found in the plains of India, Pakistan, Nepal and Sri Lanka. They have large eyes and are brown with streaks and pale marks making it hard to spot against the background of soils and rocks. Mostly active in the dark, they produce calls similar to the true curlews, giving them their names.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_stone-curlew"
  },
  {
    "id": 67,
    "category": 19,
    "name": "Great Thick-Knee",
    "sinhala": "මහ ගොළුකිරළුවා",
    "scientific": "Esacus Recurvirostris",
    "image": "great_thick_knee.jpg",
    "desc": "The great stone-curlew or great thick-knee is a large wader which is a resident breeder in tropical southern Asia from India, Pakistan, Sri Lanka, Bangladesh[2] into South-east Asia. This species prefers gravel banks along rivers or large lakes, and also beaches. A single egg is laid in a bare scrape on the open shingle.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_stone-curlew"
  },
  {
    "id": 68,
    "category": 20,
    "name": "Small Pratincole",
    "sinhala": "පුංචි ජවසැරියා",
    "scientific": "Glareola Lactea",
    "image": "small_pratincole.jpg",
    "desc": "The small pratincole, little pratincole, or small Indian pratincole, is a small wader in the pratincole family, Glareolidae. The small pratincole is a resident breeder in India, Western Pakistan, Bangladesh, Burma, Laos, Cambodia, Sri Lanka and Thailand. It breeds from December to March on gravel or sand banks near rivers and lakes, laying 2-4 eggs in a ground scrape.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Small_pratincole"
  },
  {
    "id": 69,
    "category": 21,
    "name": "Little Ringed Plover",
    "sinhala": "පුංචි මාල ඔලෙවියා",
    "scientific": "Charadrius Dubius",
    "image": "little_ringed_plover.jpg",
    "desc": "The little ringed plover is a small plover. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in river valleys (kharadra, 'ravine'). The specific dubius is Latin for doubtful, since Sonnerat, writing in 1776, thought this bird might be just a variant of common ringed plover.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_ringed_plover"
  },
  {
    "id": 70,
    "category": 21,
    "name": "Common Ringed Plover",
    "sinhala": "පොදු මාල ඔලෙවියා",
    "scientific": "Charadrius Hiaticula Tundrae",
    "image": "common_ringed_plover.jpg",
    "desc": "The common ringed plover or ringed plover is a small plover that breeds in Arctic Eurasia. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in ravines and river valleys (kharadra, 'ravine'). The specific hiaticula is Latin and has a similar meaning to the Greek term, coming from hiatus, 'cleft' and -cola, 'dweller' (colere, 'to dwell').",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_ringed_plover"
  },
  {
    "id": 71,
    "category": 21,
    "name": "Kentish Plover",
    "sinhala": "කෙන්ටි ඔලෙවියා",
    "scientific": "Charadrius Alexandrinus Alexandrinus",
    "image": "kentish_plover.jpg",
    "desc": "The Kentish plover is a small cosmopolitan shorebird (40-44 g) of the family Charadriidae that breeds on the shores of saline lakes, lagoons, and coasts, populating sand dunes, marshes, semi-arid desert, and tundra. Both male and female birds have pale plumages with a white underside, grey/brown back, dark legs and a dark bill, however additionally the male birds also exhibit very dark incomplete breast bands, and dark markings either side of their head, therefore the Kentish plover is regarded as sexually dimorphic.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Kentish_plover"
  },
  {
    "id": 72,
    "category": 21,
    "name": "Lesser Sand Plover",
    "sinhala": "හීන් වැලි ඔලෙවියා",
    "scientific": "Charadrius Mongolus Atrifrons",
    "image": "lesser_sand_plover.jpg",
    "desc": "The lesser sand plover is a small wader in the plover family of birds. The spelling is commonly given as lesser sand-plover, but the official British Ornithologists' Union spelling is 'lesser sand plover'. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in ravines and river valleys (kharadra, 'ravine'). The specific mongolus is Latin and refers to Mongolia which at the time of naming referred to a larger area than the present country.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_sand_plover"
  },
  {
    "id": 73,
    "category": 21,
    "name": "Greater Sand Plover",
    "sinhala": "රජ වැලි ඔලෙවියා",
    "scientific": "Charadrius Leschenaultii Leschenavitii",
    "image": "greater_sand_plover.jpg",
    "desc": "The greater sand plover is a small wader in the plover family of birds. The spelling is commonly given as 'greater sandplover' or 'greater sand-plover', but the official British Ornithologists' Union spelling is 'Greater Sand Plover'. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in ravines and river valleys (kharadra, 'ravine'). The specific leschenaultii commemorates the French botanist Jean Baptiste Leschenault de la Tour.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_sand_plover"
  },
  {
    "id": 74,
    "category": 21,
    "name": "Caspian Plover",
    "sinhala": "කැස්පියානු ඔලෙවියා",
    "scientific": "Charadrius Asiaticus",
    "image": "caspian_plover.jpg",
    "desc": "The Caspian plover is a wader in the plover family of birds. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in ravines and river valleys (kharadra, 'ravine'). The specific asiaticus is Latin and means 'Asian', although in binomials it usually means the type locality was India.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Caspian_plover"
  },
  {
    "id": 75,
    "category": 21,
    "name": "Pacific Golden Plover",
    "sinhala": "සෙත්කර රන්මහ ඔලෙවියා",
    "scientific": "Pluvialis Fulva",
    "image": "pacific_golden_plover.jpg",
    "desc": "The Pacific golden plover is a medium-sized plover. The genus name is Latin and means relating to rain, from pluvia, 'rain'. It was believed that golden plovers flocked when rain was imminent. The species name fulva is Latin and refers to a tawny colour. The 23–26 cm long breeding adult is spotted gold and black on the crown, and back on the wings. Its face and neck are black with a white border, and it has a black breast and a dark rump. The legs are black. In winter, the black is lost and the plover then has a yellowish face and breast, and white underparts.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Pacific_golden_plover"
  },
  {
    "id": 76,
    "category": 21,
    "name": "Grey Plover",
    "sinhala": "අළු මහ ඔලෙවියා",
    "scientific": "Pluvialis Squatarola",
    "image": "grey_plover.jpg",
    "desc": "The grey plover, known as the black-bellied plover in North America, is a medium-sized plover breeding in Arctic regions. It is a long-distance migrant, with a nearly worldwide coastal distribution when not breeding. The genus name is Latin and means relating to rain, from pluvia, 'rain'. It was believed that golden plovers flocked when rain was imminent. The species name squatarola is a Latinised version of Sgatarola, a Venetian name for some kind of plover.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey_plover"
  },
  {
    "id": 77,
    "category": 21,
    "name": "Yellow-Wattled Lapwing",
    "sinhala": "කහ යටිමල් කිරලා",
    "scientific": "Vanellus Malabaricus",
    "image": "yellow_wattled_lapwing.jpg",
    "desc": "The yellow-wattled lapwing is a lapwing that is endemic to the Indian Subcontinent. It is found mainly on the dry plains of peninsular India and has a sharp call and is capable of fast flight. Although they do not migrate, they are known to make seasonal movements in response to rains. They are dull grey brown with a black cap, yellow legs and a triangular wattle at the base of the beak. Like other lapwings and plovers, they are ground birds and their nest is a mere collection of tiny pebbles within which their well camouflaged eggs are laid. The chicks are nidifugous, leaving the nest shortly after hatching and following their parents to forage for food.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow-wattled_lapwing"
  },
  {
    "id": 78,
    "category": 21,
    "name": "Red-wattled Lapwing",
    "sinhala": "රත් යටිමල් කිරලා",
    "scientific": "Vanellus Indicus Lankae",
    "image": "red_wattled_lapwing.jpg",
    "desc": "The red-wattled lapwing is an Asian lapwing or large plover, a wader in the family Charadriidae. Like other lapwings they are ground birds that are incapable of perching. Their characteristic loud alarm calls are indicators of human or animal movements and the sounds have been variously rendered as did he do it or pity to do it leading to the colloquial name of did-he-do-it bird. Usually seen in pairs or small groups and usually not far from water they sometimes form large aggregations in the non-breeding season (winter). They nest in a ground scrape laying three to four camouflaged eggs.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Red-wattled_lapwing"
  },
  {
    "id": 79,
    "category": 22,
    "name": "Little Stint",
    "sinhala": "පුංචි හින්නා",
    "scientific": "Calidris Minuta",
    "image": "little_stint.jpg",
    "desc": "The little stint, is a very small wader. It breeds in arctic Europe and Asia, and is a long-distance migrant, wintering south to Africa and south Asia. It occasionally is a vagrant to North America and to Australia. The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. The specific minuta is Latin for 'small'.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_stint"
  },
  {
    "id": 80,
    "category": 22,
    "name": "Great Knot",
    "sinhala": "මහනොට් හින්නා",
    "scientific": "Calidris Tenuirostris",
    "image": "great_knot.jpg",
    "desc": "The great knot is a small wader. It is the largest of the calidrid species. The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. The specific tenuirostris is from Latin tenuis 'slender' and rostrum 'bill'.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_knot"
  },
  {
    "id": 81,
    "category": 22,
    "name": "Red Knot",
    "sinhala": "රතුනොට් හින්නා",
    "scientific": "Calidris Canutus Canutus",
    "image": "red_knot.jpg",
    "desc": "The red knot (just knot in English-speaking Europe) is a medium-sized shorebird which breeds in tundra and the Arctic Cordillera in the far north of Canada, Europe, and Russia. It is a large member of the Calidris sandpipers, second only to the great knot. Six subspecies are recognised",
    "migrant": 1,
    "endemic": 0,
    "code": "SHM",
    "wikipedia": "https://en.wikipedia.org/wiki/Red_knot"
  },
  {
    "id": 82,
    "category": 22,
    "name": "Sanderling",
    "sinhala": "වැලිහින්නා",
    "scientific": "Calidris Alba",
    "image": "sanderling.jpg",
    "desc": "The sanderling is a small wading bird. The name derives from Old English sand-yrðling, 'sand-ploughman'.[2] The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. The specific alba is Latin for 'white'.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Sanderling"
  },
  {
    "id": 83,
    "category": 22,
    "name": "Temminck's Stint",
    "sinhala": "ටෙමිංක් හින්නා",
    "scientific": "Calidris Temminckii",
    "image": "temminck_s_stint.jpg",
    "desc": "Temminck's stint is a small wader. This bird's common name and Latin binomial commemorate the Dutch naturalist Coenraad Jacob Temminck. The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. Temminck's stint is one of the species to which the Agreement on the Conservation of African-Eurasian Migratory Waterbirds (AEWA) applies.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Temminck%27s_stint"
  },
  {
    "id": 84,
    "category": 22,
    "name": "Curlew Sandpiper",
    "sinhala": "කාලිකා හින්නා",
    "scientific": "Calidris Ferruginea",
    "image": "curlew_sandpiper.jpg",
    "desc": "The curlew sandpiper is a small wader that breeds on the tundra of Arctic Siberia. The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. The specific ferruginea is from Latin ferrugo, ferruginis, 'iron rust' referring to its colour in breeding plumage.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Curlew_sandpiper"
  },
  {
    "id": 85,
    "category": 22,
    "name": "Ruff",
    "sinhala": "ලොවිච්චියා",
    "scientific": "Philomachus Pugnax",
    "image": "ruff.jpg",
    "desc": "The ruff is a medium-sized wading bird that breeds in marshes and wet meadows across northern Eurasia. This highly gregarious sandpiper is migratory and sometimes forms huge flocks in its winter grounds, which include southern and western Europe, Africa, southern Asia and Australia.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Ruff"
  },
  {
    "id": 86,
    "category": 22,
    "name": "Pintail Snipe",
    "sinhala": "උල්පෙඳ කැස්වටුවා",
    "scientific": "Gallinago Stenura",
    "image": "pintail_snipe.jpg",
    "desc": "The pin-tailed snipe or pintail snipe is a species of bird in the family Scolopacidae, the sandpipers. It breeds in northern Russia and migrates to spend the non-breeding season in southern Asia from Pakistan to Indonesia. It is the most common migrant snipe in southern India, Sri Lanka and much of Southeast Asia. It is a vagrant to north-western and northern Australia, and to Kenya in East Africa.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Pin-tailed_snipe"
  },
  {
    "id": 87,
    "category": 22,
    "name": "Black-tailed Godwit",
    "sinhala": "කළුපෙඳ ගොහොදුවිත්තා",
    "scientific": "Limosa Limosa",
    "image": "black_tailed_godwit.jpg",
    "desc": "The black-tailed godwit is a large, long-legged, long-billed shorebird first described by Carl Linnaeus in 1758. It is a member of the godwit genus, Limosa. There are three subspecies, all with orange head, neck and chest in breeding plumage and dull grey-brown winter coloration, and distinctive black and white wingbar at all times.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-tailed_godwit"
  },
  {
    "id": 88,
    "category": 22,
    "name": "Bar-tailed Godwit",
    "sinhala": "වයිරපෙඳ  ගොහොදුවිත්තා",
    "scientific": "Limosa Lapponica Lapponica",
    "image": "bar_tailed_godwit.jpg",
    "desc": "The bar-tailed godwit is a large wader in the family Scolopacidae. The genus name Limosa is from Latin and means 'muddy', from limus, 'mud'. The specific lapponica refers to Lapland. The English term 'godwit' was first recorded in about 1416–7 and is believed to imitate the bird's call.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Bar-tailed_godwit"
  },
  {
    "id": 89,
    "category": 22,
    "name": "Whimbrel",
    "sinhala": "විඹුරැළි කාලිකයා",
    "scientific": "Numenius Phaeopus",
    "image": "whimbrel.jpg",
    "desc": "The whimbrel is a wader in the large family Scolopacidae. It is one of the most widespread of the curlews, breeding across much of subarctic North America, Asia and Europe as far south as Scotland. The whimbrel is a migratory bird wintering on coasts in Africa, southern North America, South America, and South Asia into Australasia. It is also a coastal bird during migration. It is fairly gregarious outside the breeding season.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Whimbrel"
  },
  {
    "id": 90,
    "category": 22,
    "name": "Eurasian Curlew",
    "sinhala": "යුරාසියා කාලිකයා",
    "scientific": "Numenius Arquata Orientalis",
    "image": "eurasian_curlew.jpg",
    "desc": "The Eurasian curlew or common curlew is a wader in the large family Scolopacidae. It is one of the most widespread of the curlews, breeding across temperate Europe and Asia. In Europe, this species is often referred to just as the 'curlew', and in Scotland known as the 'whaup' in Scots.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_curlew"
  },
  {
    "id": 91,
    "category": 22,
    "name": "Common Redshank",
    "sinhala": "පොදු රත්පා සිබිල්ලා",
    "scientific": "Tringa Totanus",
    "image": "common_redshank.jpg",
    "desc": "The common redshank or simply redshank is a Eurasian wader in the large family Scolopacidae. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific totanus is from Tótano, the Italian name for this bird.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_redshank"
  },
  {
    "id": 92,
    "category": 22,
    "name": "Marsh Sandpiper",
    "sinhala": "වගුරු සිබිල්ලා",
    "scientific": "Tringa Stagnatilis",
    "image": "marsh_sandpiper.jpg",
    "desc": "The marsh sandpiper is a small wader. It is a rather small shank, and breeds in open grassy steppe and taiga wetlands from easternmost Europe to central Asia. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific stagnatilis is from Latin stagnum, 'swamp'.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Marsh_sandpiper"
  },
  {
    "id": 93,
    "category": 22,
    "name": "Common Greenshank",
    "sinhala": "පොදු පලාපා සිබිල්ලා",
    "scientific": "Tringa Nebularia",
    "image": "common_greenshank.jpg",
    "desc": "The common greenshank is a wader in the large family Scolopacidae, the typical waders. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific nebularia is from Latin nebula 'mist'. Like the Norwegian Skoddefoll, this refers to the greenshank's damp marshy habitat.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_greenshank"
  },
  {
    "id": 94,
    "category": 22,
    "name": "Green Sandpiper",
    "sinhala": "කොළ සිබිල්ලා",
    "scientific": "Tringa Ochropus",
    "image": "green_sandpiper.jpg",
    "desc": "The green sandpiper is a small wader (shorebird) of the Old World. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific ochropus is from Ancient Greek okhros, 'ochre', and pous, 'foot'.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Green_sandpiper"
  },
  {
    "id": 95,
    "category": 22,
    "name": "Wood Sandpiper",
    "sinhala": "වන සිබිල්ලා",
    "scientific": "Tringa Glareola",
    "image": "wood_sandpiper.jpg",
    "desc": "The wood sandpiper is a small wader. This Eurasian species is the smallest of the shanks, which are mid-sized long-legged waders of the family Scolopacidae. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific glareola is from Latin glarea, 'gravel'.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Wood_sandpiper"
  },
  {
    "id": 96,
    "category": 22,
    "name": "Terek Sandpiper",
    "sinhala": "ටෙරෙක් සිබිල්ලා",
    "scientific": "Xenus Cinereus",
    "image": "terek_sandpiper.jpg",
    "desc": "The Terek sandpiper is a small migratory Palearctic wader species, the only member of the genus Xenus. It is named after the Terek River which flows into the west of the Caspian Sea, as it was first observed around this area. The genus name Xenus is from Ancient Greek xenos stranger, and cinereus is Latin for 'ash-grey' from cinis, cineris, 'ashes'.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Terek_sandpiper"
  },
  {
    "id": 97,
    "category": 22,
    "name": "Common Sandpiper",
    "sinhala": "පොදු සිබිල්ලා",
    "scientific": "Actitis Hypoleucos",
    "image": "common_sandpiper.jpg",
    "desc": "The common sandpiper is a small Palearctic wader. This bird and its American sister species, the spotted sandpiper (A. macularia), make up the genus Actitis. They are parapatric and replace each other geographically; stray birds of either species may settle down with breeders of the other and hybridize. Hybridization has also been reported between the common sandpiper and the green sandpiper, a basal species of the closely related shank genus Tringa.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_sandpiper"
  },
  {
    "id": 98,
    "category": 22,
    "name": "Ruddy Turnstone",
    "sinhala": "රත් ගල් පෙරලියා",
    "scientific": "Arenaria Interpres Interpres",
    "image": "ruddy_turnstone.jpg",
    "desc": "The ruddy turnstone is a small wading bird, one of two species of turnstone in the genus Arenaria. The scientific name is from Latin. The genus name arenaria derives from arenarius, 'inhabiting sand, from arena, 'sand'. The specific interpres means 'messenger'; when visiting Gotland in 1741, Linnaeus thought that the Swedish word Tolk 'interpreter' applied to this species, but in the local dialect the word means 'legs' and is used for the redshank.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Ruddy_turnstone"
  },
  {
    "id": 99,
    "category": 22,
    "name": "Red-Necked Phalarope",
    "sinhala": "රත්ගෙල දියවටුවා",
    "scientific": "Phalaropus Lobatus",
    "image": "red_necked_phalarope.jpg",
    "desc": "The red-necked phalarope is a small wader. This phalarope breeds in the Arctic regions of North America and Eurasia. It is migratory, and, unusually for a wader, winters at sea on tropical oceans.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Red-necked_phalarope"
  },
  {
    "id": 100,
    "category": 23,
    "name": "Pallas's Gull",
    "sinhala": "මහ කළුහිස් ගලුවියා",
    "scientific": "Larus Ihthyaetus",
    "image": "pallas_s_gull.jpg",
    "desc": "The Pallas's gull or great black-headed gull is a large gull. As is the case with many gulls, it has traditionally been placed in the genus Larus. The scientific name is from Ancient Greek. Ichthyaetus is from ikhthus, 'fish', and aetos, 'eagle'.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Pallas%27s_gull"
  },
  {
    "id": 101,
    "category": 23,
    "name": "Black-Headed Gull",
    "sinhala": "කළුහිස් ගලුවියා",
    "scientific": "Larus Ridibundus",
    "image": "black_headed_gull.jpg",
    "desc": "The black-headed gull is a small gull that breeds in much of Europe and Asia, and also in coastal eastern Canada. Most of the population is migratory and winters further south, but some birds reside in the milder westernmost areas of Europe. Some black-headed gulls also spend the winter in northeastern North America, where it was formerly known as the common black-headed gull. As is the case with many gulls, it was previously placed in the genus Larus.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-headed_gull"
  },
  {
    "id": 102,
    "category": 23,
    "name": "Brown-Headed Gull",
    "sinhala": "බොරහිස් ගලුවියා",
    "scientific": "Larus brunnicephalus",
    "image": "brown_headed_gull.jpg",
    "desc": "The brown-headed gull is a small gull which breeds in the high plateaus of central Asia from Tajikistan to Ordos in Inner Mongolia. It is migratory, wintering on the coasts and large inland lakes of the Indian Subcontinent. As is the case with many gulls, was traditionally placed in the genus Larus.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Brown-headed_gull"
  },
  {
    "id": 103,
    "category": 23,
    "name": "Heuglin's Gull",
    "sinhala": "හෙවුග්ලින් ගලුවියා",
    "scientific": "Larus Heuglini Heuglini",
    "image": "heuglin_s_gull.jpg",
    "desc": "Heuglin's gull or Siberian gull is a seabird in the genus Larus. It is sometimes considered as a separate species (Larus heuglini) but is now usually treated as a subspecies of the lesser black-backed gull.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Heuglin%27s_gull"
  },
  {
    "id": 104,
    "category": 24,
    "name": "Gull-billed Tern",
    "sinhala": "ගලුතුඩු සයුරු ළිහිණියා",
    "scientific": "Gelochelidon Nilotica Nilotica",
    "image": "gull_billed_tern.jpg",
    "desc": "The gull-billed tern, formerly Sterna nilotica, is a tern in the family Laridae. It is now considered to be in its own genus. The genus name is from Ancient Greek gelao, 'to laugh', and khelidon, 'swallow'. The specific niloticus is from Latin and means of the Nile.",
    "migrant": 1,
    "endemic": 0,
    "code": "SRCM",
    "wikipedia": "https://en.wikipedia.org/wiki/Gull-billed_tern"
  },
  {
    "id": 105,
    "category": 24,
    "name": "Caspian Tern",
    "sinhala": "කැස්පියානු මුහුදු ළිහිණියා",
    "scientific": "Sterna Caspia",
    "image": "caspian_tern.jpg",
    "desc": "The Caspian tern is a species of tern, with a subcosmopolitan but scattered distribution. Despite its extensive range, it is monotypic of its genus, and has no accepted subspecies. The genus name is from Ancient Greek hudros, 'water', and Latin progne, 'swallow'. The specific caspia is from Latin and, like the English name, refers to the Caspian Sea.",
    "migrant": 1,
    "endemic": 0,
    "code": "SRM",
    "wikipedia": "https://en.wikipedia.org/wiki/Caspian_tern"
  },
  {
    "id": 106,
    "category": 24,
    "name": "Large Crested Tern",
    "sinhala": "මහකොණ්ඩ මුහුදු ළිහිණියා",
    "scientific": "Sterna Bergii",
    "image": "large_crested_tern.jpg",
    "desc": "The greater crested tern, also called crested tern or swift tern, is a tern in the family Laridae that nests in dense colonies on coastlines and islands in the tropical and subtropical Old World. Its five subspecies breed in the area from South Africa around the Indian Ocean to the central Pacific and Australia, all populations dispersing widely from the breeding range after nesting. This large tern is closely related to the royal and lesser crested terns, but can be distinguished by its size and bill colour.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_crested_tern"
  },
  {
    "id": 107,
    "category": 24,
    "name": "Lesser Crested Tern",
    "sinhala": "හීන්කොණ්ඩ මුහුදු ළිහිණියා",
    "scientific": "Sterna Bengalensis Bengalensis",
    "image": "lesser_crested_tern.jpg",
    "desc": "The lesser crested tern is a tern in the family, Laridae. Like all Thalasseus terns, lesser crested tern feeds by plunge-diving for fish, usually from saline environments. It usually dives directly, and not from the 'stepped-hover' favoured by Arctic tern. The offering of fish by the male to the female is part of the courtship display.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_crested_tern"
  },
  {
    "id": 108,
    "category": 24,
    "name": "Sandwich Tern",
    "sinhala": "සැන්ඩ්විච් මුහුදු ළිහිණියා",
    "scientific": "Sterna Sandvicensis Sandvicensis",
    "image": "sandwich_tern.jpg",
    "desc": "The Sandwich tern is a tern in the family Laridae. It is very closely related to the lesser crested tern (T. bengalensis), Chinese crested tern (T. bernsteini), Cabot's tern (T. acuflavidus), and elegant tern (T. elegans) and has been known to interbreed with the lesser crested.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Sandwich_tern"
  },
  {
    "id": 109,
    "category": 24,
    "name": "Common Tern",
    "sinhala": "පොදු මුහුදු ළිහිණියා",
    "scientific": "Sterna Hirundo Tibetana",
    "image": "common_tern.jpg",
    "desc": "The common tern is a seabird in the family Laridae. This bird has a circumpolar distribution, its four subspecies breeding in temperate and subarctic regions of Europe, Asia and North America. It is strongly migratory, wintering in coastal tropical and subtropical regions. Breeding adults have light grey upperparts, white to very light grey underparts, a black cap, orange-red legs, and a narrow pointed bill. Depending on the subspecies, the bill may be mostly red with a black tip or all black. There are a number of similar species, including the partly sympatric Arctic tern, which can be separated on plumage details, leg and bill colour, or vocalisations.",
    "migrant": 1,
    "endemic": 0,
    "code": "RSM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_tern"
  },
  {
    "id": 110,
    "category": 24,
    "name": "Little Tern",
    "sinhala": "පුංචි මුහුදු ළිහිණියා",
    "scientific": "Sterna Albifrons Sinensis",
    "image": "little_terns.jpg",
    "desc": "The little tern is a seabird of the family Sternidae. It was formerly placed into the genus Sterna, which now is restricted to the large white terns. The genus name is a diminutive of Sterna, 'tern'. The specific albifrons is from Latin albus, 'white', and 'frons', forehead.[3] The former North American (S. a. antillarum) and Red Sea S. a. saundersi subspecies are now considered to be separate species, the least tern (Sternula antillarum) and Saunders's tern (Sternula saundersi).",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_tern"
  },
  {
    "id": 111,
    "category": 24,
    "name": "Saunder's Tern",
    "sinhala": "සෝන්ඩර් මුහුදු ළිහිණියා",
    "scientific": "Sterna Saundersi",
    "image": "saunder_s_tern.jpg",
    "desc": "The Saunders's tern is a species of tern in the family Laridae. It is found in Bahrain, Iran, Israel, Kenya, Madagascar, Pakistan, Oman, Saudi Arabia, Sri Lanka, Tanzania, United Arab Emirates, and Yemen.",
    "migrant": 0,
    "endemic": 0,
    "code": "SHR",
    "wikipedia": "https://en.wikipedia.org/wiki/Saunders%27s_tern"
  },
  {
    "id": 112,
    "category": 24,
    "name": "Whiskered Tern",
    "sinhala": "අළුපිය කාඟුල්ළිහිණියා",
    "scientific": "Chlidonias Hybridus Hybridus",
    "image": "whiskered_tern.jpg",
    "desc": "The whiskered tern is a tern in the family Laridae. The genus name is from Ancient Greek khelidonios, 'swallow-like', from khelidon, 'swallow'. The specific hybridus is Latin for hybrid; Pallas thought it might be a hybrid of white-winged black tern and common tern, writing 'Sterna fissipes [Chlidonias leucopterus] et Hirundine [Sterna hirundo] natam'.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Whiskered_tern"
  },
  {
    "id": 113,
    "category": 24,
    "name": "White-Winged Tern",
    "sinhala": "සුදුපිය කාඟුල්ළිහිණියා",
    "scientific": "Chlidonias Leucopterus",
    "image": "white_winged_tern.jpg",
    "desc": "The white-winged tern, or white-winged black tern, is a species of tern in the family Laridae. It is a small species generally found in or near bodies of fresh water across much of the world, including Europe, Africa, Asia, and Australia. The genus name is from Ancient Greek khelidonios, 'swallow-like', from khelidon, 'swallow'. The specific leptopterus is also Greek from leptos, 'slender', and pteros, 'feathered', itself from pteron, 'wing'.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/White-winged_tern"
  },
  {
    "id": 114,
    "category": 25,
    "name": "Sri Lanka Wood Pigeon",
    "sinhala": "ශ්‍රී ලංකා මයිල පරෙවියා",
    "scientific": "Columba Torringtonii",
    "image": "sri_lanka_wood_pigeon.jpg",
    "desc": "The Sri Lanka wood pigeon is a pigeon which is an endemic resident breeding bird in the mountains of Sri Lanka. This species nests in damp evergreen woodlands in the central highlands, building a stick nest in a tree and laying a single white egg. Its flight is quick, with the regular beats and an occasional sharp flick of the wings which are characteristic of pigeons in general. Most of its food is vegetable. Normally silent it utters an owl-like hoo call in the breeding season.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_wood_pigeon"
  },
  {
    "id": 115,
    "category": 25,
    "name": "Eurasian Collared Dove",
    "sinhala": "මාල කොබෙයියා",
    "scientific": "Streptopelia Decaota Decaota",
    "image": "eurasian_collared_dove.jpg",
    "desc": "The Eurasian collared dove, most often simply called the collared dove, also sometimes hyphenated as Eurasian collared-dove, is a species of dove native to warm temperate and subtropical Asia, and introduced in North America in the 1980s. In the latter half of the 20th century the species' native range vastly expanded, and it can now be found from Southeast Asia through to Western Europe.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_collared_dove"
  },
  {
    "id": 116,
    "category": 25,
    "name": "Spotted Dove",
    "sinhala": "අළු කොබෙයියා",
    "scientific": "Streptopelia Chinensis Ceylonensis",
    "image": "spotted_dove.jpg",
    "desc": "The Eurasian collared dove, most often simply called the collared dove, also sometimes hyphenated as Eurasian collared-dove, is a species of dove native to warm temperate and subtropical Asia, and introduced in North America in the 1980s. In the latter half of the 20th century the species' native range vastly expanded, and it can now be found from Southeast Asia through to Western Europe.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Spotted_dove"
  },
  {
    "id": 117,
    "category": 25,
    "name": "Orange-Breasted Green Pigeon",
    "sinhala": "ළයරන් බටගොයා",
    "scientific": "Treron Bicincta Leggei",
    "image": "orange_breasted_green_pigeon.jpg",
    "desc": "The orange-breasted green pigeon is a pigeon found across tropical Asia south of the Himalaya across parts of the Indian Subcontinent and Southeast Asia. Like other green pigeons, it feeds mainly on small fruit. They may be found in pairs or in small flocks, foraging quietly and moving slowly on trees. The nape is blue-grey and the crown is yellowish green. The uppertail coverts are bronzed and the undertail coverts are unmarked rufous. The male has a pinkish band on the upper breast with a broader orange one below while the female has a bright yellow breast.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Orange-breasted_green_pigeon"
  },
  {
    "id": 118,
    "category": 25,
    "name": "Pompadour Green Pigeon",
    "sinhala": "පොම්පදෝරු බටගොයා",
    "scientific": "Treron Pompadora",
    "image": "pompadour_green_pigeon.jpg",
    "desc": "The pompadour green pigeon (genus Treron) is a pigeon species complex. It is widespread in forests of southern and southeast Asia. It is a widespread group in forests of tropical southern Asia from India, Sri Lanka east to the Philippines and the Moluccas. In India, they are found as disjunct populations in the Western Ghats, some parts of the Eastern Ghats, Northeastern India and in the Andaman Islands.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Pompadour_green_pigeon"
  },
  {
    "id": 119,
    "category": 25,
    "name": "Green Imperial Pigeon",
    "sinhala": "නීලමහගොයා",
    "scientific": "Ducula Aenea Pusilla",
    "image": "green_imperial_pigeon.jpg",
    "desc": "The green imperial pigeon is a large forest pigeon. The green imperial pigeon is a large, plump pigeon, 45 cm in length. Its back, wings and tail are metallic green. The head and underparts are white, apart from maroon undertail coverts. Sexes are similar. The bird's call is deep and resonant, and is often the first indication of the presence of this treetop species. The Nicobar imperial pigeon is sometimes still considered conspecific.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Green_imperial_pigeon"
  },
  {
    "id": 120,
    "category": 26,
    "name": "Ceylon Hanging Parrot",
    "sinhala": "ශ්‍රී ලංකා ගිරාමලිත්තා",
    "scientific": "Loriculus Beryllinus",
    "image": "ceylon_hanging_parrot.jpg",
    "desc": "The Sri Lanka hanging parrot is a small parrot which is a resident endemic breeder in Sri Lanka. The Sri Lanka hanging parrot is a small, mainly green hanging parrot, only 13 cm long with a short tail. The adult has a red crown and rump. The nape and back have on orange tint. The chin and throat are pale blue. The beak is red and the irises are white.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_hanging_parrot"
  },
  {
    "id": 121,
    "category": 26,
    "name": "Alexandrine Parakeet",
    "sinhala": "ලබු ගිරවා",
    "scientific": "Psittacula Eupatria Eupatria",
    "image": "alexandrine_parakeet.jpg",
    "desc": "The Alexandrine parakeet, also known as the Alexandrine parrot, is a medium-sized parrot in the genus Psittacula of the family Psittacidae. It is named after Alexander the Great, who transported numerous birds from Punjab to various European and Mediterranean countries and regions, where they were prized by the royalty, nobility and warlords.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Alexandrine_parakeet"
  },
  {
    "id": 122,
    "category": 26,
    "name": "Rose-ringed Parakeet",
    "sinhala": "රෑන ගිරවා",
    "scientific": "Psittacula Krameri Manillensis",
    "image": "rose_ringed_parakeet.jpg",
    "desc": "The rose-ringed parakeet (Psittacula krameri), also known as the ring-necked parakeet, is a medium-sized parrot in the genus Psittacula of the family Psittacidae and has a very wide range The rose-ringed parakeet is sexually dimorphic. The adult male sports a red and black neck ring and the hen and immature birds of both sexes either show no neck rings, or display shadow-like pale to dark grey neck rings. Both sexes have a distinctive green colour.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Rose-ringed_parakeet"
  },
  {
    "id": 123,
    "category": 26,
    "name": "Plum-Headed Parakeet",
    "sinhala": "පඬු ගිරවා",
    "scientific": "Psittacula Cyanocephala Cyanocephala",
    "image": "plum_headed_parakeet.jpg",
    "desc": "The plum-headed parakeet is a parrot in the family Psittacidae. It is endemic to the Indian Subcontinent and was once thought to be conspecific with the blossom-headed parakeet (Psittacula roseata) but was later elevated to a full species. Plum-headed parakeets are found in flocks, the males having a pinkish purple head and the females, a grey head. They fly swiftly with twists and turns accompanied by their distinctive calls.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Plum-headed_parakeet"
  },
  {
    "id": 124,
    "category": 26,
    "name": "Layard's Parakeet",
    "sinhala": "අළු ගිරවා",
    "scientific": "Psittacula Calthropae",
    "image": "layard_s_parakeet.jpg",
    "desc": "The Layard's parakeet is a parrot which is a resident endemic breeder in Sri Lanka. The common name of this bird commemorates the British naturalist Edgar Leopold Layard; his first wife, Barbara Anne Calthrop, whom he married in 1845, is commemorated in the specific epithet.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Layard%27s_parakeet"
  },
  {
    "id": 125,
    "category": 27,
    "name": "Pied Cuckoo",
    "sinhala": "ගෝමර කොණ්ඩ කොහා",
    "scientific": "Clamator Jacobinus Jacobinus",
    "image": "pied_cuckoo.jpg",
    "desc": "The Jacobin cuckoo, pied cuckoo, or pied crested cuckoo is a member of the cuckoo order of birds that is found in Africa and Asia. It is partially migratory and in India, it has been considered a harbinger of the monsoon rains due to the timing of its arrival. It has been associated with a bird in Indian mythology and poetry, known as the chataka represented as a bird with a beak on its head that waits for rains to quench its thirst.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Jacobin_cuckoo"
  },
  {
    "id": 126,
    "category": 27,
    "name": "Common Hawk Cuckoo",
    "sinhala": "උකුසු කොහා",
    "scientific": "Hierococcyx Varius Varius",
    "image": "common_hawk_cuckoo.jpg",
    "desc": "The common hawk-cuckoo, popularly known as the brainfever bird, is a medium-sized cuckoo resident in the Indian subcontinent. It bears a close resemblance to the Shikra, even in its style of flying and landing on a perch. The resemblance to hawks gives this group the generic name of hawk-cuckoo and like many other cuckoos these are brood parasites, laying their eggs in nests of babblers. During their breeding season in summer males produce loud, repetitive three note calls that are well-rendered as brain-fever, the second note being longer and higher pitched. These notes rise to a crescendo before ending abruptly and repeat after a few minutes; the calling may go on through the day, well after dusk and before dawn.",
    "migrant": 1,
    "endemic": 0,
    "code": "SHM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_hawk-cuckoo"
  },
  {
    "id": 127,
    "category": 27,
    "name": "Grey-Bellied Cuckoo",
    "sinhala": "කසළු ගුරු කොහා",
    "scientific": "Cacomantis Passerinus",
    "image": "grey_bellied_cuckoo.jpg",
    "desc": "The grey-bellied cuckoo or the Indian plaintive cuckoo is a cuckoo with widespread occurrence throughout Asia",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey-bellied_cuckoo"
  },
  {
    "id": 128,
    "category": 27,
    "name": "Square-Tailed Drongo-Cuckoo",
    "sinhala": "කවුඩු කොහා",
    "scientific": "Surniculus Lugubris",
    "image": "square_tailed_drongo_cuckoo.jpg",
    "desc": "The square-tailed drongo-cuckoo is a species of cuckoo that resembles a black drongo. It is found in Sri Lanka and Southeast Asia and is a summer visitor to the Himalayas from Kashmir to eastern Bangladesh. The calls are series of piercing sharp whistles rising in pitch but shrill and choppily delivered.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Square-tailed_drongo-cuckoo"
  },
  {
    "id": 129,
    "category": 27,
    "name": "Asian Koel",
    "sinhala": "කොවුලා",
    "scientific": "Eudynamys Scolopacea Scolopacea",
    "image": "asian_koel.jpg",
    "desc": "The Asian koel is a member of the cuckoo order of birds, the Cuculiformes. It is found in the Indian Subcontinent, China, Bangladesh and Southeast Asia. It forms a superspecies with the closely related black-billed and Pacific koels which are sometimes treated as subspecies. The Asian koel is a brood parasite that lays its eggs in the nests of crows and other hosts, who raise its young. They are unusual among the cuckoos in being largely frugivorous as adults. The name koel is echoic in origin with several language variants. The bird is a widely used symbol in Indian poetry.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Asian_koel"
  },
  {
    "id": 130,
    "category": 27,
    "name": "Blue-Faced Malkoha",
    "sinhala": "වතනිල් මල්කොහා",
    "scientific": "Phaenicophaeus Viridirostris",
    "image": "blue_faced_malkoha.jpg",
    "desc": "The blue-faced malkoha or small green-billed malkoha is a non-parasitic cuckoo found in the scrub and deciduous forests of peninsular India and Sri Lanka. It has a waxy dark blue-grey plumage on its upperparts and has a long tail with graduated white-tipped feathers. The throat and chin are dark with spiny pale feathers that are branched. The lower belly is a dull creamy to rufous colour. The bill is apple green and naked patch of blue skin surrounds the eye. The sexes are alike. The blue-faced malkoha is a bird of open forests and scrub jungle.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Blue-faced_malkoha"
  },
  {
    "id": 131,
    "category": 27,
    "name": "Red-Faced Malkoha",
    "sinhala": "වතරතු මල්කොහා",
    "scientific": "Phaenicophaeus Pyrrhocephalus",
    "image": "red_faced_malkoha.jpg",
    "desc": "The red-faced malkoha is a member of the cuckoo order of birds, the Cuculiformes. This malkoha species is endemic to Sri Lanka. This is a large species at 46 cm with a long graduated tail. Its back is dark green, and the uppertail is green edged with white. The belly and undertail are white, the latter being barred black. The crown and throat are black, and the lower face white. There is a large red patch around the eye and the bill is green. Sexes are similar, but juveniles are much duller.",
    "migrant": 0,
    "endemic": 1,
    "code": "SE",
    "wikipedia": "https://en.wikipedia.org/wiki/Red-faced_malkoha"
  },
  {
    "id": 132,
    "category": 27,
    "name": "Sirkeer Malkoha",
    "sinhala": "පතන් මල්කොහා (පතන් ඇටිකුකුළා) ",
    "scientific": "Phaenicophaeus Leschenaultii Leschenaultii",
    "image": "sirkeer_malkoha.jpg",
    "desc": "The sirkeer malkoha or sirkeer cuckoo, is a non-parasitic cuckoo found in dry scrub forest and open woodland habitats in the Indian subcontinent. The species is long-tailed, largely olive brown on the upper side with a distinctive curved red beak tipped in yellow. They forage singly or in pairs mainly on or close to the ground creeping between grasses and bushes, often on rocky habitats where they feed on small lizards, insects, and sometimes berries and seeds. They are very silent and the sexes are identical in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Sirkeer_malkoha"
  },
  {
    "id": 133,
    "category": 27,
    "name": "Green-billed Coucal",
    "sinhala": "බට ඇටිකුකුළා",
    "scientific": "Centropus Chlororhynchus",
    "image": "green_billed_coucal.jpg",
    "desc": "The green-billed coucal is a member of the cuckoos. It is endemic to Sri Lanka's wet zone and listed as Vulnerable on the IUCN Red List, as the small population declined due to forest destruction and fragmentation. It inhabits the tall rainforests of southwest Sri Lanka and nests in bushes. Its typical clutch is 2–3 eggs.",
    "migrant": 0,
    "endemic": 1,
    "code": "SHE",
    "wikipedia": "https://en.wikipedia.org/wiki/Green-billed_coucal"
  },
  {
    "id": 134,
    "category": 27,
    "name": "Greater Coucal",
    "sinhala": "ඇටිකුකුළා",
    "scientific": "Centropus Sinensis Parroti",
    "image": "greater_coucal.jpg",
    "desc": "The greater coucal or crow pheasant, is a large non-parasitic member of the cuckoo order of birds, the Cuculiformes. A widespread resident in the Indian Subcontinent and Southeast Asia, it is divided into several subspecies, some being treated as full species. They are large, crow-like with a long tail and coppery brown wings and found in wide range of habitats from jungle to cultivation and urban gardens. They are weak fliers, and are often seen clambering about in vegetation or walking on the ground as they forage for insects, eggs and nestlings of other birds. They have a familiar deep resonant call which is associated with omens in many parts of its range.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_coucal"
  },
  {
    "id": 136,
    "category": 28,
    "name": "Collared Scops Owl",
    "sinhala": "කරපටි බස්සා",
    "scientific": "Otus Bakkamoena Bakkamoena",
    "image": "collared_scops_owl.jpg",
    "desc": "The collared scops owl is an owl which is a resident breeder in south Asia from northern Pakistan, northern India, Bangladesh[2] and the Himalayas east to south China. It is partially migratory, with some birds wintering in India, Sri Lanka and Malaysia. This species was formerly considered to be included within what is now separated as the Indian scops owl (Otus bakkamoena).",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Collared_scops_owl"
  },
  {
    "id": 137,
    "category": 28,
    "name": "Oriental Scops Owl",
    "sinhala": "පෙරදිගුකන් බස්සා",
    "scientific": "Otus Sunia Leggei",
    "image": "oriental_scops_owl.jpg",
    "desc": "The oriental scops owl is a species of scops owl found in eastern and southern Asia. This is a small, variable plumaged, yellow eyed owl with ear-tufts which are not always erect. It can be distinguish from the collared scops owl by its whitish scapular stripe, well marked underparts, and lack of pale collar. There are two colour morphs, grey and rufous; intermediate forms also occur. Sexes are alike. Individuals may freeze with eyes half closed when disturbed. The species has a repeated liquid call sounding like 'tuk tok torok'.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Collared_scops_owl"
  },
  {
    "id": 138,
    "category": 28,
    "name": "Spot-bellied Eagle Owl",
    "sinhala": "උකුසු බකමූණා (උලමා)",
    "scientific": "Bubo Nipalensis Blighi",
    "image": "spot_bellied_eagle_owl.jpg",
    "desc": "The spot-bellied eagle-owl, also known as the forest eagle-owl is a large bird of prey with a formidable appearance. It is a forest-inhabiting species found in the Indian Subcontinent and Southeast Asia. This species is considered part of a superspecies with the barred eagle-owl (Bubo sumatranus), which looks quite similar but is allopatric in distribution, replacing the larger spot-bellied species in the southern end of the Malay Peninsula and the larger island in Southeast Asia extending down to Borneo.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Spot-bellied_eagle-owl"
  },
  {
    "id": 139,
    "category": 28,
    "name": "Brown Fish Owl",
    "sinhala": "බොර කෙවුල් බකමූණා",
    "scientific": "Ketupa Zeylonensis Zeylonensis",
    "image": "brown_fish_owl.jpg",
    "desc": "The brown fish owl is a species of owl that is part of the family known as typical owls, Strigidae, which contains most living owls. It inhabits the warm subtropical and humid tropical parts of continental Asia and some offshore islands. Of the four living species of fish owl, it is the most widely distributed, most common and best-studied. It occupies a range of over 7,000 km (4,300 mi) from eastern China to Palestine.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Brown_fish_owl"
  },
  {
    "id": 140,
    "category": 28,
    "name": "Jungle Owlet",
    "sinhala": "වන උපබස්සා",
    "scientific": "Glaucidium Radiatum Radiatum",
    "image": "jungle_owlet.jpg",
    "desc": "The jungle owlet, or barred jungle owlet, is found in the Indian Subcontinent. The species is often found singly, in pairs or small groups and are usually detected by their calls at dawn and dusk. There are two subspecies with the form found in the Western Ghats sometimes considered a full species.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Jungle_owlet"
  },
  {
    "id": 141,
    "category": 28,
    "name": "Chestnut-backed Owlet",
    "sinhala": "පිටතඹල උපබස්සා",
    "scientific": "Glaucidium Castanonotum",
    "image": "chestnut_backed_owlet.jpg",
    "desc": "The chestnut-backed owlet (often misspelled Glaucidium castanonotum),[1] is an owl which is endemic to Sri Lanka. This species is a part of the larger grouping of owls known as typical owls, Strigidae, which contains most of the smaller owl species. This species was formerly considered to be a subspecies of the jungle owlet.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Chestnut-backed_owlet"
  },
  {
    "id": 142,
    "category": 28,
    "name": "Serendib Scops Owl",
    "sinhala": "පඬුවන් බස්සා",
    "scientific": "Otus Thilohoffmanni",
    "image": "serendib_scops_owl.jpg",
    "desc": "The Serendib scops owl is the most recently discovered bird of Sri Lanka. It was originally located by its unfamiliar poo-ooo call in the Kitulgala rainforest by prominent Sri Lankan ornithologist Deepal Warakagoda. Six years later, it was finally seen by him on 23 January 2001 in Sinharaja, and formally described as a species new to science in 2004. Apart from Sinharaja and Kitulgala, it has also been found at Runakanda Reserve in Morapitiya and Eratna Gilimale.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Serendib_scops_owl"
  },
  {
    "id": 143,
    "category": 29,
    "name": "Ceylon Frogmouth",
    "sinhala": "ශ්‍රී ලංකා මැඩිමුහුණා",
    "scientific": "Batrachostomus Moniliger",
    "image": "ceylon_frogmouth.jpg",
    "desc": "The Sri Lanka frogmouth, Sri Lankan frogmouth or Ceylon frogmouth is a small frogmouth found in the Western Ghats of south India and Sri Lanka. Related to the nightjars, it is nocturnal and is found in forest habitats. The plumage coloration resembles that of dried leaves and the bird roosts quietly on branches, making it difficult to see. Each has a favourite roost that it uses regularly unless disturbed. It has a distinctive call that is usually heard at dawn and dusk. The sexes differ slightly in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_frogmouth"
  },
  {
    "id": 144,
    "category": 30,
    "name": "Indian Nightjar",
    "sinhala": "ඉන්දු බිම්බස්සා",
    "scientific": "Caprimulgus Asiaticus Eidos",
    "image": "indian_nightjar.jpg",
    "desc": "The Indian nightjar is a small nightjar which is a resident breeder in open lands across South Asia and Southeast Asia. Like most nightjars it is crepuscular and is best detected from its characteristic calls at dawn and dusk that have been likened to a stone skipping on a frozen lake - a series of clicks that become shorter and more rapid. They are sometimes spotted on roads when their eyes gleam red in the spotlight of a vehicle. There is considerable plumage variation across its range and can be hard to differentiate from other nightjars in the region especially in the field.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_nightjar"
  },
  {
    "id": 145,
    "category": 31,
    "name": "Crested Treeswift",
    "sinhala": "සිළු රුක් තුරිතයා",
    "scientific": "Hemiprocne Coronata",
    "image": "crested_treeswift.jpg",
    "desc": "The crested treeswift is a kind of tree swift. The tree swifts are aerial near passerine birds, closely related to, but distinct from the true swifts by their sexual dimorphism, a frontal crest, and toes that allow perching on branches. They are restricted to southeast Asia and Australasia. It was for sometime considered conspecific with its eastern relative, the grey-rumped treeswift (Hemiprocne longipennis), but they do not interbreed where their ranges overlap. They are distinct in flight with long bowed wings and a deeply forked tail that usually appears narrow and pointed.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Crested_treeswift"
  },
  {
    "id": 146,
    "category": 32,
    "name": "Indian Swiftlet",
    "sinhala": "ඉන්දියානු කැදැල් තුරිතයා",
    "scientific": "Collocalia Unicolor",
    "image": "indian_swiftlet.jpg",
    "desc": "The Indian swiftlet, or Indian edible-nest swiftlet, is a small swift. It is a common resident colonial breeder in the hills of Sri Lanka and south west India. The half-cup nest is built on a vertical surface, often in a cave. The male swift uses thick saliva to construct the white, shiny nest into which two eggs are laid. The relatively tasteless nests are harvested, and mixed with chicken, spices, and other flavours as bird's nest soup, a supposed aphrodisiac.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_swiftlet"
  },
  {
    "id": 147,
    "category": 32,
    "name": "Asian Palm Swift",
    "sinhala": "තල් තුරිතයා",
    "scientific": "Cypsiurus Balasiensis Balasiensis",
    "image": "asian_palm_swift.jpg",
    "desc": "The Asian palm swift is a small swift. It is very similar to the African palm swift, Cypsiurus parvus, and was formerly considered to be the same species. It is a common resident breeder in tropical Asia from India to the Philippines. The down and feather nest is glued to the underside of a palm leaf with saliva, which is also used to secure the usually two or three eggs. This is a bird of open country and cultivation, which is strongly associated with oil palms.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Asian_palm_swift"
  },
  {
    "id": 148,
    "category": 33,
    "name": "Malabar Trogon",
    "sinhala": "ලෝහවන්නිච්චා",
    "scientific": "Harpactes Fasciatus Fasciatus",
    "image": "malabar_trogon.jpg",
    "desc": "The Malabar Trogon is a species of bird in the trogon family. It is found in the forests of Sri Lanka and peninsular India. In India it is mainly found in the Western Ghats, hill forests of central India and in parts of the Eastern Ghats. They are insectivorous and although not migratory, may move seasonally in response to rain in hill forest regions. Like in other trogons, males and females vary in plumage. The birds utter low guttural calls that can be heard only at close quarters and the birds perch still on a branch under the forest canopy, often facing away from the viewer making them easy to miss despite their colourful plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Malabar_trogon"
  },
  {
    "id": 149,
    "category": 34,
    "name": "Stork-Billed Kingfisher",
    "sinhala": "මානාතුඩු මහා පිළිහුඩුවා",
    "scientific": "Halcyon Capensis Capensis",
    "image": "stork_billed_kingfisher.jpg",
    "desc": "The stork-billed kingfisher, is a tree kingfisher which is widely but sparsely distributed in the tropical Indian subcontinent and Southeast Asia, from India to Indonesia. This kingfisher is resident throughout its range. t is a very large kingfisher, measuring 35 cm (14 in) in length. The adult has a green back, blue wings and tail, and olive-brown head. Its underparts and neck are buff. The very large bill and legs are bright red. The flight of the stork-billed kingfisher is laboured and flapping, but direct. Sexes are similar.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Stork-billed_kingfisher"
  },
  {
    "id": 150,
    "category": 34,
    "name": "White-Throated Kingfisher",
    "sinhala": "ළයසුදු මැදි-පිළිහුඩුවා",
    "scientific": "Halcyon Smyrnensis Fusca",
    "image": "white_throated_kingfisher.jpg",
    "desc": "The white-throated kingfisher also known as the white-breasted kingfisher is a tree kingfisher, widely distributed in Asia from Turkey east through the Indian subcontinent to the Philippines. This kingfisher is a resident over much of its range, although some populations may make short distance movements. It can often be found well away from water where it feeds on a wide range of prey that includes small reptiles, amphibians, crabs, small rodents and even birds. During the breeding season they call loudly in the mornings from prominent perches including the tops of buildings in urban areas or on wires.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/White-throated_kingfisher"
  },
  {
    "id": 151,
    "category": 34,
    "name": "Black-Capped Kingfisher",
    "sinhala": "කඝු ඉසැසි මැදි-පිළිහුඩුවා",
    "scientific": "Halcyon Pileata",
    "image": "black_capped_kingfisher.jpg",
    "desc": "The black-capped kingfisher is a tree kingfisher which is widely distributed in tropical Asia from India east to China, Korea and Southeast Asia. This most northerly of the Halcyonidae is resident over much of its range, but northern populations are migratory and they wintering south of their range to Sri Lanka, Thailand, Borneo and Java. It is distinctive in having a black cap that contrasts with the whitish throat, purple blue wings and the coral red bill. The species is mainly found in coastal and mangrove habitats but can sometimes be found far inland.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-capped_kingfisher"
  },
  {
    "id": 152,
    "category": 34,
    "name": "Common Kingfisher",
    "sinhala": "මල් පිළිහුඩුවා",
    "scientific": "Alcedo Atthis Taprobana",
    "image": "common_kingfisher.jpg",
    "desc": "The common kingfisher also known as the Eurasian kingfisher, and river kingfisher, is a small kingfisher with seven subspecies recognized within its wide distribution across Eurasia and North Africa. It is resident in much of its range, but migrates from areas where rivers freeze in winter. This sparrow-sized bird has the typical short-tailed, large-headed kingfisher profile; it has blue upperparts, orange underparts and a long bill. It feeds mainly on fish, caught by diving, and has special visual adaptations to enable it to see prey under water. The glossy white eggs are laid in a nest at the end of a burrow in a riverbank.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_kingfisher"
  },
  {
    "id": 153,
    "category": 34,
    "name": "Pied Kingfisher",
    "sinhala": "ගෝමර පිළිහුඩුවා",
    "scientific": "Ceryle Rudis Leucomelanura",
    "image": "pied_kingfisher.jpg",
    "desc": "The pied kingfisher is a water kingfisher and is found widely distributed across Africa and Asia. Originally described by Linnaeus in 1758, it has five recognised subspecies. Its black and white plumage, crest and the habit of hovering over clear lakes and rivers before diving for fish make it distinctive. Males have a double band across the breast while females have a single gorget that is often broken in the middle. They are usually found in pairs or small family parties. When perched, they often bob their head and flick up their tail.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Pied_kingfisher"
  },
  {
    "id": 154,
    "category": 35,
    "name": "Green Bee-Eater",
    "sinhala": "පුංචි බිඟුහරයා",
    "scientific": "Merops Orientalis Orientalis",
    "image": "green_bee_eater.jpg",
    "desc": "The green bee-eater, also known as little green bee-eater, is a near passerine bird in the bee-eater family. It is resident but prone to seasonal movements and is found widely distributed across sub-Saharan Africa from Senegal and the Gambia to Ethiopia, the Nile valley, western Arabia and Asia through India to Vietnam. They are mainly insect eaters and they are found in grassland, thin scrub and forest often quite far from water. Several regional plumage variations are known and several subspecies have been named.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Green_bee-eater"
  },
  {
    "id": 155,
    "category": 35,
    "name": "Blue-Tailed Bee-Eater",
    "sinhala": "නිල්පෙඳ බිඟුහරයා",
    "scientific": "Merops Philippinus Philippinus",
    "image": "blue_tailed_bee_eater.jpg",
    "desc": "The blue-tailed bee-eater is a near passerine bird in the bee-eater family Meropidae. It breeds in southeastern Asia. It is strongly migratory, seen seasonally in much of peninsular India. This species is sometimes considered to be conspecific with the blue-cheeked bee-eater. This species, like other bee-eaters, is a richly coloured, slender bird. It is predominantly green; its face has a narrow blue patch with a black eye stripe, and a yellow and brown throat; the tail is blue and the beak is black. It can reach a length of 23–26 cm, including the two elongated central tail feathers. Sexes are alike.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Blue-tailed_bee-eater"
  },
  {
    "id": 156,
    "category": 35,
    "name": "European Bee-Eater",
    "sinhala": "යුරෝපා බිඟුහරයා",
    "scientific": "Merops Apiaster",
    "image": "european_bee_eater.jpg",
    "desc": "The European bee-eater is a near passerine bird in the bee-eater family, Meropidae. It breeds in southern Europe and in parts of north Africa and western Asia. It is strongly migratory, wintering in tropical Africa. This species occurs as a spring overshoot north of its range, with occasional breeding in northwest Europe. This species, like other bee-eaters, is a richly coloured, slender bird. It has brown and yellow upper parts, whilst the wings are green and the beak is black. It can reach a length of 27–29 cm (10.6–11.4 in), including the two elongated central tail feathers. Sexes are alike.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/European_bee-eater"
  },
  {
    "id": 157,
    "category": 35,
    "name": "Chestnut-Headed Bee-Eater",
    "sinhala": "තඹලහිස් බිඟුහරයා",
    "scientific": "Merops Leschenaulti Leschenaulti",
    "image": "chestnut_headed_bee_eater.jpg",
    "desc": "The chestnut-headed bee-eater, or bay-headed bee-eater, is a near passerine bird in the bee-eater family Meropidae. It is a resident breeder in the Indian subcontinent and adjoining regions, ranging from India east to Southeast Asia. This species, like other bee-eaters, is a richly coloured, slender bird. It is predominantly green, with blue on the rump and lower belly. Its face and throat are yellow with a black eye stripe, and the crown and nape are rich chestnut. The thin curved bill is black. Sexes are alike, but young birds are duller.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Chestnut-headed_bee-eater"
  },
  {
    "id": 158,
    "category": 36,
    "name": "Indian Roller",
    "sinhala": "දුම්බොන්නා",
    "scientific": "Coracias Benghalensis Indica",
    "image": "indian_roller.jpg",
    "desc": "The Indian roller is a member of the roller bird family. It occurs widely from West Asia to the Indian Subcontinent and Sri Lanka. It is best known for its aerobatic displays of males during the breeding season. It is often seen perched along roadside trees and wires and are commonly seen in open grassland and scrub forest habitats. It is not migratory, but undertakes some seasonal movements. The largest population occurs in India, and several states in India have chosen it as their state bird.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_roller"
  },
  {
    "id": 159,
    "category": 37,
    "name": "Common Hoopoe",
    "sinhala": "පොදු පොරෝළුවා",
    "scientific": "Upupa Epops Ceylonensis",
    "image": "common_hoopoe.jpg",
    "desc": "Hoopoes are colourful birds found across Afro-Eurasia, notable for their distinctive 'crown' of feathers. Three living and one extinct species are recognized, though for many years all were lumped as a single species—Upupa epops.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Hoopoe"
  },
  {
    "id": 160,
    "category": 38,
    "name": "Ceylon Grey Hornbill",
    "sinhala": "ශ්‍රී ලංකා අළු කෑදැත්තා",
    "scientific": "Ocyceros Gingalensis",
    "image": "ceylon_grey_hornbill.jpg",
    "desc": "The Sri Lanka grey hornbill is a bird in the hornbill family and a widespread and common endemic resident breeder in Sri Lanka. Hornbills are a family of tropical near-passerine birds found in the Old World. The Sri Lanka grey hornbill is a large bird at 45 centimetres (18 in) in length. It has grey wings with black primary flight feathers, a grey back, and a brown crown. Its long tail is blackish with white sides, and the underparts are white. The long, curved bill has no casque. Sexes are similar, although the male has a cream-coloured bill, whereas the female's is black with a cream stripe.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_grey_hornbill"
  },
  {
    "id": 161,
    "category": 38,
    "name": "Malabar Pied Hornbill",
    "sinhala": "පෝරු කෑදැත්තා",
    "scientific": "Anthracoceros Coronatus",
    "image": "malabar_pied_hornbill.jpg",
    "desc": "The Malabar pied hornbill, also known as lesser pied hornbill, is a bird in the hornbill family, a family of tropical near-passerine birds found in the Old World. The Malabar pied hornbill is a large hornbill, at 65 cm (26 in) in length. It has mainly black plumage, apart from its white belly, throat patch, tail sides and trailing edge to the wings. The bill is yellow with a large, mainly black casque. Females have white orbital skin, which the males lack. Juveniles have no casque. It might be confused with the oriental pied hornbill.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Malabar_pied_hornbill"
  },
  {
    "id": 162,
    "category": 39,
    "name": "Brown-Headed Barbet",
    "sinhala": "පොලොස් කොට්ටෝරුවා",
    "scientific": "Megalaima Zeylanica Zeylanica",
    "image": "brown_headed_barbet.jpg",
    "desc": "The brown-headed barbet or large green barbet is an Asian barbet. Barbets are a group of near passerine birds with a worldwide tropical distribution. The barbets get their name from the bristles which fringe their heavy bills. The brown-headed barbet is a resident breeder in the Indian subcontinent, widespread in India and also seen in Bangladesh and Sri Lanka. This is a relatively large barbet at 27 cm. It is a plump bird, with a short neck, large head and short tail. The adult has a streaked brown head, neck and breast, with a yellow eye patch. The rest of the plumage is green. The bill is thick and red. Sexes are similar.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Brown-headed_barbet"
  },
  {
    "id": 163,
    "category": 39,
    "name": "Yellow-Fronted Barbet",
    "sinhala": "රන් නළල් කොට්ටෝරුවා",
    "scientific": "Megalaima Flavifrons",
    "image": "yellow_fronted_barbet.jpg",
    "desc": "The yellow-fronted barbet is an Asian barbet which is an endemic resident breeder in Sri Lanka. Barbets and toucans are a group of near passerine birds with a worldwide tropical distribution. The barbets get their name from the bristles which fringe their heavy bills. This is a medium-sized barbet at 21 cm. It is a plump bird, with a short neck, large head and short tail. The adult yellow-fronted barbet has a mainly green body and wing plumage, with a scaly appearance to the breast. It has a blue face and throat, and a yellow crown and moustachial stripes.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow-fronted_barbet"
  },
  {
    "id": 164,
    "category": 39,
    "name": "Ceylon Small Barbet",
    "sinhala": "ඔළුව රතු කොට්ටෝරුවා",
    "scientific": "Megalaima Rubricapilla",
    "image": "ceylon_small_barbet.jpg",
    "desc": "The crimson-fronted barbet or Ceylon small barbet or small barbet is an Asian barbet endemic to Sri Lanka. The Malabar barbet endemic to the Western Ghats of India used to be treated as a subspecies of this species. This is a small barbet at 15 cm. It is a plump bird with a short neck, large head and short tail. The adult crimson-fronted barbet has a mainly green body and wing plumage, a blue band down the side of the head and neck, and a black crescent behind the eye.",
    "migrant": 0,
    "endemic": 1,
    "code": "CE",
    "wikipedia": "https://en.wikipedia.org/wiki/Crimson-fronted_barbet"
  },
  {
    "id": 165,
    "category": 39,
    "name": "Coppersmith Barbet",
    "sinhala": "රත් ළය කොට්ටෝරුවා",
    "scientific": "Megalaima Haemacephala Indica",
    "image": "coppersmith_barbet.jpg",
    "desc": "The coppersmith barbet, crimson-breasted barbet or coppersmith (Psilopogon haemacephalus), is a bird with crimson forehead and throat which is best known for its metronomic call that has been likened to a coppersmith striking metal with a hammer.   It is 15-17 cm (5.9-6.7 inches) long, making it a smallish barbet. The red forehead, yellow eye-ring and throat patch with streaked underside and green upperparts, it is fairly distinctive. Juveniles are duller and lack the red patches. The sexes are alike. The Sri Lankan form has more black on the face, more red on the breast and darker streaks on the underside.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Coppersmith_barbet"
  },
  {
    "id": 166,
    "category": 40,
    "name": "Yellow-Crowned Woodpecker",
    "sinhala": "කහසිළු ගෝමර කෑරලා",
    "scientific": "Dendrocopus Mahrattensis",
    "image": "yellow_crowned_woodpecker.jpg",
    "desc": "The yellow-crowned woodpecker or Mahratta woodpecker is a species of small pied woodpecker found in the Indian subcontinent. A medium-small (17.5 cm, 6.9 inches, 28-46 grams, 1-1.6 ounces), pale-headed, pied woodpecker. Upper-parts black, heavily spotted and barred white. Underparts dark, streaked dingy white with red belly patch. Irregular brown cheek and neck patches. Female has yellowish crown and nape. In male nape scarlet and fore-crown yellow.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow-crowned_woodpecker"
  },
  {
    "id": 167,
    "category": 40,
    "name": "Lesser Yellownape",
    "sinhala": "හීන්කහ ගෙලැසි කෑරලා",
    "scientific": "Picus Chlorolophus Wellsi",
    "image": "lesser_yellownape.jpg",
    "desc": "The lesser yellownape is a type of woodpecker which is a widespread and often common breeder in tropical and sub-tropical Asia, primarily the Indian subcontinent and Southeast Asia. The lesser yellownape is a largish species at 27 cm in length. It has a typical woodpecker shape. The upperparts are green apart from the bright yellow tufted nape. The neck and breast are green and the belly is whitish, finely barred with green. The rump and tail are blackish. The adult male lesser yellownape has a green head with a white throat. He has red markings above the eye and above the nape, and red moustachial stripes. Females have only a red patch above the ear coverts. Young birds are like the female, but duller. The subspecies occurring in peninsular India has a greyer head.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_yellownape"
  },
  {
    "id": 168,
    "category": 40,
    "name": "Black-Rumped Flameback",
    "sinhala": "පිට රන් රත් කෑරලා",
    "scientific": "Dinopium Benghalense Jaffnense",
    "image": "black_rumped_flameback.jpg",
    "desc": "The black-rumped flameback, also known as the lesser golden-backed woodpecker or lesser goldenback, is a woodpecker found widely distributed in the Indian subcontinent. The black-rumped flameback is a large species at 26–29 cm in length. It has a typical woodpecker shape, and the golden yellow wing coverts are distinctive. The rump is black and not red as in the greater flameback. The underparts are white with dark chevron markings. The adult male has a red crown and crest. Females have a black forecrown spotted with white, with red only on the rear crest. Young birds are like the female, but duller.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-rumped_flameback"
  },
  {
    "id": 169,
    "category": 40,
    "name": "Crimson-Backed Flameback",
    "sinhala": "ලේපිට මහ කෑරලා",
    "scientific": "Chrysocolaptes Stricklandi",
    "image": "crimson_backed_flameback.jpg",
    "desc": "The crimson-backed flameback or greater Sri Lanka flameback is a species of bird in the family Picidae. It is found on Sri Lanka. It is sometimes considered a subspecies of the greater flameback. Although practically the same size as the Black-rumped Flameback, this handsome Woodpecker looks slightly bigger and can be easily distinguished from that species by its crimson back and wings, longer and ivory colour beak, and the different call note.  This is a forest loving species, widely distributed almost throughout the forested parts of the island but prefers the wet zone and the mountains, which it ascends to the highest elevations.  The female has the crown black with round white spots.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Crimson-backed_flameback"
  },
  {
    "id": 170,
    "category": 41,
    "name": "Indian Pitta",
    "sinhala": "අවිච්චියා",
    "scientific": "Pitta Brachyura Brachyura",
    "image": "indian_pitta.jpg",
    "desc": "The Indian pitta is a passerine bird native to the Indian subcontinent. It inhabits scrub jungle, deciduous and dense evergreen forest. It breeds in the forests of the Himalayas, hills of central and western India, and migrates to other parts of the peninsula in winter.  The Indian pitta is a small stubby-tailed bird that is mostly seen on the floor of forests or under dense undergrowth, foraging on insects in leaf litter. It has long, strong legs, a very short tail and stout bill, with a buff coloured crown stripe, black coronal stripes, a thick black eye stripe and white throat and neck. The upperparts are green, with a blue tail, the underparts buff, with bright red on the lower belly and vent. The bird hops on the ground to forage and has been known to get trapped in ground traps meant for small mammals. It has been suggested that the width of the coronal stripe may differ in the sexes.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_pitta"
  },
  {
    "id": 171,
    "category": 42,
    "name": "Jerdon’s Bushlark",
    "sinhala": "රත් පිය අකුල් තුලිකාවා",
    "scientific": "Mirafra Affinis Ceylonensis",
    "image": "jerdon_s_bushlark.jpg",
    "desc": "Jerdon's bush lark or Jerdon's lark is a species of lark in the family Alaudidae found in south Asia. Jerdon's bush lark has arrowhead-like spots pointing upwards on the breast. It is very similar to the Indian bush lark but has buffy lores, less white behind ear coverts, darker center to wing coverts and central tail feathers. Dark centers of primary coverts are prominent, and wing panels are duller and rufous. In the southern Western Ghats, the race ceylonensis is darker and more rufous on the underside and has a longer bill. Jerdon's bush lark has paler, greyish-brown underparts.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Jerdon%27s_bush_lark"
  },
  {
    "id": 172,
    "category": 42,
    "name": "Ashy-Crowned Sparrow Lark",
    "sinhala": "කිරුළළු ගේකුරුළු තුලිකාවා",
    "scientific": "Eremopterix Grisea",
    "image": "ashy_crowned_sparrow_lark.jpg",
    "desc": "The ashy-crowned sparrow-lark is a small sparrow-sized member of the lark family. It is found in the plains in open land with bare ground, grass and scrub across South Asia. Sparrow sized with a finch-like bill and short legs, these birds are usually seen sitting on the ground, and although they will sometimes perch on wires they do not perch in trees or bushes. The male is sandy brown overall with a black belly, chin, lower lores and eye stripe. The top of the head is ashy (although the base of these crown feathers are dark) unlike the dark brown to black in the black-crowned sparrow-lark which partly overlaps with the range of this species in the arid zone of India and Pakistan. The female is pale brown and very similar to a female house sparrow, although the legs are much shorter and appearing stockier and shorter-necked.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Ashy-crowned_sparrow-lark"
  },
  {
    "id": 173,
    "category": 42,
    "name": "Oriental Skylark",
    "sinhala": "පෙරදිගු අහස් තුලිකාවා",
    "scientific": "Alauda Gulgula Gulgula",
    "image": "oriental_skylark.jpg",
    "desc": "The Oriental skylark, also known as the small skylark, is a species of skylark found in southern, central and eastern Asia. Like other skylarks, it is found in open grassland where it feeds on seeds and insects.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Oriental_skylark"
  },
  {
    "id": 174,
    "category": 43,
    "name": "Barn Swallow",
    "sinhala": "අටු වැහිළිහිණියා",
    "scientific": "Hirundo Rustica Gutturalis",
    "image": "barn_swallow.jpg",
    "desc": "The barn swallow is the most widespread species of swallow in the world. It is a distinctive passerine bird with blue upperparts and a long, deeply forked tail. It is found in Europe, Asia, Africa and the Americas. The adult male barn swallow of the nominate subspecies H. r. rustica is 17–19 cm (6.7–7.5 in) long including 2–7 cm (0.79–2.76 in) of elongated outer tail feathers. It has a wingspan of 32–34.5 cm (12.6–13.6 in) and weighs 16–22 g (0.56–0.78 oz). It has steel blue upperparts and a rufous forehead, chin and throat, which are separated from the off-white underparts by a broad dark blue breast band. The outer tail feathers are elongated, giving the distinctive deeply forked 'swallow tail'. There is a line of white spots across the outer end of the upper tail. The female is similar in appearance to the male, but the tail streamers are shorter, the blue of the upperparts and breast band is less glossy, and the underparts paler. The juvenile is browner and has a paler rufous face and whiter underparts. It also lacks the long tail streamers of the adult.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Barn_swallow"
  },
  {
    "id": 175,
    "category": 43,
    "name": "Hill Swallow",
    "sinhala": "කඳුකර වැහිළිහිණියා",
    "scientific": "Hirundo Domicola",
    "image": "hill_swallow.jpg",
    "desc": "The hill swallow  is a small passerine bird in the swallow family. It breeds in southern India and Sri Lanka. It is resident apart from some local seasonal movements. This bird is associated with coasts, but is increasingly spreading to forested uplands.This species is a small swallow at 13 cm. It has a blue back with browner wings and tail, a red face and throat, and dusky underparts. It differs from barn swallow and the closely related welcome swallow in its shorter and less forked tail.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Hill_swallow"
  },
  {
    "id": 176,
    "category": 43,
    "name": "Ceylon Swallow",
    "sinhala": "ශ්‍රී ලංකා වැහිළිහිණියා",
    "scientific": "Hirundo Hyperythra",
    "image": "ceylon_swallow.jpg",
    "desc": "The Sri Lanka swallow is a large swallow. It is a resident breeder endemic to Sri Lanka. It is closely related to the red-rumped swallow, and was formerly considered a subspecies. This  bird has been recently recognized as a distinct  species and added to the Sri Lankan endemic list. Sparrow sized and stockier  than our other swallows, it is unmistakable with purple-blue glossed upperparts  and rusty underparts and rump. Both sexes are alike. Young are duller.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_swallow"
  },
  {
    "id": 177,
    "category": 44,
    "name": "Richard's Pipit",
    "sinhala": "රිචඩ් වැරටිච්චා",
    "scientific": "Anthus Richardi Richardi",
    "image": "richard_s_pipit.jpg",
    "desc": "Richard's pipit is a medium-sized passerine bird which breeds in open grasslands in northern Asia. It is a long-distance migrant moving to open lowlands in the Indian subcontinent and Southeast Asia. It is a rare but regular vagrant to western Europe. This is a large pipit, 17–20 cm in length, with a weight of 25–36 g and a wingspan of 29 to 33 cm. It is a slender bird which often stands very upright. It has long yellow-brown legs, a long tail with white outer-feathers and a long dark bill with a yellowish base to the lower mandible. The hindclaw is long and fairly straight. It is an undistinguished-looking species on the ground, mainly brown above and pale below. There are dark streaks on the upperparts and breast while the belly and flanks are plain. The face is strongly marked with pale lores and supercilium and dark eyestripe, moustachial stripe and malar stripe. There are two wingbars formed by pale tips to the wing-coverts.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Richard%27s_pipit"
  },
  {
    "id": 178,
    "category": 44,
    "name": "Paddyfield Pipit",
    "sinhala": "ඉන්දියානු වැරටිච්චා",
    "scientific": "Anthus Rufulus Malayensis",
    "image": "paddyfield_pipit.jpg",
    "desc": "The paddyfield pipit or Oriental pipit is a small passerine bird in the pipit and wagtail family. It is a resident (non-migratory) breeder in open scrub, grassland and cultivation in southern Asia east to the Philippines. This is a large pipit at 15 cm, but is otherwise an undistinguished looking bird, mainly streaked grey-brown above and pale below with breast streaking. It is long legged with a long tail and a long dark bill. Sexes are similar.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Paddyfield_pipit"
  },
  {
    "id": 179,
    "category": 44,
    "name": "Blyth's Pipit",
    "sinhala": "බ්ලයිත් වැරටිච්චා",
    "scientific": "Anthus Godlewskii",
    "image": "blyth_s_pipit.jpg",
    "desc": "The Blyth's pipit is a medium-sized passerine bird which breeds in Mongolia and neighbouring areas. It is a long distance migrant moving to open lowlands in Southern Asia. It is a very rare vagrant to western Europe. This is a large pipit, but is an undistinguished looking species on the ground, mainly brown above and pale below. It is very similar to Richard's pipit, but is slightly smaller, shorter legs and a shorter dark bill. Its flight is strong and direct, and it gives a characteristic 'pshee' call, higher pitched than Richard's.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Blyth%27s_pipit"
  },
  {
    "id": 180,
    "category": 44,
    "name": "Forest Wagtail",
    "sinhala": "කැලෑ හැලපෙන්දා",
    "scientific": "Dendronanthus Indicus",
    "image": "forest_wagtail.jpg",
    "desc": "The forest wagtail is a medium-sized passerine bird in the wagtail family Motacillidae. It has a distinctive plumage that sets it apart from other wagtails and has the habit of wagging its tail sideways unlike the usual up and down movements of the other wagtail species. It is the only wagtail species that nests in trees.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Forest_wagtail"
  },
  {
    "id": 181,
    "category": 44,
    "name": "Yellow Wagtail",
    "sinhala": "කහ හැලපෙන්දා",
    "scientific": "Motacilla Flava Thunbergi",
    "image": "yellow_wagtail.jpg",
    "desc": "The yellow wagtail is a small passerine in the wagtail family Motacillidae, which also includes the pipits and longclaws. It was often classified as a subspecies of the Western yellow wagtail. It is a slender 15–16 cm long bird, with the characteristic long, constantly wagging tail of its genus. The breeding adult male is basically olive above and yellow below. In other plumages, the yellow may be diluted by white. The heads of breeding males come in a variety of colours and patterns depending on subspecies.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Eastern_yellow_wagtail"
  },
  {
    "id": 182,
    "category": 44,
    "name": "Grey Wagtail",
    "sinhala": "අළු හැලපෙන්දා",
    "scientific": "Motacilla Cinerea Melanope",
    "image": "grey_wagtail.jpg",
    "desc": "The grey wagtail is a member of the wagtail family, Motacillidae, measuring around 18–19 cm overall length. The species looks somewhat similar to the yellow wagtail but has the yellow on its underside restricted to the throat and vent. This slim wagtail has a narrow white supercilium and a broken eye ring. The upperparts are grey and the yellow vent contrasting with whitish underparts makes it distinctive. The breeding male has a black throat that is edged by whitish moustachial stripes. They forage singly or in pairs on meadows or on shallow water marshes. They also use rocks in water and will often perch on trees. They have a clear sharp call note and the song consists of trills.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey_wagtail"
  },
  {
    "id": 183,
    "category": 45,
    "name": "Ceylon Wood-Shrike",
    "sinhala": "ශ්‍රී ලංකා වන සැරටිත්තා",
    "scientific": "Tephrodornis Affinis",
    "image": "ceylon_wood_shrike.jpg",
    "desc": "The Ceylon Woodshrike is a nondescript, sparrow sized bird  of mostly grey plumage. The male has a dark mask across the eye. A prominent  feature which stands out in this drab plumage is a white rump bordered below  with black upper tail coverts. The female is browner with a less prominent  mask. The Wood Shrike is a common bird in the low country dry zone and ascends  the hills to about 1200 metres especially on the dryer, eastern side. It is  scarce and local in the wet zone.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_woodshrike"
  },
  {
    "id": 184,
    "category": 45,
    "name": "Black-Headed Cuckooshrike",
    "sinhala": "කළු හිස් කොවුල් සැරටිත්තා",
    "scientific": "Coracina Melanoptera Sykesi",
    "image": "black_headed_cuckooshrike.jpg",
    "desc": "The Ceylon Woodshrike is a nondescript, sparrow sized bird  of mostly grey plumage. The male has a dark mask across the eye. A prominent  feature which stands out in this drab plumage is a white rump bordered below  with black upper tail coverts. The female is browner with a less prominent  mask. The Wood Shrike is a common bird in the low country dry zone and ascends  the hills to about 1200 metres especially on the dryer, eastern side. It is  scarce and local in the wet zone.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-headed_cuckooshrike"
  },
  {
    "id": 185,
    "category": 45,
    "name": "Scarlet Minivet",
    "sinhala": "දිලිරත් මිනිවිත්තා",
    "scientific": "Pericrocotus Flammeus Flammeus",
    "image": "scarlet_minivet.jpg",
    "desc": "The scarlet minivet is a small passerine bird. This minivet is found in tropical southern Asia from India to southern China, Indonesia, and the Philippines. They are common resident breeding birds in forests and other well-wooded habitats including gardens, especially in hilly country. While the male of most subspecies are scarlet to orange with black upper parts, the females are usually yellow with greyish olive upper parts.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Scarlet_minivet"
  },
  {
    "id": 186,
    "category": 45,
    "name": "Small Minivet",
    "sinhala": "පුංචි මිනිවිත්තා",
    "scientific": "Pericrocotus Cinnamomeus Cinnamomeus",
    "image": "small_minivet.jpg",
    "desc": "The small minivet is a small passerine bird. This minivet is found in tropical southern Asia from the Indian subcontinent east to Indonesia. The small minivet is 16 cm long with a strong dark beak and long wings. The male differs from most other common minivets by having grey, not glossy black, upperparts and head, and orange underparts, fading to yellow on the belly, orange tail edges, rump and wing patches. The female is grey above, with yellow underparts (including the face), tail edges, rump and wing patches.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Small_minivet"
  },
  {
    "id": 187,
    "category": 45,
    "name": "Bar-Winged Flycatcher-Shrike",
    "sinhala": "වයිරපිය මැසි සැරටිත්තා",
    "scientific": "Hemipus Picatus Leggei",
    "image": "bar_winged_flycatcher_shrike.jpg",
    "desc": "The bar-winged flycatcher-shrike is a small passerine bird usually placed in the Vangidae. It is found in the forests of tropical southern Asia from the Himalayas and hills of southern India to Indonesia.  The bar-winged flycatcher-shrike is black capped with black wings that contrast with the white of the body. A white slash across the wing and a white rump stand out in contrast. They sit upright on branches, flying around to glean insects. The nostril is hidden by hairs and the upper mandible of the beak has a curved tip. Males are velvety black while females tend to be greyish brown but the pattern varies across the geographic populations. Both males and females of the Himalayan H. p. capitalis have a brown back but the males have a black head. The Sri Lankan population leggei lacks sexual dimorphism in plumage. H. p. intermedius has only the females with a brownish back. The tail is black but the outer tail feathers are white while the non-central tail feathers are tipped with white.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Bar-winged_flycatcher-shrike"
  },
  {
    "id": 188,
    "category": 46,
    "name": "Black-Capped Bulbul",
    "sinhala": "කළු ඉසැසි කොණ්ඩයා",
    "scientific": "Pycnonotus Melanicterus",
    "image": "black_capped_bulbul.jpg",
    "desc": "The black-capped bulbul, or black-headed yellow bulbul, is a member of the bulbul family of passerine birds. It is endemic to Sri Lanka. The black-capped bulbul is virtually crestless and has a yellow throat and brownish eyes. It is yellowish green above and yellow below. The tail is brownish and ends in a white tip. The male has red irides and female has brown irides. Calls include a broad repertoire of sweet, mellow, minor-key piping whistles and sharper calls. Breeding records are from March to September.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-capped_bulbul"
  },
  {
    "id": 189,
    "category": 46,
    "name": "Red-Vented Bulbul",
    "sinhala": "කොණ්ඩයා",
    "scientific": "Pycnonotus Cafer Haemorrhousus",
    "image": "red_vented_bulbul.jpg",
    "desc": "The red-vented bulbul is a member of the bulbul family of passerines. It is resident breeder across the Indian subcontinent, including Sri Lanka extending east to Burma and parts of Tibet. The red-vented bulbul is easily identified by its short crest giving the head a squarish appearance. The body is dark brown with a scaly pattern while the head is darker or black. The rump is white while the vent is red. The black tail is tipped in white. The Himalayan races have a more prominent crest and are more streaked on the underside. Sexes are similar in plumage, but young birds are duller than adults.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Red-vented_bulbul"
  },
  {
    "id": 190,
    "category": 46,
    "name": "Yellow-Eared Bulbul",
    "sinhala": "කහ කන් කොණ්ඩයා",
    "scientific": "Pycnonotus Penicillatus",
    "image": "yellow_eared_bulbul.jpg",
    "desc": "The yellow-eared bulbul is a species of songbird in the bulbul family of passerine birds. It is an endemic resident breeder in the highlands of Sri Lanka. The common name is also used as an alternate name for the yellow-throated bulbul. The yellow-eared bulbul is about 20 cm (7.9 in) in length, with a long tail. It has olive upperparts and yellowish underparts. The crown of the head is grey, and there are yellow ear tufts and a yellow patch below the eye. There is a white tuft in front of the eye and the throat is also white. Sexes are similar in plumage, but young birds are duller than adults.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow-eared_bulbul"
  },
  {
    "id": 191,
    "category": 46,
    "name": "White-Browed Bulbul",
    "sinhala": "බැම සුදු කොණ්ඩයා",
    "scientific": "Pycnonotus Luteolus Insulae",
    "image": "white_browed_bulbul.jpg",
    "desc": "The white-browed bulbul is a member of the bulbul family of passerine birds. It is a resident breeder in Sri Lanka and peninsular India. Largely olive coloured above with whitish underparts, it has a pale supercilium and a yellow vent.  The white-browed bulbul is about 20 cm (7.9 in) long, with a moderately long (8 centimetres or 3 inches) tail. It has olive-grey upperparts and whitish underparts. This species is identifiable by the white supercilium, white crescent below the eye, and dark eyestripe and moustachial stripe. The vent is yellowish and there is some yellow on the chin and moustache. The throat is however largely whitish unlike in the similar looking and sounding yellow-throated bulbul which is found in rockier habitats. Three or four hair-like filoplumes are present on the nape. Sexes are similar in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/White-browed_bulbul"
  },
  {
    "id": 192,
    "category": 46,
    "name": "Yellow-browed Bulbul",
    "sinhala": "බැම කහ කොණ්ඩයා",
    "scientific": "Iole Indica Indica",
    "image": "yellow_browed_bulbul.jpg",
    "desc": "The yellow-browed bulbul, or golden-browed bulbul, is a species of songbird in the bulbul family, Pycnonotidae. It is found in the forests of southern India and Sri Lanka. The yellow-browed bulbul is mainly yellow on the underside and olive above with a distinct yellow brow.  This bulbul is about 20 cm (7.9 in) long, lacks a crest and has the upperparts olive green with a prominent yellow brow and goggle with the underparts being all yellow. The sexes do not differ in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow-browed_bulbul"
  },
  {
    "id": 193,
    "category": 46,
    "name": "Black Bulbul",
    "sinhala": "කළු කොණ්ඩයා",
    "scientific": "Hypsipetes Ganeesa",
    "image": "black_bulbul.jpg",
    "desc": "The black bulbul, also known as the Himalayan black bulbul or Asian black bulbul, is a member of the bulbul family of passerine birds. It is found in southern Asia from India east to southern China. The black bulbul is 24–25 cm in length, with a long tail. The body plumage ranges from slate grey to shimmering black, depending on the race. The beak, legs, and feet are all orange and the head has a black fluffy crest. Sexes are similar in plumage, but young birds lack the crest, have whitish underparts with a grey breast band, and have a brown tint to the upperparts. They have a black streak behind the eye and on the ear coverts.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black_bulbul"
  },
  {
    "id": 194,
    "category": 47,
    "name": "Jerdon’s Leafbird",
    "sinhala": "නිල්පිය කොළරිසියා",
    "scientific": "Chloropsis Jerdoni",
    "image": "jerdon_s_leafbird.jpg",
    "desc": "Jerdon's leafbird is a species of leafbird found in forest and woodland in India and Sri Lanka. Its name honours Thomas C. Jerdon. The male is green-bodied with a yellow-tinged head, black face and throat. It has a blue moustachial line. The female differs in that it has a greener head and blue throat, and young birds are like the female but without the blue throat patch.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Jerdon%27s_leafbird"
  },
  {
    "id": 195,
    "category": 47,
    "name": "Golden-Fronted Leafbird",
    "sinhala": "රන් නළල් කොළරිසියා",
    "scientific": "Chloropsis Aurifrons Insularis",
    "image": "golden_fronted_leafbird.jpg",
    "desc": "The golden-fronted leafbird is a species of leafbird. It is found from the Indian subcontinent and south-western China, to south-east Asia and Sumatra. The adult is green-bodied with a black face and throat bordered with yellow. Is has dark brown irises and blackish feet and bill. It has a yellowish orange forehead and blue moustachial line (but lacks the blue flight feathers and tail sides of blue-winged leafbird). Young birds have a plain green head and lack the black on their face and throat. The black of the face and throat appears slightly duller in females.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Golden-fronted_leafbird"
  },
  {
    "id": 196,
    "category": 47,
    "name": "Common Iora",
    "sinhala": "පොදු අයෝරාවා",
    "scientific": "Aegithina Tiphia Multicolor",
    "image": "common_iora.jpg",
    "desc": "The common iora is a small passerine bird found across the tropical Indian subcontinent with populations showing plumage variations, some of which are designated as subspecies. A species found in scrub and forest, it is easily detected from its loud whistles and the bright colours. Ioras have a pointed and notched beak with a culmen that is straight. The common iora is sexually dimorphic, males in the breeding season have a black cap and back adding to a black wing and tail at all seasons. Females have greenish wings and an olive tail. The undersides of both are yellow and the two white bars on the wings of the male are particularly prominent in their breeding plumage. The males in breeding plumage have a very variable distribution of the black on the upperparts and can be confused with Marshall's iora, however, the latter always has white tips to the tail.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_iora"
  },
  {
    "id": 197,
    "category": 48,
    "name": "Indian Blue Robin",
    "sinhala": "ඉන්දු නිල් සිටිකිච්චා",
    "scientific": "Luscinia Brunnea",
    "image": "indian_blue_robin.jpg",
    "desc": "The Indian blue robin is a small bird found in the Indian Subcontinent. Formerly considered a thrush, it is now considered one of the Old World flycatchers in the family Muscicapidae. It was earlier also called the Indian blue chat. It is migratory, breeding in the forests along the Himalayas of Nepal, India, Myanmar and Bangladesh. They winter in the hill forests of the Western Ghats of India and in Sri Lanka. The Indian blue robin is similar in size to the related bluethroat at 15 cm long. The adult male has blue upperparts and rufous underparts. A bright white supercilium contrasts with a black mask that continues down the neck. The lower belly and undertail are also whitish. The female is olive brown above and buff below with a light eye-ring and rufescent rump. The breast and flanks are buffy.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_blue_robin"
  },
  {
    "id": 198,
    "category": 48,
    "name": "Oriental Magpie Robin",
    "sinhala": "පොල්කිච්චා",
    "scientific": "Copsychus Saularis Ceylonensis",
    "image": "oriental_magpie_robin.jpg",
    "desc": "The oriental magpie-robin is a small passerine bird that was formerly classed as a member of the thrush family Turdidae, but now considered an Old World flycatcher. This species is 19 centimetres (7.5 in) long, including the long tail, which is usually held cocked upright. It is similar in shape to the smaller European robin, but is longer-tailed. The male has black upperparts, head and throat apart from a white shoulder patch. The underparts and the sides of the long tail are white. Females are greyish black above and greyish white.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Oriental_magpie-robin"
  },
  {
    "id": 199,
    "category": 48,
    "name": "White-Rumped Shama",
    "sinhala": "වන පොල්කිච්චා",
    "scientific": "Copsychus Malabaricus Leggei",
    "image": "white_rumped_shama.jpg",
    "desc": "The white-rumped shama is a small passerine bird of the family Muscicapidae. Native to densely vegetated habitats in the Indian subcontinent and Southeast Asia, its popularity as a cage-bird and songster has led to it being introduced elsewhere. They typically weigh between 28 and 34 g (1.0 and 1.2 oz) and are around 23–28 cm (9–11 in) in length. Males are glossy black with a chestnut belly and white feathers on the rump and outer tail. Females are more greyish-brown, and are typically shorter than males. Both sexes have a black bill and pink feet.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/White-rumped_shama"
  },
  {
    "id": 200,
    "category": 48,
    "name": "Pied Bushchat",
    "sinhala": "ගෝමර සිටිබිච්චා",
    "scientific": "Saxicola Caprata Atrata",
    "image": "pied_bushchat.jpg",
    "desc": "The pied bush chat is a small passerine bird found ranging from West Asia and Central Asia to the Indian subcontinent and Southeast Asia.  At 13 cm, the pied bush chat is slightly smaller than the Siberian stonechat, Saxicola maurus, although it has a similar dumpy structure and upright stance. The male is black except for a white rump, wing patch and lower belly. The iris is dark brown, the bill and legs black. The female is drab brown and slightly streaked.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Pied_bush_chat"
  },
  {
    "id": 201,
    "category": 48,
    "name": "Indian Robin",
    "sinhala": "ඉන්දු කළුකිච්චා",
    "scientific": "Saxicoloides Fulicata Leucoptera",
    "image": "indian_robin.jpg",
    "desc": "The Indian robin is a species of bird in the family Muscicapidae. It is widespread in the Indian subcontinent, and ranges across Bangladesh, Bhutan, India, Nepal, Pakistan, and Sri Lanka.  The males have chestnut undertail coverts and these are visible as the bird usually holds the 6–8 cm long tail raised upright. The females are brownish above, have no white shoulder stripe and are greyish below with the vent a paler shade of chestnut than the males. Birds of the northern populations are larger than those from southern India or Sri Lanka.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_robin"
  },
  {
    "id": 202,
    "category": 48,
    "name": "Blue Rock Thrush",
    "sinhala": "නිල් ගල තිරාසිකයා",
    "scientific": "Monticola Solitarius Pandoo",
    "image": "blue_rock_thrush.jpg",
    "desc": "The blue rock thrush is a species of chat. This thrush-like Old World flycatcher was formerly placed in the family Turdidae. It breeds in southern Europe, northwest Africa, and from central Asia to northern China and Malaysia.  The blue rock thrush is a starling-sized bird, 21–23 cm (8.3–9.1 in) in length with a long slim bill. The breeding male of the nominate subspecies is unmistakable, with all blue-grey plumage apart from its darker wings. Females and immatures are much less striking, with dark brown upperparts, and paler brown scaly underparts. The male of the subspecies M. s. philippensis has rufous-chestnut plumage from the mid-breast down to the undertail. Both sexes lack the reddish outer tail feathers of rock thrush.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Blue_rock_thrush"
  },
  {
    "id": 203,
    "category": 48,
    "name": "Pied Thrush",
    "sinhala": "ගෝමර තිරාසිකයා",
    "scientific": "Zoothera Wardii",
    "image": "pied_thrush.jpg",
    "desc": "The pied thrush is a member of the thrush family found in India and Sri Lanka. The males are conspicuously patterned in black and white while the females are olive brown and speckled. They breed in the central Himalayan forests and winter in the hill forests of southern India and Sri Lanka. Males of this 22 cm (8.7 in) thrush are conspicuously black and white. Mostly black on the upper parts it has a long white supercilium, and white tips to the wing coverts, tertials, rump and tail. The underparts are white with black flank spots the bill and legs are yellow. Females and young birds have the same basic pattern, but the black is replaced by dark brown, and the white by light brown. The markings on the underside are scalier.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Blue_rock_thrush"
  },
  {
    "id": 204,
    "category": 48,
    "name": "Orange-Headed Thrush",
    "sinhala": "හිසරන් තිරාසිකයා",
    "scientific": "Zoothera Citrina Citrina",
    "image": "orange_headed_thrush.jpg",
    "desc": "The orange-headed thrush is a bird in the thrush family. It is common in well-wooded areas of the Indian Subcontinent and Southeast Asia. The orange-headed thrush is omnivorous, eating a wide range of insects, earthworms and fruit. It nests in trees but does not form flocks. The orange-headed thrush is 205–235 milliimetres (8.1–9.25 in) long and weighs 47–60 grammes (1.7–2.1 oz). The adult male of the nominate subspecies of this small thrush has an entirely orange head and underparts, uniformly grey upperparts and wings, and white median and undertail coverts. It has a slate-coloured bill and the legs and feet have brown fronts and pink or yellowish rears. The female resembles the male but has browner or more olive upperparts and wram brown wings, but some old females are almost identical to the male.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Orange-headed_thrush"
  },
  {
    "id": 205,
    "category": 48,
    "name": "Spot-Winged Thrush",
    "sinhala": "තිත්පිය තිරාසිකයා",
    "scientific": "Zoothera Spiloptera",
    "image": "spot_winged_thrush.jpg",
    "desc": "The spot-winged thrush, is an Asian thrush, a group within the large thrush family Turdidae. It is an endemic resident breeder in Sri Lanka. This uncommon species breeds in hill rainforests, and to a lesser extent in drier woodlands, at altitudes between 500 and 2000 m. Adults of this medium-sized thrush, which measures 21 to 27 cm (8.3 to 10.6 in) in total length and weighs 70 g (2.5 oz) are light brown above with a double wing bar of white spots. The pale face has two dark bars. The underparts are white with heavy spotting. The bill is black and legs are yellow. The song is a rich and varied whistling.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Spot-winged_thrush"
  },
  {
    "id": 206,
    "category": 48,
    "name": "Eurasian Blackbird",
    "sinhala": "යුරාසියා කළු බිම්සැරියා",
    "scientific": "Turdus Merula Kinnisii",
    "image": "eurasian_blackbird.jpg",
    "desc": "The common blackbird is a species of true thrush. It is also called Eurasian blackbird, or simply blackbird where this does not lead to confusion with a similar-looking local species. It breeds in Europe, Asia, and North Africa, and has been introduced to Australia and New Zealand. The common blackbird of the nominate subspecies T. m. merula is 23.5 to 29 centimetres (9.25 to 11.4 in) in length, has a long tail, and weighs 80–125 grams (2.8 to 4.4 oz). The adult male has glossy black plumage, blackish-brown legs, a yellow eye-ring and an orange-yellow bill. The bill darkens somewhat in winter. The adult female is sooty-brown with a dull yellowish-brownish bill, a brownish-white throat and some weak mottling on the breast. The juvenile is similar to the female, but has pale spots on the upperparts, and the very young juvenile also has a speckled breast.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_blackbird"
  },
  {
    "id": 207,
    "category": 49,
    "name": "Zitting Cisticola",
    "sinhala": "ඉරි පවන්සැරියා",
    "scientific": "Cisticola Juncidis Cursitans",
    "image": "zitting_cisticola.jpg",
    "desc": "The zitting cisticola or streaked fantail warbler, is a widely distributed Old World warbler whose breeding range includes southern Europe, Africa (outside the deserts and rainforest), and southern Asia down to northern Australia. The zitting cisticola is 10 to 12 cm (3.9 to 4.7 in) in length. It is brown above, heavily streaked with black markings. The underparts are whitish, and the tail is broad, white-tipped and flicked frequently, giving rise to the alternative name for the species. The adult males have less crown streaking and more back marking than the females, but there are no great difference between the sexes or the eighteen geographical races.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Zitting_cisticola"
  },
  {
    "id": 208,
    "category": 49,
    "name": "Grey Breasted Prinia",
    "sinhala": "ළයළු ප්‍රිනියා",
    "scientific": "Prinia Hodgsonii Leggei",
    "image": "grey_breasted_prinia.jpg",
    "desc": "The grey-breasted prinia or Franklin's prinia is a wren-warbler belonging to the family of small passerine birds found mainly in warmer southern regions of the Old World. This prinia is a resident breeder in the Indian subcontinent, Sri Lanka and southeast Asia. These 11-to-13-centimetre (4 to 5 in) long warblers have a longish grey tail with graduated feathers that are tipped in white, they have strong pinkish legs and a short black bill. The eye ring is orange. The sexes look alike in most populations except in P .h. pectoralis of Sri Lanka where the female can be told apart by the incomplete breast band.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey-breasted_prinia"
  },
  {
    "id": 209,
    "category": 49,
    "name": "Plain Prinia",
    "sinhala": "සරළ ප්‍රිනියා",
    "scientific": "Prinia Inornata Insularis",
    "image": "plain_prinia.jpg",
    "desc": "The plain prinia, also known as the plain wren-warbler or white-browed wren-warbler, is a small cisticolid warbler found in southeast Asia. It is a resident breeder from Pakistan and India to south China and southeast Asia. These 13–14-cm long warblers have short rounded wings, a longish tail, strong legs and a short black bill. In breeding plumage, adults are grey-brown above, with a short white supercilium and rufous fringes on the closed wings. The underparts are whitish-buff. The sexes are identical.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Plain_prinia"
  },
  {
    "id": 210,
    "category": 49,
    "name": "Ashy Prinia",
    "sinhala": "අළු ප්‍රිනියා",
    "scientific": "Prinia Socialis Brevicauda",
    "image": "ashy_prinia.jpg",
    "desc": "The ashy prinia or ashy wren-warbler is a small warbler in the family Cisticolidae. This prinia is a resident breeder in the Indian Subcontinent, ranging across most of India, Nepal, Bangladesh, Bhutan, Sri Lanka and western Myanmar. These 13–14 cm long warblers have short rounded wings and longish graduated cream tail tipped with black subterminal spots. The tail is usually held upright and the strong legs are used for clambering about and hopping on the ground. They have a short black bill. The crown is grey and the underparts are rufous in most plumages.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Ashy_prinia"
  },
  {
    "id": 211,
    "category": 49,
    "name": "Jungle Prinia",
    "sinhala": "වන ප්‍රිනියා",
    "scientific": "Prinia Sylvatica Valida",
    "image": "jungle_prinia.jpg",
    "desc": "The jungle prinia is a small passerine bird, a warbler in the Cisticolidae family. These 15 cm (6 in) long warblers have short rounded wings, a longish tail, strong legs and a short black bill. In breeding plumage, adults are grey-brown above, with a short white supercilium and warmer brown rump. There are rufous fringes on the closed wings and white edged to the tail. Underparts are whitish-buff. The sexes are identical except that the male has a blacker bill and mouth in the breeding season.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Jungle_prinia"
  },
  {
    "id": 212,
    "category": 49,
    "name": "Common Tailorbird",
    "sinhala": "බට්ටිච්චා",
    "scientific": "Orthotomus Sutorius Sutorius",
    "image": "common_tailorbird.jpg",
    "desc": "The common tailorbird is a songbird found across tropical Asia. The common tailorbird is a brightly coloured bird, with bright green upperparts and creamy underparts. They range in size from 10 to 14 centimetres (3.9 to 5.5 in) and weigh 6 to 10 grams (0.21 to 0.35 oz). They have short rounded wings, a long tail, strong legs and a sharp bill with curved tip to the upper mandible. They are wren-like with a long upright tail that is often moved around. The crown is rufous and the upperparts are predominantly olive green. The underside is creamy white. The sexes are identical, except that the male has long central tail feathers in the breeding season, although the reliability of sexing data accompanying museum specimens used in determining this sexual dimorphism has been questioned. Young birds are duller.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_tailorbird"
  },
  {
    "id": 213,
    "category": 49,
    "name": "Bright Green Warbler",
    "sinhala": "කොළ ගස්රැවියා",
    "scientific": "Phylloscopus Nitidus",
    "image": "bright_green_warbler.jpg",
    "desc": "The green warbler, also known as green willow warbler or green leaf warbler, is a leaf warbler found in the Caucasus Mountains in southcentral Europe. It is most closely related to the greenish warbler but is brighter in colour, and the underside is much more yellow. It has one strong and one faint wing bar, especially in young birds.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Green_warbler"
  },
  {
    "id": 214,
    "category": 49,
    "name": "Large-billed Leaf Warbler",
    "sinhala": "මාතුඩු ගස්රැවියා",
    "scientific": "Phylloscopus Magnirostris",
    "image": "large_billed_leaf_warbler.jpg",
    "desc": "The large-billed leaf warbler is a species of leaf warbler (family Phylloscopidae). It was formerly included in the 'Old World warbler' assemblage.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Large-billed_leaf_warbler"
  },
  {
    "id": 215,
    "category": 50,
    "name": "Tickell's Blue Flycatcher",
    "sinhala": "ටිකල් නිල් මැසිමාරා",
    "scientific": "Cyornis Tickelliae Jerdoni",
    "image": "tickell_s_blue_flycatcher.jpg",
    "desc": "Tickell's blue flycatcher is a small passerine bird in the flycatcher family. This is an insectivorous species which breeds in tropical Asia, from the Indian Subcontinent eastwards to Southeast Asia. Tickell's blue flycatcher is about 11–12 cm long. It sits upright and forages mainly in the overgrowth. The male's upper parts are bright blue, its throat and breast are red, and the rest of the underparts are white. The female is duller blue with a brighter blue brow, shoulder, rump, and tail.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Tickell%27s_blue_flycatcher"
  },
  {
    "id": 216,
    "category": 50,
    "name": "Dull-Blue Flycatcher",
    "sinhala": "අඳුරු නිල් මැසිමාරා",
    "scientific": "Eumyias Sordida",
    "image": "dull_blue_flycatcher.jpg",
    "desc": "The dull-blue flycatcher is a small passerine bird in the flycatcher family, Muscicapidae. It was previously included in the genus Muscicapa. This species is an endemic resident breeder in the hills of central Sri Lanka. This species is 15 cm long. It is similar in shape to the spotted flycatcher and has a loud melodic song.. Adults are ashy blue, with a whitish belly. There is a black patch between the broad black bill and the eye, bordered with brighter blue above and below. Sexes are similar, but females are slightly duller.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Dull-blue_flycatcher"
  },
  {
    "id": 217,
    "category": 50,
    "name": "Brown-breasted Flycatcher",
    "sinhala": "ළයබොර මැසිමාරා",
    "scientific": "Muscicapa Muttui Muttui",
    "image": "brown_breasted_flycatcher.jpg",
    "desc": "The brown-breasted flycatcher or Layard's flycatcher is a small passerine bird in the flycatcher family Muscicapidae. The species breeds in north eastern India, central and Southern China and northern Burma and Thailand, and migrates to southern India and Sri Lanka. The brown-breasted flycatcher is 13–14 cm in length and weighs between 10-14 g. The overall colour of the upperparts is olive brown. Some of the feather shafts are darker. The upper tail coverts are brighter rufous as are the edges of the flight feathers. The tail feathers have rufous on the outer webs. The lores are pale and the eye ring is conspicuous. The chin and throat are white while the breast and sides of the body are pale brown. The middle of the body to the vent is buffy white.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Brown-breasted_flycatcher"
  },
  {
    "id": 218,
    "category": 50,
    "name": "Asian Brown Flycatcher",
    "sinhala": "ආසියා දුඹුරු මැසිමාරා",
    "scientific": "Muscicapa Dauurica",
    "image": "asian_brown_flycatcher.jpg",
    "desc": "The Asian brown flycatcher is a small passerine bird in the flycatcher family Muscicapidae. This is an insectivorous species which breeds in Japan, eastern Siberia and the Himalayas. It is migratory and winters in tropical southern Asia from southern India and Sri Lanka east to Indonesia. This species is 13 cm (5.1 in) long, including the cocked tail. It is similar in shape to the larger spotted flycatcher, but is relatively longer-tailed. The dark bill is relatively large and broad-based. The adult has grey-brown upperparts, which become greyer as the plumage ages, and whitish underparts with brown-tinged flanks. Young birds have scaly brown upperparts, head and breast.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Asian_brown_flycatcher"
  },
  {
    "id": 219,
    "category": 50,
    "name": "Kashmir Flycatcher",
    "sinhala": "කාශ්මීර රත් මැසිමාරා",
    "scientific": "Ficedula Subrubra",
    "image": "kashmir_flycatcher.jpg",
    "desc": "The Kashmir flycatcher is a small passerine bird in the flycatcher family Muscicapidae. This is an insectivorous species which breeds in the north-west Himalayas in the Kashmir region of the Indian Subcontinent. It is migratory and winters in the hills of central Sri Lanka and the Western Ghats of India. This species is 13 cm long. It is similar in shape to the slightly smaller red-breasted flycatcher. The male has a grey-brown back with an orange-red throat, breast and flanks, bordered with black on the throat and breast. Females and first-winter birds have slightly browner upperparts, and the red of the underparts may be reduced to just a pinkish wash.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Kashmir_flycatcher"
  },
  {
    "id": 220,
    "category": 50,
    "name": "Grey-Headed Canary Flycatcher",
    "sinhala": "අළුහිස් කහ මැසිමාරා",
    "scientific": "Culicicapa Ceylonensis Ceylonensis",
    "image": "grey_headed_canary_flycatcher.jpg",
    "desc": "The grey-headed canary-flycatcher sometimes known as the grey-headed flycatcher is a species of small flycatcher-like bird found in tropical Asia. The grey-headed canary-flycatcher is about 12–13 cm long with a squarish grey head, a canary yellow belly and yellowish-green upperparts. They forage actively like flycatchers and perches in a very upright posture. The sexes are indistinguishable in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey-headed_canary-flycatcher"
  },
  {
    "id": 221,
    "category": 51,
    "name": "White-browed Fantail",
    "sinhala": "බැමසුදු පවන්පෙන්දා",
    "scientific": "Rhipidura Aureola Compressirostris",
    "image": "white_browed_fantail.jpg",
    "desc": "The white-browed fantail is a small passerine bird belonging to the family Rhipiduridae. The adult white-browed fantail is about 18 cm long. It has dark brown upperparts, with white spots on the wings, and whitish underparts. The fan-shaped tail is edged in white, and the long white supercilia meet on the forehead. The throat and eyemask are blackish and border whitish moustachial stripes.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/White-browed_fantail"
  },
  {
    "id": 222,
    "category": 52,
    "name": "Asian Paradise-Flycatcher-Ceylon",
    "sinhala": "ආසියා රැහන්මාරා (සිවුරු හොරා)",
    "scientific": "Terpsiphone Paradisi Paradisi",
    "image": "asian_paradise_flycatcher_ceylon.jpg",
    "desc": "The Indian paradise flycatcher is a medium-sized passerine bird native to Asia that is widely distributed.  Adult Indian paradise flycatchers are 19–22 cm (7.5–8.7 in) long. Their heads are glossy black with a black crown and crest, their black bill round and sturdy, their eyes black. Female are rufous on the back with a greyish throat and underparts. Their wings are 86–92 mm (3.4–3.6 in) long. Young males look very much like females but have a black throat and blue-ringed eyes. As adults they develop up to 24 cm (9.4 in) long tail feathers with two central tail feathers growing up to 30 cm (12 in) long drooping streamers.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_paradise_flycatcher"
  },
  {
    "id": 223,
    "category": 52,
    "name": "Asian Paradise-Flycatcher-Indian",
    "sinhala": "ආසියා රැහන්මාරා (සුදුරෙදි හොරා)",
    "scientific": "Terpsiphone Paradisi Paradisi",
    "image": "asian_paradise_flycatcher_indian.jpg",
    "desc": "The Indian paradise flycatcher is a medium-sized passerine bird native to Asia that is widely distributed.  Adult Indian paradise flycatchers are 19–22 cm (7.5–8.7 in) long. Their heads are glossy black with a black crown and crest, their black bill round and sturdy, their eyes black. Female are rufous on the back with a greyish throat and underparts. Their wings are 86–92 mm (3.4–3.6 in) long. Young males look very much like females but have a black throat and blue-ringed eyes. As adults they develop up to 24 cm (9.4 in) long tail feathers with two central tail feathers growing up to 30 cm (12 in) long drooping streamers.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_paradise_flycatcher"
  },
  {
    "id": 224,
    "category": 53,
    "name": "Ceylon Scimitar Babbler",
    "sinhala": "ශ්‍රී ලංකා දෑ-දෙමලිච්චා",
    "scientific": "Pomatorhinus Melanurus",
    "image": "ceylon_scimitar_babbler.jpg",
    "desc": "The Sri Lanka scimitar babbler or Ceylon scimitar babbler is an Old World babbler. It is endemic to the island of Sri Lanka, and was formerly treated as a subspecies of Indian scimitar babbler. The nominate form is found in the western part of wet hill regions of Sri Lanka, while race holdsworthi is found in the dry lowlands and eastern hills.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_scimitar_babbler"
  },
  {
    "id": 225,
    "category": 53,
    "name": "Tawny-Bellied Babbler",
    "sinhala": "කුසකහ කඳු-දෙමලිච්චා",
    "scientific": "Dumetia Hyperythra Phillipsi",
    "image": "tawny_bellied_babbler.jpg",
    "desc": "The tawny-bellied babbler (Dumetia hyperythra) also known in older Indian works as the rufous-bellied babbler is a small babbler that forages in groups in low scrub forests. The tawny-bellied babbler is a small babbler at 13 cm including its long round-tipped tail. The outer tail feathers are about half the length of the central tail feather. It is dark brown above and orange-buff below, with a rufous grey crown. The feathers on the forehead are stiff and the tail has cross rays and is otherwise olive brown. The throat is white in adults of the populations of peninsular India and Sri Lanka. The Sri Lankan population however has a larger and heavier beak and paler underparts.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Tawny-bellied_babbler"
  },
  {
    "id": 226,
    "category": 53,
    "name": "Dark-Fronted Babbler",
    "sinhala": "වතඳුරු පඳුරු දෙමලිච්චා",
    "scientific": "Rhopocichla Atriceps Siccata",
    "image": "dark_fronted_babbler.jpg",
    "desc": "The dark-fronted babbler is an Old World babbler found in the Western Ghats of India and the forests of Sri Lanka.  The dark-fronted babbler measures 13 cm including its square-tipped tail. It is brown above and white below. The two subspecies in the Western Ghats have black hoods, but the two Sri Lankan races have this reduced to a dark bandit mask. The pale yellow iris stands in contrast. The subspecies in the southern Western Ghats bourdilloni has a duller sooty-black hood, browner underside and the upper parts are more olive.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Dark-fronted_babbler"
  },
  {
    "id": 227,
    "category": 53,
    "name": "Yellow-Eyed Babbler",
    "sinhala": "නෙත්කහ තණ දෙමලිච්චා",
    "scientific": "Chrysomma Sinense Nasale",
    "image": "yellow_eyed_babbler.jpg",
    "desc": "The yellow-eyed babbler is a passerine bird native to South and Southeast Asia. The yellow-eyed babbler is about 18 centimetres (7.1 in) long with a short bill and a long graduated tail. The body above is brown and the wings are cinnamon coloured. The lores and supercilium are white and the rim of the eye is orange-yellow in adult birds. The beak is black. The underside is whitish buff. The central tail feathers are about twice as long as the outermost. The sexes are indistinguishable in the field.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow-eyed_babbler"
  },
  {
    "id": 228,
    "category": 53,
    "name": "Orange-Billed babbler",
    "sinhala": "රතු දෙමලිච්චා",
    "scientific": "Turdoides Rufescens",
    "image": "orange_billed_babbler.jpg",
    "desc": "The orange-billed babbler also known as Ceylon rufous babbler or Sri Lankan rufous babbler is a member of the family Leiothrichidae. The orange-billed babbler is a resident breeding bird endemic to Sri Lanka. In the past, it was considered to be a race of jungle babbler, Turdoides striatus. Although its habitat is under threat, it occurs in all the forests of the wet zone, and is quite common at prime sites like Kitulgala and Sinharaja. These birds are plain orange brown below, and have a slightly darker shade above. The crown and nape are grey, and the bill is orange.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Orange-billed_babbler"
  },
  {
    "id": 229,
    "category": 53,
    "name": "Yellow-billed Babbler",
    "sinhala": "දෙමලිච්චා",
    "scientific": "Turdoides Affinis Taprobanus",
    "image": "yellow_billed_babbler.jpg",
    "desc": "The yellow-billed babbler or white-headed babbler is a member of the Leiothrichidae family endemic to southern India and Sri Lanka. The yellow-billed babbler is a common resident breeding bird in Sri Lanka and southern India. These birds have grey brown upperparts, grey throat and breast with some mottling, and a pale buff belly. The head and nape are grey. The Sri Lankan form T. a. taprobanus is drab pale grey. Nominate race of southern India has whitish crown and nape with a darker mantle. The rump is paler and the tail has a broad dark tip. Birds in the extreme south of India are very similar to the Sri Lankan subspecies with the colour of the crown and back being more grey. The eye is bluish white. The Indian form is more heavily streaked on the throat and breast.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow-billed_babbler"
  },
  {
    "id": 230,
    "category": 53,
    "name": "Ashy-Headed Laughingthrush",
    "sinhala": "හිස අළු දෙමලිච්චා",
    "scientific": "Garrulax Cinereifrons",
    "image": "ashy_headed_laughingthrush.jpg",
    "desc": "The ashy-headed laughingthrush is a member of the family Leiothrichidae. he ashy-headed laughingthrush is a rangy bird, 23 centimetre (9 in) in length with a long floppy tail. It is rufous brown above and deep buff below, with a grey head and white throat. Like other babblers, these are noisy birds, and the characteristic laughing calls are often the best indication that they are present, since they are often difficult to see in their preferred habitat.",
    "migrant": 0,
    "endemic": 1,
    "code": "SE",
    "wikipedia": "https://en.wikipedia.org/wiki/Ashy-headed_laughingthrush"
  },
  {
    "id": 231,
    "category": 54,
    "name": "Great Tit",
    "sinhala": "මහ ටිකිරිත්තා",
    "scientific": "Parus Major Mahrattarum",
    "image": "great_tit.jpg",
    "desc": "The great tit is a passerine bird in the tit family Paridae. It is a widespread and common species throughout Europe, the Middle East, Central and Northern Asia, and parts of North Africa where it is generally resident in any sort of woodland; most great tits do not migrate except in extremely harsh winters. The great tit is large for a tit at 12.5 to 14.0 cm (4.9–5.5 in) in length, and has a distinctive appearance that makes it easy to recognise. The nominate race P. major major has a bluish-black crown, black neck, throat, bib and head, and white cheeks and ear coverts. The breast is bright lemon-yellow and there is a broad black mid-line stripe running from the bib to vent. There is a dull white spot on the neck turning to greenish yellow on the upper nape. The rest of the nape and back are green tinged with olive. The wing-coverts are green, the rest of the wing is bluish-grey with a white-wing-bar. The tail is bluish grey with white outer tips. The plumage of the female is similar to that of the male except that the colours are overall duller; the bib is less intensely black,[10] as is the line running down the belly, which is also narrower and sometimes broken.[15] Young birds are like the female, except that they have dull olive-brown napes and necks, greyish rumps, and greyer tails, with less defined white tips.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_tit"
  },
  {
    "id": 232,
    "category": 55,
    "name": "Velvet-Fronted Nuthatch",
    "sinhala": "විල්ලුද නළල් යටිකුරිත්තා",
    "scientific": "Sitta Frontalis Frontalis",
    "image": "velvet_fronted_nuthatch.jpg",
    "desc": "The velvet-fronted nuthatch is a small passerine bird in the nuthatch family Sittidae found in southern Asia from Nepal, India, Sri Lanka ‍and Bangladesh east to south China and Indonesia. The velvet-fronted nuthatch has the typical nuthatch shape, short tail and powerful bill and feet. It is 12.5 cm long. It is violet-blue above, with lavender cheeks, beige underparts, yellow eyes, and a whitish throat. The iris is distinctly pale and yellow. The bill is red, and there is a black patch on the forehead and lores which is well developed in adults and less so in younger birds. Young birds have a dark beak and dark tips to the undertail coverts. Adult males can be told apart by the black superciliary stripe that runs above the eye and over the head, towards the nape. Females lack the supercilium and have a warmer underpart colour. Juveniles are duller versions of the adult lacking the black frontal band. There populations differ in shade and size and the distribution of white on the throat.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Velvet-fronted_nuthatch"
  },
  {
    "id": 233,
    "category": 56,
    "name": "Purple-Rumped Sunbird",
    "sinhala": "නිතඹ දම් සූටික්කා",
    "scientific": "Nectarinia Zeylonica Zeylonica",
    "image": "purple_rumped_sunbird.jpg",
    "desc": "The purple-rumped sunbird is a sunbird endemic to the Indian Subcontinent. Like other sunbirds, they are small in size, feeding mainly on nectar but sometimes take insects, particularly when feeding young. Purple-rumped sunbirds are tiny at less than 10 cm long. They have medium-length thin down-curved bills and brush-tipped tubular tongues, both adaptations for nectar feeding. Purple-rumped sunbirds are sexually dimorphic. The males have a dark maroon upperside with a blue-green crown that glistens at some angles, bright green shoulder patch and violet/purple rump patch which is generally hidden under the wings. The underparts are whitish with dark throat, maroon breast band and purple/violet patch in the throat which is visible in some angles. The female has a white throat followed by yellowish breast. The upperside is olive or brownish. The uppertail coverts are black and a weak supercilium may be visible. The nominate subspecies from Sri Lanka has a more bluish violet throat whereas the Indian form flaviventris has a more pinkish tinge.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Purple-rumped_sunbird"
  },
  {
    "id": 234,
    "category": 56,
    "name": "Loten's Sunbird",
    "sinhala": "ලෝටන් සූටික්කා",
    "scientific": "Nectarinia Lotenia Lotenia",
    "image": "loten_s_sunbird.jpg",
    "desc": "The Loten's sunbird, long-billed sunbird or maroon-breasted sunbird, is a sunbird endemic to peninsular India and Sri Lanka. Its long bill distinguishes it from the similar purple sunbird that is found in the same areas and also tends to hover at flowers.  Loten's sunbirds are small, only 12–13 cm long. The long bill separates this from the syntopic purple sunbird. The wings are browner and the maroon breast band is visible on the male under good lighting conditions. The males have pectoral tufts of yellow mixed with crimson that are used in displays. The adult male is mainly glossy purple with a grey-brown belly. The female has yellow-grey upperparts and yellowish underparts, but lacks Purple's faint supercilium. The call is distinctive buzzy zwick zwick and they are also very active often bobbing their head while foraging. They long down-curved bills and brush-tipped tubular tongues, are adaptations to their nectar feeding. The bill lengths vary across populations with the longest bills are found on the east of Peninsular India and in Sri Lanka.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Loten%27s_sunbird"
  },
  {
    "id": 235,
    "category": 56,
    "name": "Purple Sunbird",
    "sinhala": "දම් සූටික්කා",
    "scientific": "Nectarinia Lotenia Lotenia",
    "image": "purple_sunbird.jpg",
    "desc": "The purple sunbird is a small sunbird. Like other sunbirds they feed mainly on nectar, although they will also take insects, especially when feeding young.This small sunbird has a relatively short bill, a dark and short square ended tail with distinctive sexual dimorphism. Less than 10 cm long they have a down-curved bill with brush-tipped tubular tongues that aid in nectar feeding. The male is glossy metallic bluish to purplish black on the upper parts with the wings appearing dark brown. The breeding male also has underparts of the same purplish black, but non-breeding males may show a central streak of black on yellow underparts. Females are olive brown above with a yellowish underside. There is a pale supercilium beyond the eye. There is a darkish eye stripe. The throat and breast are yellow, becoming pale towards the vent. The outer tail feathers are tipped in white both in the male and female.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Purple_sunbird"
  },
  {
    "id": 236,
    "category": 57,
    "name": "Legge's Flowerpecker",
    "sinhala": "ලෙග් පිළිලිච්චා",
    "scientific": "Dicaeum Vincens",
    "image": "legge_s_flowerpecker.jpg",
    "desc": "The Legge's flowerpecker or white-throated flowerpecker is a small passerine bird. It is an endemic resident breeder in Sri Lanka. This is a very small passerine but a relatively stout flowerpecker, measuring 10 cm (3.9 in) in total length and weighing approximately 9 g (0.32 oz), with a short tail, short thick curved bill and tubular tongue. The latter features reflect the importance of nectar in its diet, although berries, spiders and insects are also taken. The male Legge's flowerpecker has blue-black upperparts, a white throat and upper breast, and yellow lower breast and belly. The female is duller, with olive-brown upperparts.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Legge%27s_flowerpecker"
  },
  {
    "id": 237,
    "category": 57,
    "name": "Pale-billed Flowerpecker",
    "sinhala": "ළා තුඩු පිළිලිච්චා",
    "scientific": "Dicaeum Erythrorhynchos Ceylonense",
    "image": "pale_billed_flowerpecker.jpg",
    "desc": "The pale-billed flowerpecker or Tickell's flowerpecker is a tiny bird that feeds on nectar and berries, found in India, Sri Lanka, Bangladesh and western Myanmar. This is a tiny bird, 8 cm long, and is one of the smallest birds occurring in most parts of southern India and Sri Lanka. The bird is plain brownish to olive green. The underside is buff olive and does not contrast greatly with the upperparts and not whitish.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Pale-billed_flowerpecker"
  },
  {
    "id": 238,
    "category": 58,
    "name": "Oriental White-Eye",
    "sinhala": "ළා තුඩු පිළිලිච්චා",
    "scientific": "Zosterops Palpebrosa Egregia",
    "image": "oriental_white_eye.jpg",
    "desc": "The Oriental white-eye is a small passerine bird in the white-eye family. It is a resident breeder in open woodland in tropical Asia, east from the Indian subcontinent to Southeast Asia, extending to Indonesia and Malaysia. his bird is small (about 8–9 cm long) with yellowish olive upper parts, a white eye ring, yellow throat and vent. The belly is whitish grey but may have yellow in some subspecies. The sexes look similar.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Oriental_white-eye"
  },
  {
    "id": 239,
    "category": 58,
    "name": "Ceylon White-Eye",
    "sinhala": "ශ්‍රී ලංකා සිතාසියා",
    "scientific": "Zosterops Ceylonensis",
    "image": "ceylon_white_eye.jpg",
    "desc": "The Sri Lanka white-eye is a small passerine bird in the white-eye family. It is a resident breeder in forests, gardens and plantations which is endemic to Sri Lanka, mainly in the highlands.  This bird is slightly larger than the Oriental white-eye (about 11 cm long) which it replaces above 4000 ft. The upper parts of the body and sides of neck are dark olive green. The rump appears paler green while the crown and forehead appear darker. The wings and tail are brown edged with green on the back. The typical ring of tiny white feathers around the eye is present. The lores are dark and there is a dark streak below the eye. The chin, throat and upper breast are greenish-yellow as are the thighs and vent. The belly region is grayish white. The dark bill has a slaty base to the lower mandible. The legs are dark. The iris is yellow to reddish brown.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_white-eye"
  },
  {
    "id": 240,
    "category": 59,
    "name": "Black-Hooded Oriole",
    "sinhala": "කහ කුරුල්ලා",
    "scientific": "Oriolus Xanthornus Ceylonensis",
    "image": "black_hooded_oriole.jpg",
    "desc": "The black-hooded oriole is a member of the oriole family of passerine birds and is a resident breeder in tropical southern Asia from India and Sri Lanka east to Indonesia. The male is striking, with the typical oriole black and yellow colouration. The plumage is predominantly yellow, with a solid black hood, and black also in the wings and tail centre. The female black-hooded oriole is a drabber bird with greenish underparts, but still has the black hood. Young birds are like the female, but have dark streaking on the underparts, and their hood is not solidly black, especially on the throat.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-hooded_oriole"
  },
  {
    "id": 241,
    "category": 60,
    "name": "Brown Shrike",
    "sinhala": "බොර සබරිත්තා",
    "scientific": "Lanius Cristatus Cristatus",
    "image": "brown_shrike.jpg",
    "desc": "The brown shrike is a bird in the shrike family that is found mainly in Asia. This shrike is mainly brown on the upper parts and the tail is rounded. The black mask can be paler in winter and has a white brow over it. The underside is creamy with rufous flanks and belly. The wings are brown and lack any white 'mirror' patches. Females tend to have fine scalloping on the underside and the mask is dark brown and not as well marked as in the male. The distinction is not easy to use in the field but has been tested with breeding birds in Japan where the female can be identified from the presence of a brood patch.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Brown_shrike"
  },
  {
    "id": 242,
    "category": 60,
    "name": "Long-Tailed Shrike",
    "sinhala": "දික්පෙඳ සබරිත්තා",
    "scientific": "Lanius Cristatus Cristatus",
    "image": "long_tailed_shrike.jpg",
    "desc": "The long-tailed shrike or rufous-backed shrike is a member of the bird family Laniidae, the shrikes. They are found widely distributed across Asia and there are variations in plumage across the range. The long-tailed shrike is a typical shrike, favouring dry open habitats and found perched prominently atop a bush or on a wire. The dark mask through the eye is broad and covers the forehead in most subspecies and the whole head is black in subspecies tricolor and nasutus. The tail is narrow and graduated with pale rufous on the outer feathers.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Long-tailed_shrike"
  },
  {
    "id": 243,
    "category": 60,
    "name": "Bay-backed Shrike",
    "sinhala": "බොරපිටැති සබරිත්තා",
    "scientific": "Corvus Culminatus",
    "image": "bay_backed_shrike.jpg",
    "desc": "The bay-backed shrike is a member of the bird family Laniidae, the shrikes, resident in South Asia.  It is smallish shrike at 17 cm, maroon-brown above with a pale rump and long black tail with white edges. The underparts are white, but with buff flanks. The crown and nape are grey, with a typical shrike black bandit mask through the eye. There is a small white wing patch, and the bill and legs are dark grey. Sexes are similar, but young birds are washed-out versions of the adults.",
    "migrant": 1,
    "endemic": 0,
    "code": "SHM",
    "wikipedia": "https://en.wikipedia.org/wiki/Bay-backed_shrike"
  },
  {
    "id": 244,
    "category": 61,
    "name": "Black Drongo",
    "sinhala": "කළු කවුඩා",
    "scientific": "Dicrurus Macrocercus Minor",
    "image": "black_drongo.jpg",
    "desc": "The black drongo is a small Asian passerine bird of the drongo family Dicruridae. It is a common resident breeder in much of tropical southern Asia from southwest Iran through India and Sri Lanka east to southern China and Indonesia. This bird is glossy black with a wide fork to the tail. Adults usually have a small white spot at the base of the gape. The iris is dark brown (not crimson as in the similar ashy drongo). The sexes cannot be told apart in the field.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black_drongo"
  },
  {
    "id": 245,
    "category": 61,
    "name": "White-Bellied Drongo",
    "sinhala": "ළයසුදු කවුඩා",
    "scientific": "Dicrurus Caerulescens Insularis",
    "image": "white_bellied_drongo.jpg",
    "desc": "The white-bellied drongo is a species of drongo found across the Indian Subcontinent. Like other members of the family Dicruridae they are insectivorous and is mainly black in colour but with a white belly and vent. Young birds are, however, all black and can be confused with the black drongo, although smaller and more compact in appearance, and the subspecies found in Sri Lanka has white restricted to the vent. This drongo is black without any glossy feathers on the upperside and greyish on the throat and breast, while the belly and vent are entirely white in the Indian form which is the nominate subspecies. The fork of the tail is less deep than in the black drongo which is often seen in the same habitats. Young black drongo's can have a lot of white on the underside but it is usually scaly in appearance. The Sri Lankan forms insularis of the northern dry zone and leucopygialis of the southern wet zone have the white restricted to the vent. Birds that are less than a year old lack the white on the underside but are browner above and greyish below. Males have a very slightly shorter tail on average than females.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/White-bellied_drongo"
  },
  {
    "id": 246,
    "category": 61,
    "name": "Greater Racket-tailed Drongo",
    "sinhala": "පිතිපෙඳ කවුඩා",
    "scientific": "Dicrurus Paradiseus Ceylonicus",
    "image": "greater_racket_tailed_drongo.jpg",
    "desc": "The greater racket-tailed drongo is a medium-sized Asian bird which is distinctive in having elongated outer tail feathers with webbing restricted to the tips. They are placed along with other drongos in the family Dicruridae. In most of its range in Asia, this is the largest of the drongo species and is readily identifiable by the distinctive tail rackets and the crest of curled feather that begin in front of the face above the beak and along the crown to varying extents according to the subspecies. The tail with twirled rackets is distinctive and in flight it can appear as if two large bees were chasing a black bird.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_racket-tailed_drongo"
  },
  {
    "id": 247,
    "category": 61,
    "name": "Ceylon Crested Drongo",
    "sinhala": "ශ්‍රී ලංකා කවුඩා",
    "scientific": "Dicrurus Lophorhinus",
    "image": "ceylon_crested_drongo.jpg",
    "desc": "The Sri Lanka drongo, or Ceylon crested drongo, is a species of bird in the family Dicruridae. It is endemic to Sri Lanka. It was previously considered a subspecies of the greater racket-tailed drongo. Its natural habitats are subtropical or tropical moist lowland and montane forests. It has Black plumage with metallic blue or greenish-blue gloss, Arching, helmet-like crest, Deeply forked tail and Red eyes. Sexes are simillar.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_drongo"
  },
  {
    "id": 248,
    "category": 62,
    "name": "Ashy Woodswallow",
    "sinhala": "අළු වනළිහිණියා",
    "scientific": "Artamus Fuscus",
    "image": "ashy_woodswallow.jpg",
    "desc": "The ashy woodswallow sometimes also called the ashy swallow-shrike is a woodswallow which is found in south Asia. Like other woodswallows, it has a short curve bill and a short square tail and long wings.  This stocky woodswallow has an ashy grey upperparts with a darker head and a narrow pale band on the rump. The underside is pinkish grey and the short slaty black tail is tipped in white. The finch-like bill is silvery. In flight the long wing looks very broad at the base giving it a very triangular outline. The first primary is very short. The legs are short and the birds usually perch on high vantage points from which they make aerial sallies. Males and females are indistinguishable in the field, however an old report suggests that the sexes differ in the colour of the inside of the mouth.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Ashy_woodswallow"
  },
  {
    "id": 249,
    "category": 63,
    "name": "Ceylon Blue Magpie",
    "sinhala": "ශ්‍රී ලංකා කැහිබෙල්ලා",
    "scientific": "Urocissa ornata",
    "image": "ceylon_blue_magpie.jpg",
    "desc": "The Sri Lanka blue magpie or Ceylon magpie is a member of the crow family living in the hill forests of Sri Lanka, where it is endemic. The Sri Lanka blue magpie is about the same size as the European magpie at 42–47 cm. The adults have blue feathers with chestnut head and wings, and a long white-tipped tail. The legs and bill are red. The young bird is a duller version of the adult.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_blue_magpie"
  },
  {
    "id": 250,
    "category": 63,
    "name": "House Crow",
    "sinhala": "කොළඹ කපුටා",
    "scientific": "Corvus Splendens Protegatus",
    "image": "house_crow.jpg",
    "desc": "The house crow, also known as the Indian, greynecked, Ceylon or Colombo crow, is a common bird of the crow family that is of Asian origin but now found in many parts of the world, where they arrived assisted by shipping. It is between the jackdaw and the carrion crow in size (40 cm (16 in) in length) but is slimmer than either. The forehead, crown, throat and upper breast are a richly glossed black, whilst the neck and breast are a lighter grey-brown in colour. The wings, tail and legs are black. There are regional variations in the thickness of the bill and the depth of colour in areas of the plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/House_crow"
  },
  {
    "id": 251,
    "category": 63,
    "name": "Indian Jungle Crow",
    "sinhala": "කළු කපුටා",
    "scientific": "Corvus Macrorhynchos Culminatus",
    "image": "indian_jungle_crow.jpg",
    "desc": "The Indian jungle crow is a species of crow found across the Indian Subcontinent south of the Himalayas. It is very common and readily distinguished from the house crow which has a grey neck. This glossy all-black crow has a heavy black bill but without an arching culmen (upper edge of the mandible) and has a fine tip. The feathers have a purple gloss throughout. The tail of the Indian jungle crow is rounded and the legs and feet are stout. The base of the nape feathers is dusky. The sexes are indistinguishable.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_jungle_crow"
  },
  {
    "id": 252,
    "category": 64,
    "name": "White-Faced Starling",
    "sinhala": "වත සුදු ශාරිකාවා",
    "scientific": "Sturnia Albofrontatus",
    "image": "white_faced_starling.jpg",
    "desc": "The white-faced starling, is a member of the starling family of birds. It is an endemic resident breeder in Sri Lanka. The adults of these 22 cm-long birds have green-glossed dark grey upperparts and whitish underparts. The head is paler than the underparts. The sexes are similar, but juveniles are duller, with brown upperparts and greyer underparts.",
    "migrant": 0,
    "endemic": 1,
    "code": "SHE",
    "wikipedia": "https://en.wikipedia.org/wiki/White-faced_starling"
  },
  {
    "id": 253,
    "category": 64,
    "name": "Brahminy Starling",
    "sinhala": "බමුණු ශාරිකාවා",
    "scientific": "Sturnus Pagodarum",
    "image": "brahminy_starling.jpg",
    "desc": "The brahminy myna or brahminy starling is a member of the starling family of birds. It is usually seen in pairs or small flocks in open habitats on the plains of the Indian subcontinent. This myna is pale buff creamy with a black cap and a loose crest. The bill is yellow with a bluish base. The iris is pale and there is a bluish patch of skin around the eye. The outer tail feathers have white and the black primaries of the wings do not have any white patches. The adult male has a more prominent crest than the female and also has longer neck hackles. Juveniles are duller and the cap is browner.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Brahminy_starling"
  },
  {
    "id": 254,
    "category": 64,
    "name": "Rosy Starling",
    "sinhala": "රෝස ශාරිකාවා",
    "scientific": "Sturnus Roseus",
    "image": "rosy_starling.jpg",
    "desc": "The rosy starling is a passerine bird in the starling family, Sturnidae, also known as the rose-coloured starling or rose-coloured pastor. The adult rosy starling is highly distinctive, with its pink body, pale orange legs and bill, and glossy black head, wings and tail. Males in the breeding season have elongated head feathers which form a wispy crest that is fluffed and more prominent when the bird gets excited. In winter, the crest is shorter, and the edges of black feathers within the plumage become paler as the edges of these feather erode. Winter plumage in males is comparatively dull. Females in contrast have a short crest and lack the sharp separation between pink and black.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Rosy_starling"
  },
  {
    "id": 255,
    "category": 64,
    "name": "Common Myna",
    "sinhala": "මයිනා",
    "scientific": "Acridotheres Tristis Melanosternus",
    "image": "common_myna.jpg",
    "desc": "The common myna or Indian myna, sometimes spelled mynah, is a member of the family Sturnidae (starlings and mynas) native to Asia. The common myna is readily identified by the brown body, black hooded head and the bare yellow patch behind the eye. The bill and legs are bright yellow. There is a white patch on the outer primaries and the wing lining on the underside is white. The sexes are similar and birds are usually seen in pairs.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_myna"
  },
  {
    "id": 256,
    "category": 64,
    "name": "Ceylon Hill-Myna",
    "sinhala": "ශ්‍රී ලංකා සැළලිහිණියා",
    "scientific": "Gracula Ptilogenys",
    "image": "ceylon_hill_myna.jpg",
    "desc": "The Sri Lanka hill myna, Ceylon myna or Sri Lanka myna, is a myna, a member of the starling family. This bird is endemic to Sri Lanka. This passerine is typically found in forest and cultivation. The Sri Lanka myna builds a nest in a hole. The normal clutch is two eggs. These 25 cm long birds have green-glossed black plumage, purple-tinged on the head and neck. There are large white wing patches, which are obvious in flight. The strong legs are bright yellow, and there are yellow wattles on the nape. The different shape and position of the wattles and the stouter orange-red bill distinguish this species from the Southern hill myna, which also occurs in Sri Lankan forests. The sexes are similar, but juveniles have a duller bill.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_hill_myna"
  },
  {
    "id": 257,
    "category": 64,
    "name": "Lesser Hill-Myna",
    "sinhala": "සැළලිහිණියා",
    "scientific": "Gracula Indica",
    "image": "lesser_hill_myna.jpg",
    "desc": "The common hill myna, sometimes spelled 'mynah' and formerly simply known as hill myna, is the myna most commonly seen in aviculture, where it is often simply referred to by the latter two names. It is a member of the starling family (Sturnidae), resident in hill regions of South Asia and Southeast Asia.  This is a stocky jet-black myna, with bright orange-yellow patches of naked skin and fleshy wattles on the side of its head and nape. At about 29 cm length, it is somewhat larger than the common myna. It is overall green-glossed black plumage, purple-tinged on the head and neck. Its large, white wing patches are obvious in flight, but mostly covered when the bird is sitting. The bill and strong legs are bright yellow, and there are yellow wattles on the nape and under the eye. Sexes are similar; juveniles have a duller bill.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_hill_myna"
  }
]