[
  {
    "id": 1,
    "category": 1,
    "name": "Little Grebe",
    "sinhala": "පුංචි ගෙඹිතුරුවා",
    "scientific": "Tachybaptus Ruficollis Capensis",
    "image": "little_grebe.jpg",
    "desc": "Grebes are small to medium-sized diving birds. They breed on fresh water, but often visit the sea whilst migrating and in winter. They have lobed toes and are excellent swimmers and divers; however, their feet are placed far back on their bodies, making them quite ungainly on land. There are 19 species worldwide. Of these, one species has been recorded in Sri Lanka.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_grebe"
  },
  {
    "id": 2,
    "category": 2,
    "name": "Little Cormorant",
    "sinhala": "පුංචි දියකාවා",
    "scientific": "Phalacrocorax Niger",
    "image": "little_cormorant.jpg",
    "desc": "The little cormorant is a member of the cormorant family of seabirds. Slightly smaller than the Indian cormorant it lacks a peaked head and has a shorter beak.It forages singly or sometimes in loose groups in lowland freshwater bodies, including small ponds, large lakes, streams and sometimes coastal estuaries.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_cormorant"
  },
  {
    "id": 3,
    "category": 2,
    "name": "Indian Cormorant",
    "sinhala": "ඉන්දියානු දියකාවා",
    "scientific": "Phalacrocorax Fuscicollis",
    "image": "indian_cormorant.jpg",
    "desc": "The Indian cormorant or Indian shag is a member of the cormorant family. It is found mainly along the inland waters of the Indian Subcontinent but extending west to Sind and east to Thailand and Cambodia. It is a gregarious species that can be easily distinguished from the similar sized little cormorant by its blue eye, small head with a sloping forehead and a long narrow bill ending in a hooked tip.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_cormorant"
  },
  {
    "id": 4,
    "category": 2,
    "name": "Great Cormorant",
    "sinhala": "මහ දියකාවා",
    "scientific": "Phalacrocorax Carbo Sinensis",
    "image": "great_cormorant.jpg",
    "desc": "The great cormorant, known as the great black cormorant across the Northern Hemisphere, the black cormorant in Australia, the large cormorant in India and the black shag further south in New Zealand, is a widespread member of the cormorant family of seabirds.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_cormorant"
  },
  {
    "id": 5,
    "category": 3,
    "name": "Darter",
    "sinhala": "අභිකාවා",
    "scientific": "Anhinga Melanogaster",
    "image": "darter.jpg",
    "desc": "The darter is a water bird of tropical South Asia and Southeast Asia. It has a long and slender neck with a straight, pointed bill and, like the cormorant, it hunts for fish while its body is submerged in water.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Darter"
  },
  {
    "id": 6,
    "category": 4,
    "name": "Spot-billed Pelican",
    "sinhala": "තිත්හොට පැස්තුඩුවා",
    "scientific": "Pelecanus Philippensis",
    "image": "spot_billed_pelican.jpg",
    "desc": "The spot-billed pelican or grey pelican is a member of the pelican family. It breeds in southern Asia from southern Pakistan across India east to Indonesia. It is a bird of large inland and coastal waters, especially large lakes.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Spot-billed_pelican"
  },
  {
    "id": 7,
    "category": 5,
    "name": "Yellow Bittern",
    "sinhala": "කහ මැටි කොකා",
    "scientific": "Ixobrychus Sinensis",
    "image": "yellow_bittern.jpg",
    "desc": "The yellow bittern is a small bittern. It is of Old World origins, breeding in the northern Indian Subcontinent, east to Japan and Indonesia. It is mainly resident, but some northern birds migrate short distances.",
    "migrant": 1,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow_bittern"
  },
  {
    "id": 8,
    "category": 5,
    "name": "Black Bittern",
    "sinhala": "කළු මැටි කොකා",
    "scientific": "Dupetor Flavicollis Flavicollis",
    "image": "black_bittern.jpg",
    "desc": "The black bittern is a bittern of Old World origin, breeding in tropical Asia from Bangladesh, Pakistan, India, and Sri Lanka east to China, Indonesia, and Australia. It is mainly resident, but some northern birds migrate short distances.",
    "migrant": 1,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black_bittern"
  },
  {
    "id": 9,
    "category": 5,
    "name": "Malayan Night Heron",
    "sinhala": "මලයානු රෑ කොකා",
    "scientific": "Gorsachius melanolophus melanolophus",
    "image": "malayan_night_heron.jpg",
    "desc": "The Malayan night heron, also known as Malaysian night heron and tiger bittern, is a medium-sized heron. It is distributed in southern and eastern Asia.",
    "migrant": 1,
    "endemic": 0,
    "code": "S",
    "wikipedia": "https://en.wikipedia.org/wiki/Malayan_night_heron"
  },
  {
    "id": 10,
    "category": 5,
    "name": "Black-crowned Night Heron",
    "sinhala": "රෑ කොකා",
    "scientific": "Nycticorax Nycticorax Nycticorax",
    "image": "black_crowned_night_heron.jpg",
    "desc": "The black-crowned night heron, or black-capped night heron, commonly shortened to just night heron in Eurasia, is a medium-sized heron found throughout a large part of the world, except in the coldest regions and Australasia.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-crowned_night_heron"
  },
  {
    "id": 11,
    "category": 5,
    "name": "Little Heron",
    "sinhala": "කුඩා පලා කොකා",
    "scientific": "Butorides Striatus Javanicus",
    "image": "little_heron.jpg",
    "desc": "The striated heron also known as mangrove heron, little heron or green-backed heron, is a small heron, about 44 cm tall. Striated herons are mostly non-migratory and noted for some interesting behavioral traits. Their breeding habitat is small wetlands in the Old World tropics from west Africa to Japan and Australia, and in South America.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Striated_heron"
  },
  {
    "id": 12,
    "category": 5,
    "name": "Indian Pond Heron",
    "sinhala": "කණ කොකා",
    "scientific": "Ardeola Grayii Grayii",
    "image": "indian_pond_heron.jpg",
    "desc": "The Indian pond heron or paddybird (Ardeola grayii) is a small heron. It is of Old World origins, breeding in southern Iran and east to Pakistan, India, Burma, Bangladesh and Sri Lanka. They are widespread and common but can be easily missed when they stalk prey at the edge of small water-bodies or even when they roost close to human habitations.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_pond_heron"
  },
  {
    "id": 13,
    "category": 5,
    "name": "Eastern Cattle Egret",
    "sinhala": "ගව කොකා",
    "scientific": "Bubulcus Coromandus",
    "image": "eastern_cattle_egret.jpg",
    "desc": "The eastern cattle egret is a species of heron (family Ardeidae) found in the tropics, subtropics and warm temperate zones. Most taxonomic authorities lump this species and the western cattle egret together as subspecies of the cattle egret, but some (including the International Ornithologists Union) separate them.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Eastern_cattle_egret"
  },
  {
    "id": 14,
    "category": 5,
    "name": "Western Reef Egret",
    "sinhala": "මූදුපර ඇළි කොකා",
    "scientific": "Egretta Gularis Schistacea",
    "image": "western_reef_egret.jpg",
    "desc": "The western reef heron also called the western reef egret, is a medium-sized heron found in southern Europe, Africa and parts of Asia. It has a mainly coastal distribution and occurs in several plumage forms: a slaty-grey plumage in which it can only be confused with the rather uncommon dark morph of the Little Egret (Egretta garzetta); a white form which can look very similar to the little egret although the bill tends to be paler and larger and the black form with white throat E. g. gularis of West Africa.",
    "migrant": 1,
    "endemic": 0,
    "code": "S",
    "wikipedia": "https://en.wikipedia.org/wiki/Western_reef_heron"
  },
  {
    "id": 15,
    "category": 5,
    "name": "Little Egret",
    "sinhala": "පුංචි ඇළි කොකා",
    "scientific": "Egretta Garzetta Garzetta",
    "image": "little_egret.jpg",
    "desc": "The little egret is a species of small heron in the family Ardeidae. The genus name comes from the Provençal French Aigrette, egret, a diminutive of Aigron, heron. The species epithet garzetta is from the Italian name for this bird, garzetta or sgarzetta. It is a white bird with a slender black beak, long black legs and, in the western race, yellow feet.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_egret"
  },
  {
    "id": 16,
    "category": 5,
    "name": "Intermediate Egret",
    "sinhala": "සුදු මැදි කොකා",
    "scientific": "Mesophoyx Intermedia Intermedia",
    "image": "intermediate_egret.jpg",
    "desc": "The intermediate egret, median egret, smaller egret, or yellow-billed egret (Ardea intermedia) is a medium-sized heron. Some taxonomists put the species in the genus Egretta or Mesophoyx. It is a resident breeder from east Africa across the Indian subcontinent to Southeast Asia and Australia.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Intermediate_egret"
  },
  {
    "id": 17,
    "category": 5,
    "name": "Great Egret",
    "sinhala": "මහ සුදු කොකා",
    "scientific": "Casmerodius Alba",
    "image": "great_egret.jpg",
    "desc": "The great egret, also known as the common egret, large egret, or great white egret or great white heron is a large, widely distributed egret, with four subspecies found in Asia, Africa, the Americas, and southern Europe.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_egret"
  },
  {
    "id": 18,
    "category": 5,
    "name": "Grey Heron",
    "sinhala": "අළු කොකා",
    "scientific": "Ardea cinerea cinerea",
    "image": "grey_heron.jpg",
    "desc": "The grey heron is a wading bird of the heron family Ardeidae, native throughout temperate Europe and Asia and also parts of Africa. It is resident in the milder south and west, but many birds retreat in winter from the ice in colder regions.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey_heron"
  },
  {
    "id": 19,
    "category": 5,
    "name": "Purple Heron",
    "sinhala": "කරවැල් කොකා",
    "scientific": "Ardea Purpurea Manilensis",
    "image": "purple_heron.jpg",
    "desc": "The purple heron is a wide-ranging species of wading bird in the heron family, Ardeidae. The scientific name comes from Latin ardea heron, and purpureus, coloured purple. It breeds in Africa, central and southern Europe, and southern and eastern Asia.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Purple_heron"
  },
  {
    "id": 20,
    "category": 6,
    "name": "Painted Stork",
    "sinhala": "ලතුවැකියා",
    "scientific": "Mycteria Leucocephala",
    "image": "painted_stork.jpg",
    "desc": "The painted stork is a large wader in the stork family. It is found in the wetlands of the plains of tropical Asia south of the Himalayas in the Indian Subcontinent and extending into Southeast Asia. Their distinctive pink tertial feathers of the adults give them their name. They forage in flocks in shallow waters along rivers or lakes. They immerse their half open beaks in water and sweep them from side to side and snap up their prey of small fish that are sensed by touch.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Painted_stork"
  },
  {
    "id": 21,
    "category": 6,
    "name": "Asian Openbill",
    "sinhala": "ආසියා විවරතුඩුවා",
    "scientific": "Anastomus oscitans",
    "image": "asian_openbill.jpg",
    "desc": "The Asian openbill or Asian openbill stork is a large wading bird in the stork family Ciconiidae. This distinctive stork is found mainly in the Indian subcontinent and Southeast Asia. It is greyish or white with glossy black wings and tail and the adults have a gap between the arched upper mandible and recurved lower mandible.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Asian_openbill"
  },
  {
    "id": 22,
    "category": 6,
    "name": "Woolly-necked Stork",
    "sinhala": "පාදිලි මානාවා",
    "scientific": "Ciconia Episcopus Episcopus",
    "image": "woolly_necked_stork.jpg",
    "desc": "The woolly-necked stork or whitenecked stork is a large wading bird in the stork family Ciconiidae. It breeds singly, or in small loose colonies. It is distributed in a wide variety of habitats including marshes in forests, agricultural areas, and freshwater wetlands.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Woolly-necked_stork"
  },
  {
    "id": 23,
    "category": 6,
    "name": "Black-Necked Stork",
    "sinhala": "අලි මානාවා",
    "scientific": "Ephippiorhynchus Asiaticus Asiaticus",
    "image": "black_necked_stork.jpg",
    "desc": "The black-necked stork is a tall long-necked wading bird in the stork family. It is a resident species across the Indian Subcontinent and Southeast Asia with a disjunct population in Australia. It lives in wetland habitats and certain crops such as rice and wheat where it forages for a wide range of animal prey.",
    "migrant": 0,
    "endemic": 0,
    "code": "HSR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-necked_stork"
  },
  {
    "id": 24,
    "category": 6,
    "name": "Lesser Adjutant",
    "sinhala": "හීන් බහුරු මානාවා",
    "scientific": "Leptoptilos Javanicus",
    "image": "lesser_adjutant.jpg",
    "desc": "The lesser adjutant is a large wading bird in the stork family Ciconiidae. Like other members of its genus, it has a bare neck and head. It is however more closely associated with wetland habitats where it is solitary and is less likely to scavenge than the related greater adjutant. It is a widespread species found from India through Southeast Asia to Java.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_adjutant"
  },
  {
    "id": 25,
    "category": 7,
    "name": "Glossy Ibis",
    "sinhala": "සිලුටු දෑතුඩුවා",
    "scientific": "Plegadis falcinellus falcinellus",
    "image": "glossy_ibis.jpg",
    "desc": "The glossy ibis is a wading bird in the ibis family Threskiornithidae. The scientific name derives from Ancient Greek plegados and Latin, falcis, both meaning sickle and referring to the distinctive shape of the bill.",
    "migrant": 1,
    "endemic": 0,
    "code": "S",
    "wikipedia": "https://en.wikipedia.org/wiki/Glossy_ibis"
  },
  {
    "id": 26,
    "category": 7,
    "name": "Black-Headed Ibis",
    "sinhala": "සුදු දෑතුඩුවා",
    "scientific": "Threskiornis melanocephalus",
    "image": "black_headed_ibis.jpg",
    "desc": "The black-headed ibis, also known as the Oriental white ibis, Indian white ibis, and black-necked ibis, is a species of wading bird of the ibis family Threskiornithidae which breeds in the South- and Southeast Asia from India to the west and as far east as Japan.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-headed_ibis"
  },
  {
    "id": 27,
    "category": 7,
    "name": "Eurasian Spoonbill",
    "sinhala": "යුරාසියා හැඳිඅලවා",
    "scientific": "Platalea Leucorodia Leucorodia",
    "image": "eurasian_spoonbill.jpg",
    "desc": "The Eurasian spoonbill or common spoonbill is a wading bird of the ibis and spoonbill family Threskiornithidae. The genus name Platalea is from Latin and means broad, referring to the distinctive shape of the bill, and leucorodia is from Ancient Greek leukerodios spoonbill, itself derived from leukos, white and erodios heron.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_spoonbill"
  },
  {
    "id": 28,
    "category": 8,
    "name": "Greater Flamingo",
    "sinhala": "රජ සියක්කාරයෝ",
    "scientific": "Phoenicopterus Ruber Roseus",
    "image": "greater_flamingo.jpg",
    "desc": "The greater flamingo is the most widespread and largest species of the flamingo family. It is found in Africa, on the Indian subcontinent, in the Middle East, and in southern Europe.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_flamingo"
  },
  {
    "id": 29,
    "category": 9,
    "name": "Lesser Whistling-Duck",
    "sinhala": "කුඩා තඹ සේරුවා",
    "scientific": "Dendrocygna Javanica",
    "image": "lesser_whistling_duck.jpg",
    "desc": "The lesser whistling duck, also known as Indian whistling duck or lesser whistling teal, is a species of whistling duck that breeds in the Indian subcontinent and Southeast Asia. They are nocturnal feeders that during the day may be found in flocks around lakes and wet paddy fields. They can perch on trees and sometimes build their nest in the hollow of a tree.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_whistling_duck"
  },
  {
    "id": 30,
    "category": 9,
    "name": "Cotton Pygmy-Goose",
    "sinhala": "මල් සේරුවා",
    "scientific": "Nettapus Coromandelianus Coromandelianus",
    "image": "cotton_pygmy_goose.jpg",
    "desc": "The cotton pygmy goose or cotton teal is a small perching duck which breeds in Pakistan, India, Bangladesh, Southeast Asia and south to Queensland. Small individuals of this species are the smallest waterfowl on earth, at as little as 160 g (5.6 oz) and 26 cm (10 in). The goose-like bill is short and deep at the base. The head is rounded and the legs are short. The plumage is mostly white.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Cotton_pygmy_goose"
  },
  {
    "id": 31,
    "category": 9,
    "name": "Eurasian Wigeon",
    "sinhala": "විජානිය සේරුවා",
    "scientific": "Anas Penelope",
    "image": "eurasian_wigeon.jpg",
    "desc": "The Eurasian wigeon, also known as widgeon is one of three species of wigeon in the dabbling duck genus Mareca. It is common and widespread within its range. This dabbling duck is 42–52 cm (17–20 in) long with a 71–80 cm (28–31 in) wingspan, and a weight of 500–1,073 g (1.102–2.366 lb). The breeding male has grey flanks and back, with a black rear end, a dark green speculum and a brilliant white patch on upper wings, obvious in flight or at rest. It has a pink breast, white belly, and a chestnut head with a creamy crown. In non-breeding (eclipse) plumage, the drake looks more like the female. The female is light brown, with plumage much like a female American wigeon. It can be distinguished from most other ducks, apart from American wigeon, on shape. However, that species has a paler head and white axillaries on its underwing. The female can be a rufous morph with a redder head, and a gray morph with a more gray head.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_wigeon"
  },
  {
    "id": 32,
    "category": 9,
    "name": "Common Teal",
    "sinhala": "යුරෝපීය සේරුවා",
    "scientific": "Anas Crecca Crecca",
    "image": "common_teal.jpg",
    "desc": "The Eurasian teal or common teal is a common and widespread duck which breeds in temperate Eurasia and migrates south in winter. The Eurasian teal is often called simply the teal due to being the only one of these small dabbling ducks in much of its range. The bird gives its name to the blue-green colour teal.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_teal"
  },
  {
    "id": 33,
    "category": 9,
    "name": "Spot-Billed Duck",
    "sinhala": "තිත් හොට සේරුවා",
    "scientific": "Anas Poecilorhyncha Poecilorhyncha",
    "image": "spot_billed_duck.jpg",
    "desc": "The Indian spot-billed duck is a large dabbling duck that is a non-migratory breeding duck throughout freshwater wetlands in the Indian subcontinent. The name is derived from the red spot at the base of the bill that is found in the mainland Indian population. When in water it can be recognized from a long distance by the white tertials that form a stripe on the side, and in flight it is distinguished by the green speculum with a broad white band at the base.",
    "migrant": 1,
    "endemic": 0,
    "code": "SHRM",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_spot-billed_duck"
  },
  {
    "id": 34,
    "category": 9,
    "name": "Northern Pintail",
    "sinhala": "උතුරු උල්පෙඳ සේරුවා",
    "scientific": "Anas Acuta Acuta",
    "image": "northern_pintail.jpg",
    "desc": "The pintail or northern pintail is a duck with wide geographic distribution that breeds in the northern areas of Europe, Asia and North America. It is migratory and winters south of its breeding range to the equator. Unusually for a bird with such a large range, it has no geographical subspecies if the possibly conspecific duck Eaton's pintail is considered to be a separate species.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Northern_pintail"
  },
  {
    "id": 35,
    "category": 9,
    "name": "Garganey",
    "sinhala": "ගාගනී සේරුවා",
    "scientific": "Anas Querquedula",
    "image": "garganey.jpg",
    "desc": "The garganey is a small dabbling duck. It breeds in much of Europe and western Asia, but is strictly migratory, with the entire population moving to southern Africa, India (in particular Santragachi), and Australasia in winter, where large flocks can occur. This species was first described by Linnaeus in 1758. Like other small ducks such as the common teal, this species rises easily from the water with a fast twisting wader-like flight.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Garganey"
  },
  {
    "id": 36,
    "category": 9,
    "name": "Northern Shoveller",
    "sinhala": "උතුරු ශවල සේරුවා",
    "scientific": "Anas Clypeata",
    "image": "northern_shoveller.jpg",
    "desc": "The northern shoveler, known simply in Britain as the shoveler, is a common and widespread duck. It breeds in northern areas of Europe and Asia and across most of North America, wintering in southern Europe, Africa, the Indian subcontinent, Southeast Asia, and Central, and northern South America. It is a rare vagrant to Australia. In North America, it breeds along the southern edge of Hudson Bay and west of this body of water, and as far south as the Great Lakes west to Colorado, Nevada, and Oregon.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Northern_shoveler"
  },
  {
    "id": 37,
    "category": 9,
    "name": "Tufted Duck",
    "sinhala": "කුඩුම්බි මඩ සේරුවා",
    "scientific": "Aythya Fuligula",
    "image": "tufted_duck.jpg",
    "desc": "The tufted duck is a small diving duck with a population of close to one million birds, found in northern Eurasia. The scientific name is derived from Ancient Greek aithuia an unidentified seabird mentioned by authors including Hesychius and Aristotle, and Latin, fuligo 'soot' and gula 'throat'.",
    "migrant": 0,
    "endemic": 0,
    "code": "",
    "wikipedia": "https://en.wikipedia.org/wiki/Tufted_duck"
  },
  {
    "id": 38,
    "category": 10,
    "name": "Oriental Honey-Buzzard",
    "sinhala": "සිලුවැති බඹරුකුස්සා",
    "scientific": "Pernis Ptilorhynchus Orientails",
    "image": "oriental_honey_buzzard.jpg",
    "desc": "The crested honey buzzard is a bird of prey in the family Accipitridae, which also includes many other diurnal raptors such as kites, eagles, and harriers. This species is also known as the Oriental honey buzzard.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Crested_honey_buzzard"
  },
  {
    "id": 39,
    "category": 10,
    "name": "Oriental Honey-Buzzard(Indian)",
    "sinhala": "සිලුවැති බඹරඋකුස්සා",
    "scientific": "Pernis Ptilorhynchus Ruficollis",
    "image": "oriental_honey_buzzard_ind.jpg",
    "desc": "The crested honey buzzard is a bird of prey in the family Accipitridae, which also includes many other diurnal raptors such as kites, eagles, and harriers. This species is also known as the Oriental honey buzzard.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Crested_honey_buzzard"
  },
  {
    "id": 40,
    "category": 10,
    "name": "Black-Shouldered Kite",
    "sinhala": "උරිස් කළු පතනුඋකුස්සා",
    "scientific": "Elanus Caeruleus Vociferus",
    "image": "black_shouldered_kite.jpg",
    "desc": "The black-shouldered kite, also known as the Australian black-shouldered kite, is a small raptor found in open habitat throughout Australia. It resembles similar species found in Africa, Eurasia and North America, including the black-winged kite, a species that has in the past also been called 'black-shouldered kite'. Measuring around 35 cm (14 in) in length with a wingspan of 80–100 cm (31–39 in), the adult black-shouldered kite has predominantly grey-white plumage and prominent black markings above its red eyes.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-shouldered_kite"
  },
  {
    "id": 41,
    "category": 10,
    "name": "Black Kite",
    "sinhala": "බොර පරඋකුස්සා",
    "scientific": "Milvus Migrans Govinda",
    "image": "black_kite.jpg",
    "desc": "The black kite is a medium-sized bird of prey in the family Accipitridae, which also includes many other diurnal raptors. It is thought to be the world's most abundant species of Accipitridae, although some populations have experienced dramatic declines or fluctuations. Current global population estimates run up to 6 million individuals. Unlike others of the group, black kites are opportunistic hunters and are more likely to scavenge. They spend a lot of time soaring and gliding in thermals in search of food.",
    "migrant": 1,
    "endemic": 0,
    "code": "SRM",
    "wikipedia": "https://en.wikipedia.org/wiki/Black_kite"
  },
  {
    "id": 42,
    "category": 10,
    "name": "Brahminy Kite",
    "sinhala": "බමුණු පියාඋකුස්සා",
    "scientific": "Haliastur Indus Indus",
    "image": "brahminy_kite.jpg",
    "desc": "The brahminy kite, also known as the red-backed sea-eagle in Australia, is a medium-sized bird of prey in the family Accipitridae, which also includes many other diurnal raptors, such as eagles, buzzards, and harriers. They are found in the Indian subcontinent, Southeast Asia, and Australia. They are found mainly on the coast and in inland wetlands, where they feed on dead fish and other prey. Adults have a reddish-brown body plumage contrasting with their white head and breast which make them easy to distinguish from other birds of prey.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Brahminy_kite"
  },
  {
    "id": 43,
    "category": 10,
    "name": "White-Bellied Sea Eagle",
    "sinhala": "සේතෝදර මූදු රාජාලියා",
    "scientific": "Haliaeetus Leucogaster",
    "image": "white_bellied_sea_eagle.jpg",
    "desc": "The white-bellied sea eagle, also known as the white-breasted sea eagle, is a large diurnal bird of prey in the family Accipitridae. Resident from India and Sri Lanka through Southeast Asia to Australia on coasts and major waterways, the white-bellied sea eagle breeds and hunts near water, and fish form around half of its diet. Opportunistic, it consumes carrion and a wide variety of animals.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/White-bellied_sea_eagle"
  },
  {
    "id": 44,
    "category": 10,
    "name": "Grey-headed Fish Eagle",
    "sinhala": "රජ අළුහිස් මසුඋකුස්සා",
    "scientific": "Icthyophaga Icthyaetus",
    "image": "grey_headed_fish_eagle.jpg",
    "desc": "The grey-headed fish eagle is a fish-eating bird of prey from South East Asia. It is a large stocky raptor with adults having dark brown upper body, grey head and lighter underbelly and white legs. Juveniles are paler with darker streaking. It is often confused with the lesser fish eagle (Haliaeetus humilis) and the Pallas's fish eagle. The lesser fish eagle is similar in plumage but smaller and the Pallas’s fish eagle shares the same habitat and feeding behaviour but is larger with longer wings and darker underparts. Is often called tank eagle in Sri Lanka due to its fondness for irrigation tanks.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey-headed_fish_eagle"
  },
  {
    "id": 45,
    "category": 10,
    "name": "Crested Serpent Eagle",
    "sinhala": "සිළු සරපඋකුස්සා",
    "scientific": "Spilornis Cheela Spilogaster",
    "image": "crested_serpent_eagle.jpg",
    "desc": "The crested serpent eagle is a medium-sized bird of prey that is found in forested habitats across tropical Asia. Within its widespread range across the Indian Subcontinent, Southeast Asia and East Asia, there are considerable variations and some authorities prefer to treat several of its subspecies as completely separate species.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Crested_serpent_eagle"
  },
  {
    "id": 46,
    "category": 10,
    "name": "Pallid Harrier",
    "sinhala": "සුදුමැලි හැරිඋකුස්සා",
    "scientific": "Circus Macrourus",
    "image": "pallid_harrier.jpg",
    "desc": "The pale or pallid harrier is a migratory bird of prey of the harrier family. The scientific name is derived from the Ancient Greek. It breeds in southern parts of eastern Europe and central Asia (such as Iran) and winters mainly in India and southeast Asia. It is a very rare vagrant to Great Britain and western Europe.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Pallid_harrier"
  },
  {
    "id": 47,
    "category": 10,
    "name": "Shikra",
    "sinhala": "කුරුළුගොයා",
    "scientific": "Accipiter Badius Badius",
    "image": "shikra.jpg",
    "desc": "The shikra is a small bird of prey in the family Accipitridae found widely distributed in Asia and Africa where it is also called the little banded goshawk. The African forms may represent a separate species but have usually been considered as subspecies of the shikra. The shikra is very similar in appearance to other sparrowhawk species including the Chinese goshawk and Eurasian sparrowhawk. They have a sharp two note call and have the typical flap and glide flight. Their calls are imitated by drongos and the common hawk-cuckoo resembles it in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Shikra"
  },
  {
    "id": 48,
    "category": 10,
    "name": "Common Buzzard",
    "sinhala": "යුරාසියා ලැසි උකුස්සා",
    "scientific": "Buteo Buteo Japonicus",
    "image": "common_buzzard.jpg",
    "desc": "The common buzzard is a medium-to-large bird of prey whose range covers most of Europe and extends into Asia. Over much of its range, it is resident year-round, but birds from the colder parts of the Northern Hemisphere typically migrate south (some well into the Southern Hemisphere) for the northern winter.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_buzzard"
  },
  {
    "id": 49,
    "category": 10,
    "name": "Black Eagle",
    "sinhala": "කළු උකුස්සා",
    "scientific": "Ictinaetus Malayensis Perniger",
    "image": "black_eagle.jpg",
    "desc": "The black eagle is a bird of prey. Like all eagles, it is in the family Accipitridae, and is the only member of the genus Ictinaetus. They soar over forests in the hilly regions of tropical and subtropical South and Southeast Asia, as well as southeastern China. They hunt mammals and birds, particularly at their nests. They are easily identified by their widely splayed and long primary 'fingers', the characteristic silhouette, slow flight and yellow ceres and legs that contrast with their dark feathers.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Black_eagle"
  },
  {
    "id": 50,
    "category": 10,
    "name": "Crested Hawk Eagle",
    "sinhala": "පෙරළි කොන්ඩ උකුස්සා",
    "scientific": "Spizaetus Cirrhatus Ceylanensis",
    "image": "crested_hawk_eagle.jpg",
    "desc": "The changeable hawk-eagle or crested hawk-eagle is a bird of prey species of the family Accipitridae. It was formerly placed in the genus Spizaetus, but studies pointed to the group being paraphyletic resulting in the Old World members being placed in Nisaetus (Hodgson, 1836) and separated from the New World species.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Changeable_hawk-eagle"
  },
  {
    "id": 51,
    "category": 10,
    "name": "Mountain Hawk Eagle",
    "sinhala": "හෙල් කොණ්ඩ උකුස්සා",
    "scientific": "Spizaetus Nipalensis Kelaarti",
    "image": "mountain_hawk_eagle.jpg",
    "desc": "The mountain hawk-eagle or Hodgson's hawk-eagle (Nisaetus nipalensis, earlier treated under Spizaetus) is a bird of prey. Like all eagles, it is in the family Accipitridae. It breeds in the Indian subcontinent, from India, Nepal (hence the epithet nipalensis) through Bangladesh to Thailand, Taiwan, Indonesia and Japan.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Mountain_hawk-eagle"
  },
  {
    "id": 52,
    "category": 11,
    "name": "Common Kestrel",
    "sinhala": "පරි සාරිඋකුස්සා",
    "scientific": "Falco Tinnunculus Tinnunculus",
    "image": "common_kestrel.jpg",
    "desc": "The common kestrel is a bird of prey species belonging to the kestrel group of the falcon family Falconidae. It is also known as the European kestrel, Eurasian kestrel, or Old World kestrel. In Britain, where no other kestrel species occurs, it is generally just called 'the kestrel'.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_kestrel"
  },
  {
    "id": 53,
    "category": 12,
    "name": "Grey Francolin",
    "sinhala": "අළු වටු-කුකුළා",
    "scientific": "Francolinus Pondicerianus Pondicerianus",
    "image": "grey_francolin.jpg",
    "desc": "The grey francolin is a species of francolin found in the plains and drier parts of the Indian subcontinent. This species was formerly also called the grey partridge, not to be confused with the European grey partridge. They are found in open cultivated lands as well as scrub forest and their local name of teetar is based on their calls, a loud and repeated Ka-tee-tar...tee-tar which is produced by one or more birds. The term teetar can also refer to other partridges and quails. During the breeding season calling males attract challengers and decoys were used to trap these birds especially for fighting.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey_francolin"
  },
  {
    "id": 54,
    "category": 12,
    "name": "Ceylon Junglefowl",
    "sinhala": "ශ්‍රී ලංකා වලි-කුකුළා",
    "scientific": "Gallus Lafayettii",
    "image": "ceylon_junglefowl.jpg",
    "desc": "The Sri Lankan junglefowl, also known as the Ceylon junglefowl, is a member of the Galliformes bird order which is endemic to Sri Lanka, where it is the national bird. It is closely related to the red junglefowl (G. gallus), the wild junglefowl from which the chicken was domesticated. The specific name of the Sri Lankan junglefowl commemorates the French aristocrat Gilbert du Motier, marquis de La Fayette.",
    "migrant": 0,
    "endemic": 1,
    "code": "CE",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lankan_junglefowl"
  },
  {
    "id": 55,
    "category": 12,
    "name": "Indian Peafowl",
    "sinhala": "මොනරා",
    "scientific": "Pavo Cristatus",
    "image": "indian_peafowl.jpg",
    "desc": "The Indian peafowl or blue peafowl, a large and brightly coloured bird, is a species of peafowl native to South Asia, but introduced in many other parts of the world. The male, or peacock, is predominantly blue with a fan-like crest of spatula-tipped wire-like feathers and is best known for the long train made up of elongated upper-tail covert feathers which bear colourful eyespots. These stiff feathers are raised into a fan and quivered in a display during courtship. Despite the length and size of these covert feathers, peacocks are still capable of flight.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_peafowl"
  },
  {
    "id": 56,
    "category": 13,
    "name": "Barred Buttonquail",
    "sinhala": "බෝල වටුයුරුවා",
    "scientific": "Turnix Suscitator Leggei",
    "image": "barred_buttonquail.jpg",
    "desc": "The barred buttonquail or common bustard-quail is a buttonquail, one of a small family of birds which resemble, but are unrelated to, the true quails. This species is resident from India across tropical Asia to south China, Indonesia and the Philippines.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Barred_buttonquail"
  },
  {
    "id": 57,
    "category": 14,
    "name": "White-Breasted Waterhen",
    "sinhala": "ළය සුදු කොරවක්කා",
    "scientific": "Amaurornis phoenicurus phoenicurus",
    "image": "white_breasted_waterhen.jpg",
    "desc": "The white-breasted waterhen is a waterbird of the rail and crake family, Rallidae, that is widely distributed across South and Southeast Asia. They are dark slaty birds with a clean white face, breast and belly. They are somewhat bolder than most other rails and are often seen stepping slowly with their tail cocked upright in open marshes or even drains near busy roads. They are largely crepuscular in activity and during the breeding season, just after the first rains, make loud and repetitive croaking calls.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/White-breasted_waterhen"
  },
  {
    "id": 58,
    "category": 14,
    "name": "Common Moorhen",
    "sinhala": "පොදු ගැලිනුවා",
    "scientific": "Gallinula Chloropus Indica",
    "image": "common_moorhen.jpg",
    "desc": "The common moorhen (also known as the waterhen and as the swamp chicken) is a bird species in the family Rallidae. It is distributed across many parts of the Old World. The common moorhen lives around well-vegetated marshes, ponds, canals and other wetlands. The species is not found in the polar regions or many tropical rainforests.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_moorhen"
  },
  {
    "id": 59,
    "category": 14,
    "name": "Purple Swamphen",
    "sinhala": "පොදු දම් කිතලා",
    "scientific": "Porphyrio Porphyrio Poliocephalus",
    "image": "purple_swamphen.jpg",
    "desc": "The western swamphen is a swamphen in the rail family Rallidae, one of the six species of purple swamphen. From the French name talève sultane, it is also known as the sultana bird. This chicken-sized bird, with its large feet, bright plumage and red bill and frontal shield is easily recognisable in its native range. It used to be considered the nominate subspecies of the purple swamphen. It is found on the Iberian Peninsula, in France, Sardinia and western North Africa to Tunisia.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Western_swamphen"
  },
  {
    "id": 60,
    "category": 14,
    "name": "Watercock",
    "sinhala": "කෝරා",
    "scientific": "Gallicrex Cinerea Cinerea",
    "image": "watercock.jpg",
    "desc": "The watercock is a waterbird in the rail and crake family, Rallidae. It is the only member of the genus Gallicrex. Traditionally held to be closely related to moorhens (which the adult male visually closely resembles), it is actually member of a mostly tropical Asian clade containing also Aenigmatolimnas, Amaurornis, Himantornis and Megacrex.",
    "migrant": 1,
    "endemic": 0,
    "code": "URSM",
    "wikipedia": "https://en.wikipedia.org/wiki/Watercock"
  },
  {
    "id": 61,
    "category": 14,
    "name": "Common Coot",
    "sinhala": "පොදු කළු කිතලා",
    "scientific": "Fulica Atra Atra",
    "image": "common_coot.jpg",
    "desc": "The Eurasian coot, also known as the common coot, is a member of the rail and crake bird family, the Rallidae. The scientific name is from Latin; Fulica is 'coot', and atra is 'black'. It is found in Europe, Asia, Australia and parts of Africa. The Australian subspecies is known as the Australian coot.",
    "migrant": 1,
    "endemic": 0,
    "code": "URSM",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_coot"
  },
  {
    "id": 62,
    "category": 15,
    "name": "Pheasant-Tailed Jacana",
    "sinhala": "සැවුල් පෙඳ දියසෑනා",
    "scientific": "Hydrophasianus Chirurgus",
    "image": "pheasant_tailed_jacana.jpg",
    "desc": "The pheasant-tailed jacana is a jacana in the monotypic genus Hydrophasianus. Jacanas are a group of waders in the family Jacanidae that are identifiable by their wide feet and claws which enable them to walk on floating vegetation in shallow lakes, their preferred habitat. The pheasant-tailed jacana is capable of swimming, although it usually walks on the vegetation. The females are more colourful than the males and are polyandrous.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Pheasant-tailed_jacana"
  },
  {
    "id": 63,
    "category": 16,
    "name": "Greater Painted Snipe",
    "sinhala": "රජ උලු කැස්වටුවා",
    "scientific": "Rostratula Benghalensis Benghalensis",
    "image": "greater_painted_snipe.jpg",
    "desc": "The greater painted-snipe is a species of wader in the family Rostratulidae. It is found in marshes in Africa, South Asia and South-east Asia. Medium-sized, plump wading bird. Long reddish-brown bill, slightly decurved at tip, and distinct white or pinkish eye patch. Rounded, buff-spotted wings and short tail. White of breast extends up around top of folded wing. The painted-snipe is not related to the true snipes and differs from them in habits, flight and appearance, being far more colorful and having longer legs than the snipes.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_painted-snipe"
  },
  {
    "id": 64,
    "category": 17,
    "name": "Eurasian Oystercatcher",
    "sinhala": "ආසියා බොලුගුල්ලා",
    "scientific": "Haematopus Ostralegus Longipes",
    "image": "eurasian_oystercatcher.jpg",
    "desc": "The Eurasian oystercatcher also known as the common pied oystercatcher, or palaearctic oystercatcher, or (in Europe) just oystercatcher, is a wader in the oystercatcher bird family Haematopodidae. It is the most widespread of the oystercatchers, with three races breeding in western Europe, central Eurasia, Kamchatka, China, and the western coast of Korea. No other oystercatcher occurs within this area.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_oystercatcher"
  },
  {
    "id": 65,
    "category": 18,
    "name": "Black-winged Stilt",
    "sinhala": "කළුපිය ඉපල්පාවා",
    "scientific": "Himantopus Himantopus Himantopus",
    "image": "black_winged_stilt.jpg",
    "desc": "The black-winged stilt is a widely distributed very long-legged wader in the avocet and stilt family. Adults are 33–36 cm (13–14 in) long. They have long pink legs, a long thin black bill and are blackish above and white below, with a white head and neck with a varying amount of black. Males have a black back, often with greenish gloss. Females' backs have a brown hue, contrasting with the black remiges.",
    "migrant": 1,
    "endemic": 0,
    "code": "CRM",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-winged_stilt"
  },
  {
    "id": 66,
    "category": 19,
    "name": "Indian Thick-Knee",
    "sinhala": "යුරාසියා ගොළුකිරළුවා",
    "scientific": "Burhinus Indicus",
    "image": "indian_thick_knee.jpg",
    "desc": "The Indian stone-curlew or Indian thick-knee is a species of bird in the family Burhinidae. It was formerly included as a subspecies of the Eurasian stone-curlew. This species is found in the plains of India, Pakistan, Nepal and Sri Lanka. They have large eyes and are brown with streaks and pale marks making it hard to spot against the background of soils and rocks. Mostly active in the dark, they produce calls similar to the true curlews, giving them their names.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_stone-curlew"
  },
  {
    "id": 67,
    "category": 19,
    "name": "Great Thick-Knee",
    "sinhala": "මහ ගොළුකිරළුවා",
    "scientific": "Esacus Recurvirostris",
    "image": "great_thick_knee.jpg",
    "desc": "The great stone-curlew or great thick-knee is a large wader which is a resident breeder in tropical southern Asia from India, Pakistan, Sri Lanka, Bangladesh[2] into South-east Asia. This species prefers gravel banks along rivers or large lakes, and also beaches. A single egg is laid in a bare scrape on the open shingle.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_stone-curlew"
  },
  {
    "id": 68,
    "category": 20,
    "name": "Small Pratincole",
    "sinhala": "පුංචි ජවසැරියා",
    "scientific": "Glareola Lactea",
    "image": "small_pratincole.jpg",
    "desc": "The small pratincole, little pratincole, or small Indian pratincole, is a small wader in the pratincole family, Glareolidae. The small pratincole is a resident breeder in India, Western Pakistan, Bangladesh, Burma, Laos, Cambodia, Sri Lanka and Thailand. It breeds from December to March on gravel or sand banks near rivers and lakes, laying 2-4 eggs in a ground scrape.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Small_pratincole"
  },
  {
    "id": 69,
    "category": 21,
    "name": "Little Ringed Plover",
    "sinhala": "පුංචි මාල ඔලෙවියා",
    "scientific": "Charadrius Dubius",
    "image": "little_ringed_plover.jpg",
    "desc": "The little ringed plover is a small plover. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in river valleys (kharadra, 'ravine'). The specific dubius is Latin for doubtful, since Sonnerat, writing in 1776, thought this bird might be just a variant of common ringed plover.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_ringed_plover"
  },
  {
    "id": 70,
    "category": 21,
    "name": "Common Ringed Plover",
    "sinhala": "පොදු මාල ඔලෙවියා",
    "scientific": "Charadrius Hiaticula Tundrae",
    "image": "common_ringed_plover.jpg",
    "desc": "The common ringed plover or ringed plover is a small plover that breeds in Arctic Eurasia. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in ravines and river valleys (kharadra, 'ravine'). The specific hiaticula is Latin and has a similar meaning to the Greek term, coming from hiatus, 'cleft' and -cola, 'dweller' (colere, 'to dwell').",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_ringed_plover"
  },
  {
    "id": 71,
    "category": 21,
    "name": "Kentish Plover",
    "sinhala": "කෙන්ටි ඔලෙවියා",
    "scientific": "Charadrius Alexandrinus Alexandrinus",
    "image": "kentish_plover.jpg",
    "desc": "The Kentish plover is a small cosmopolitan shorebird (40-44 g) of the family Charadriidae that breeds on the shores of saline lakes, lagoons, and coasts, populating sand dunes, marshes, semi-arid desert, and tundra. Both male and female birds have pale plumages with a white underside, grey/brown back, dark legs and a dark bill, however additionally the male birds also exhibit very dark incomplete breast bands, and dark markings either side of their head, therefore the Kentish plover is regarded as sexually dimorphic.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Kentish_plover"
  },
  {
    "id": 72,
    "category": 21,
    "name": "Lesser Sand Plover",
    "sinhala": "හීන් වැලි ඔලෙවියා",
    "scientific": "Charadrius Mongolus Atrifrons",
    "image": "lesser_sand_plover.jpg",
    "desc": "The lesser sand plover is a small wader in the plover family of birds. The spelling is commonly given as lesser sand-plover, but the official British Ornithologists' Union spelling is 'lesser sand plover'. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in ravines and river valleys (kharadra, 'ravine'). The specific mongolus is Latin and refers to Mongolia which at the time of naming referred to a larger area than the present country.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_sand_plover"
  },
  {
    "id": 73,
    "category": 21,
    "name": "Greater Sand Plover",
    "sinhala": "රජ වැලි ඔලෙවියා",
    "scientific": "Charadrius Leschenaultii Leschenavitii",
    "image": "greater_sand_plover.jpg",
    "desc": "The greater sand plover is a small wader in the plover family of birds. The spelling is commonly given as 'greater sandplover' or 'greater sand-plover', but the official British Ornithologists' Union spelling is 'Greater Sand Plover'. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in ravines and river valleys (kharadra, 'ravine'). The specific leschenaultii commemorates the French botanist Jean Baptiste Leschenault de la Tour.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_sand_plover"
  },
  {
    "id": 74,
    "category": 21,
    "name": "Caspian Plover",
    "sinhala": "කැස්පියානු ඔලෙවියා",
    "scientific": "Charadrius Asiaticus",
    "image": "caspian_plover.jpg",
    "desc": "The Caspian plover is a wader in the plover family of birds. The genus name Charadrius is a Late Latin word for a yellowish bird mentioned in the fourth-century Vulgate. It derives from Ancient Greek kharadrios a bird found in ravines and river valleys (kharadra, 'ravine'). The specific asiaticus is Latin and means 'Asian', although in binomials it usually means the type locality was India.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Caspian_plover"
  },
  {
    "id": 75,
    "category": 21,
    "name": "Pacific Golden Plover",
    "sinhala": "සෙත්කර රන්මහ ඔලෙවියා",
    "scientific": "Pluvialis Fulva",
    "image": "pacific_golden_plover.jpg",
    "desc": "The Pacific golden plover is a medium-sized plover. The genus name is Latin and means relating to rain, from pluvia, 'rain'. It was believed that golden plovers flocked when rain was imminent. The species name fulva is Latin and refers to a tawny colour. The 23–26 cm long breeding adult is spotted gold and black on the crown, and back on the wings. Its face and neck are black with a white border, and it has a black breast and a dark rump. The legs are black. In winter, the black is lost and the plover then has a yellowish face and breast, and white underparts.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Pacific_golden_plover"
  },
  {
    "id": 76,
    "category": 21,
    "name": "Grey Plover",
    "sinhala": "අළු මහ ඔලෙවියා",
    "scientific": "Pluvialis Squatarola",
    "image": "grey_plover.jpg",
    "desc": "The grey plover, known as the black-bellied plover in North America, is a medium-sized plover breeding in Arctic regions. It is a long-distance migrant, with a nearly worldwide coastal distribution when not breeding. The genus name is Latin and means relating to rain, from pluvia, 'rain'. It was believed that golden plovers flocked when rain was imminent. The species name squatarola is a Latinised version of Sgatarola, a Venetian name for some kind of plover.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey_plover"
  },
  {
    "id": 77,
    "category": 21,
    "name": "Yellow-Wattled Lapwing",
    "sinhala": "කහ යටිමල් කිරලා",
    "scientific": "Vanellus Malabaricus",
    "image": "yellow_wattled_lapwing.jpg",
    "desc": "The yellow-wattled lapwing is a lapwing that is endemic to the Indian Subcontinent. It is found mainly on the dry plains of peninsular India and has a sharp call and is capable of fast flight. Although they do not migrate, they are known to make seasonal movements in response to rains. They are dull grey brown with a black cap, yellow legs and a triangular wattle at the base of the beak. Like other lapwings and plovers, they are ground birds and their nest is a mere collection of tiny pebbles within which their well camouflaged eggs are laid. The chicks are nidifugous, leaving the nest shortly after hatching and following their parents to forage for food.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Yellow-wattled_lapwing"
  },
  {
    "id": 78,
    "category": 21,
    "name": "Red-wattled Lapwing",
    "sinhala": "රත් යටිමල් කිරලා",
    "scientific": "Vanellus Indicus Lankae",
    "image": "red_wattled_lapwing.jpg",
    "desc": "The red-wattled lapwing is an Asian lapwing or large plover, a wader in the family Charadriidae. Like other lapwings they are ground birds that are incapable of perching. Their characteristic loud alarm calls are indicators of human or animal movements and the sounds have been variously rendered as did he do it or pity to do it leading to the colloquial name of did-he-do-it bird. Usually seen in pairs or small groups and usually not far from water they sometimes form large aggregations in the non-breeding season (winter). They nest in a ground scrape laying three to four camouflaged eggs.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Red-wattled_lapwing"
  },
  {
    "id": 79,
    "category": 22,
    "name": "Little Stint",
    "sinhala": "පුංචි හින්නා",
    "scientific": "Calidris Minuta",
    "image": "little_stint.jpg",
    "desc": "The little stint, is a very small wader. It breeds in arctic Europe and Asia, and is a long-distance migrant, wintering south to Africa and south Asia. It occasionally is a vagrant to North America and to Australia. The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. The specific minuta is Latin for 'small'.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_stint"
  },
  {
    "id": 80,
    "category": 22,
    "name": "Great Knot",
    "sinhala": "මහනොට් හින්නා",
    "scientific": "Calidris Tenuirostris",
    "image": "great_knot.jpg",
    "desc": "The great knot is a small wader. It is the largest of the calidrid species. The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. The specific tenuirostris is from Latin tenuis 'slender' and rostrum 'bill'.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Great_knot"
  },
  {
    "id": 81,
    "category": 22,
    "name": "Red Knot",
    "sinhala": "රතුනොට් හින්නා",
    "scientific": "Calidris Canutus Canutus",
    "image": "red_knot.jpg",
    "desc": "The red knot (just knot in English-speaking Europe) is a medium-sized shorebird which breeds in tundra and the Arctic Cordillera in the far north of Canada, Europe, and Russia. It is a large member of the Calidris sandpipers, second only to the great knot. Six subspecies are recognised",
    "migrant": 1,
    "endemic": 0,
    "code": "SHM",
    "wikipedia": "https://en.wikipedia.org/wiki/Red_knot"
  },
  {
    "id": 82,
    "category": 22,
    "name": "Sanderling",
    "sinhala": "වැලිහින්නා",
    "scientific": "Calidris Alba",
    "image": "sanderling.jpg",
    "desc": "The sanderling is a small wading bird. The name derives from Old English sand-yrðling, 'sand-ploughman'.[2] The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. The specific alba is Latin for 'white'.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Sanderling"
  },
  {
    "id": 83,
    "category": 22,
    "name": "Temminck's Stint",
    "sinhala": "ටෙමිංක් හින්නා",
    "scientific": "Calidris Temminckii",
    "image": "temminck_s_stint.jpg",
    "desc": "Temminck's stint is a small wader. This bird's common name and Latin binomial commemorate the Dutch naturalist Coenraad Jacob Temminck. The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. Temminck's stint is one of the species to which the Agreement on the Conservation of African-Eurasian Migratory Waterbirds (AEWA) applies.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Temminck%27s_stint"
  },
  {
    "id": 84,
    "category": 22,
    "name": "Curlew Sandpiper",
    "sinhala": "කාලිකා හින්නා",
    "scientific": "Calidris Ferruginea",
    "image": "curlew_sandpiper.jpg",
    "desc": "The curlew sandpiper is a small wader that breeds on the tundra of Arctic Siberia. The genus name is from Ancient Greek kalidris or skalidris, a term used by Aristotle for some grey-coloured waterside birds. The specific ferruginea is from Latin ferrugo, ferruginis, 'iron rust' referring to its colour in breeding plumage.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Curlew_sandpiper"
  },
  {
    "id": 85,
    "category": 22,
    "name": "Ruff",
    "sinhala": "ලොවිච්චියා",
    "scientific": "Philomachus Pugnax",
    "image": "ruff.jpg",
    "desc": "The ruff is a medium-sized wading bird that breeds in marshes and wet meadows across northern Eurasia. This highly gregarious sandpiper is migratory and sometimes forms huge flocks in its winter grounds, which include southern and western Europe, Africa, southern Asia and Australia.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Ruff"
  },
  {
    "id": 86,
    "category": 22,
    "name": "Pintail Snipe",
    "sinhala": "උල්පෙඳ කැස්වටුවා",
    "scientific": "Gallinago Stenura",
    "image": "pintail_snipe.jpg",
    "desc": "The pin-tailed snipe or pintail snipe is a species of bird in the family Scolopacidae, the sandpipers. It breeds in northern Russia and migrates to spend the non-breeding season in southern Asia from Pakistan to Indonesia. It is the most common migrant snipe in southern India, Sri Lanka and much of Southeast Asia. It is a vagrant to north-western and northern Australia, and to Kenya in East Africa.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Pin-tailed_snipe"
  },
  {
    "id": 87,
    "category": 22,
    "name": "Black-tailed Godwit",
    "sinhala": "කළුපෙඳ ගොහොදුවිත්තා",
    "scientific": "Limosa Limosa",
    "image": "black_tailed_godwit.jpg",
    "desc": "The black-tailed godwit is a large, long-legged, long-billed shorebird first described by Carl Linnaeus in 1758. It is a member of the godwit genus, Limosa. There are three subspecies, all with orange head, neck and chest in breeding plumage and dull grey-brown winter coloration, and distinctive black and white wingbar at all times.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-tailed_godwit"
  },
  {
    "id": 88,
    "category": 22,
    "name": "Bar-tailed Godwit",
    "sinhala": "වයිරපෙඳ  ගොහොදුවිත්තා",
    "scientific": "Limosa Lapponica Lapponica",
    "image": "bar_tailed_godwit.jpg",
    "desc": "The bar-tailed godwit is a large wader in the family Scolopacidae. The genus name Limosa is from Latin and means 'muddy', from limus, 'mud'. The specific lapponica refers to Lapland. The English term 'godwit' was first recorded in about 1416–7 and is believed to imitate the bird's call.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Bar-tailed_godwit"
  },
  {
    "id": 89,
    "category": 22,
    "name": "Whimbrel",
    "sinhala": "විඹුරැළි කාලිකයා",
    "scientific": "Numenius Phaeopus",
    "image": "whimbrel.jpg",
    "desc": "The whimbrel is a wader in the large family Scolopacidae. It is one of the most widespread of the curlews, breeding across much of subarctic North America, Asia and Europe as far south as Scotland. The whimbrel is a migratory bird wintering on coasts in Africa, southern North America, South America, and South Asia into Australasia. It is also a coastal bird during migration. It is fairly gregarious outside the breeding season.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Whimbrel"
  },
  {
    "id": 90,
    "category": 22,
    "name": "Eurasian Curlew",
    "sinhala": "යුරාසියා කාලිකයා",
    "scientific": "Numenius Arquata Orientalis",
    "image": "eurasian_curlew.jpg",
    "desc": "The Eurasian curlew or common curlew is a wader in the large family Scolopacidae. It is one of the most widespread of the curlews, breeding across temperate Europe and Asia. In Europe, this species is often referred to just as the 'curlew', and in Scotland known as the 'whaup' in Scots.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_curlew"
  },
  {
    "id": 91,
    "category": 22,
    "name": "Common Redshank",
    "sinhala": "පොදු රත්පා සිබිල්ලා",
    "scientific": "Tringa Totanus",
    "image": "common_redshank.jpg",
    "desc": "The common redshank or simply redshank is a Eurasian wader in the large family Scolopacidae. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific totanus is from Tótano, the Italian name for this bird.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_redshank"
  },
  {
    "id": 92,
    "category": 22,
    "name": "Marsh Sandpiper",
    "sinhala": "වගුරු සිබිල්ලා",
    "scientific": "Tringa Stagnatilis",
    "image": "marsh_sandpiper.jpg",
    "desc": "The marsh sandpiper is a small wader. It is a rather small shank, and breeds in open grassy steppe and taiga wetlands from easternmost Europe to central Asia. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific stagnatilis is from Latin stagnum, 'swamp'.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Marsh_sandpiper"
  },
  {
    "id": 93,
    "category": 22,
    "name": "Common Greenshank",
    "sinhala": "පොදු පලාපා සිබිල්ලා",
    "scientific": "Tringa Nebularia",
    "image": "common_greenshank.jpg",
    "desc": "The common greenshank is a wader in the large family Scolopacidae, the typical waders. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific nebularia is from Latin nebula 'mist'. Like the Norwegian Skoddefoll, this refers to the greenshank's damp marshy habitat.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_greenshank"
  },
  {
    "id": 94,
    "category": 22,
    "name": "Green Sandpiper",
    "sinhala": "කොළ සිබිල්ලා",
    "scientific": "Tringa Ochropus",
    "image": "green_sandpiper.jpg",
    "desc": "The green sandpiper is a small wader (shorebird) of the Old World. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific ochropus is from Ancient Greek okhros, 'ochre', and pous, 'foot'.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Green_sandpiper"
  },
  {
    "id": 95,
    "category": 22,
    "name": "Wood Sandpiper",
    "sinhala": "වන සිබිල්ලා",
    "scientific": "Tringa Glareola",
    "image": "wood_sandpiper.jpg",
    "desc": "The wood sandpiper is a small wader. This Eurasian species is the smallest of the shanks, which are mid-sized long-legged waders of the family Scolopacidae. The genus name Tringa is the New Latin name given to the green sandpiper by Aldrovandus in 1599 based on Ancient Greek trungas, a thrush-sized, white-rumped, tail-bobbing wading bird mentioned by Aristotle. The specific glareola is from Latin glarea, 'gravel'.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Wood_sandpiper"
  },
  {
    "id": 96,
    "category": 22,
    "name": "Terek Sandpiper",
    "sinhala": "ටෙරෙක් සිබිල්ලා",
    "scientific": "Xenus Cinereus",
    "image": "terek_sandpiper.jpg",
    "desc": "The Terek sandpiper is a small migratory Palearctic wader species, the only member of the genus Xenus. It is named after the Terek River which flows into the west of the Caspian Sea, as it was first observed around this area. The genus name Xenus is from Ancient Greek xenos stranger, and cinereus is Latin for 'ash-grey' from cinis, cineris, 'ashes'.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Terek_sandpiper"
  },
  {
    "id": 97,
    "category": 22,
    "name": "Common Sandpiper",
    "sinhala": "පොදු සිබිල්ලා",
    "scientific": "Actitis Hypoleucos",
    "image": "common_sandpiper.jpg",
    "desc": "The common sandpiper is a small Palearctic wader. This bird and its American sister species, the spotted sandpiper (A. macularia), make up the genus Actitis. They are parapatric and replace each other geographically; stray birds of either species may settle down with breeders of the other and hybridize. Hybridization has also been reported between the common sandpiper and the green sandpiper, a basal species of the closely related shank genus Tringa.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_sandpiper"
  },
  {
    "id": 98,
    "category": 22,
    "name": "Ruddy Turnstone",
    "sinhala": "රත් ගල් පෙරලියා",
    "scientific": "Arenaria Interpres Interpres",
    "image": "ruddy_turnstone.jpg",
    "desc": "The ruddy turnstone is a small wading bird, one of two species of turnstone in the genus Arenaria. The scientific name is from Latin. The genus name arenaria derives from arenarius, 'inhabiting sand, from arena, 'sand'. The specific interpres means 'messenger'; when visiting Gotland in 1741, Linnaeus thought that the Swedish word Tolk 'interpreter' applied to this species, but in the local dialect the word means 'legs' and is used for the redshank.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Ruddy_turnstone"
  },
  {
    "id": 99,
    "category": 22,
    "name": "Red-Necked Phalarope",
    "sinhala": "රත්ගෙල දියවටුවා",
    "scientific": "Phalaropus Lobatus",
    "image": "red_necked_phalarope.jpg",
    "desc": "The red-necked phalarope is a small wader. This phalarope breeds in the Arctic regions of North America and Eurasia. It is migratory, and, unusually for a wader, winters at sea on tropical oceans.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Red-necked_phalarope"
  },
  {
    "id": 100,
    "category": 23,
    "name": "Pallas's Gull",
    "sinhala": "මහ කළුහිස් ගලුවියා",
    "scientific": "Larus Ihthyaetus",
    "image": "pallas_s_gull.jpg",
    "desc": "The Pallas's gull or great black-headed gull is a large gull. As is the case with many gulls, it has traditionally been placed in the genus Larus. The scientific name is from Ancient Greek. Ichthyaetus is from ikhthus, 'fish', and aetos, 'eagle'.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Pallas%27s_gull"
  },
  {
    "id": 101,
    "category": 23,
    "name": "Black-Headed Gull",
    "sinhala": "කළුහිස් ගලුවියා",
    "scientific": "Larus Ridibundus",
    "image": "black_headed_gull.jpg",
    "desc": "The black-headed gull is a small gull that breeds in much of Europe and Asia, and also in coastal eastern Canada. Most of the population is migratory and winters further south, but some birds reside in the milder westernmost areas of Europe. Some black-headed gulls also spend the winter in northeastern North America, where it was formerly known as the common black-headed gull. As is the case with many gulls, it was previously placed in the genus Larus.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-headed_gull"
  },
  {
    "id": 102,
    "category": 23,
    "name": "Brown-Headed Gull",
    "sinhala": "බොරහිස් ගලුවියා",
    "scientific": "Larus brunnicephalus",
    "image": "brown_headed_gull.jpg",
    "desc": "The brown-headed gull is a small gull which breeds in the high plateaus of central Asia from Tajikistan to Ordos in Inner Mongolia. It is migratory, wintering on the coasts and large inland lakes of the Indian Subcontinent. As is the case with many gulls, was traditionally placed in the genus Larus.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Brown-headed_gull"
  },
  {
    "id": 103,
    "category": 23,
    "name": "Heuglin's Gull",
    "sinhala": "හෙවුග්ලින් ගලුවියා",
    "scientific": "Larus Heuglini Heuglini",
    "image": "heuglin_s_gull.jpg",
    "desc": "Heuglin's gull or Siberian gull is a seabird in the genus Larus. It is sometimes considered as a separate species (Larus heuglini) but is now usually treated as a subspecies of the lesser black-backed gull.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Heuglin%27s_gull"
  },
  {
    "id": 104,
    "category": 24,
    "name": "Gull-billed Tern",
    "sinhala": "ගලුතුඩු සයුරු ළිහිණියා",
    "scientific": "Gelochelidon Nilotica Nilotica",
    "image": "gull_billed_tern.jpg",
    "desc": "The gull-billed tern, formerly Sterna nilotica, is a tern in the family Laridae. It is now considered to be in its own genus. The genus name is from Ancient Greek gelao, 'to laugh', and khelidon, 'swallow'. The specific niloticus is from Latin and means of the Nile.",
    "migrant": 1,
    "endemic": 0,
    "code": "SRCM",
    "wikipedia": "https://en.wikipedia.org/wiki/Gull-billed_tern"
  },
  {
    "id": 105,
    "category": 24,
    "name": "Caspian Tern",
    "sinhala": "කැස්පියානු මුහුදු ළිහිණියා",
    "scientific": "Sterna Caspia",
    "image": "caspian_tern.jpg",
    "desc": "The Caspian tern is a species of tern, with a subcosmopolitan but scattered distribution. Despite its extensive range, it is monotypic of its genus, and has no accepted subspecies. The genus name is from Ancient Greek hudros, 'water', and Latin progne, 'swallow'. The specific caspia is from Latin and, like the English name, refers to the Caspian Sea.",
    "migrant": 1,
    "endemic": 0,
    "code": "SRM",
    "wikipedia": "https://en.wikipedia.org/wiki/Caspian_tern"
  },
  {
    "id": 106,
    "category": 24,
    "name": "Large Crested Tern",
    "sinhala": "මහකොණ්ඩ මුහුදු ළිහිණියා",
    "scientific": "Sterna Bergii",
    "image": "large_crested_tern.jpg",
    "desc": "The greater crested tern, also called crested tern or swift tern, is a tern in the family Laridae that nests in dense colonies on coastlines and islands in the tropical and subtropical Old World. Its five subspecies breed in the area from South Africa around the Indian Ocean to the central Pacific and Australia, all populations dispersing widely from the breeding range after nesting. This large tern is closely related to the royal and lesser crested terns, but can be distinguished by its size and bill colour.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_crested_tern"
  },
  {
    "id": 107,
    "category": 24,
    "name": "Lesser Crested Tern",
    "sinhala": "හීන්කොණ්ඩ මුහුදු ළිහිණියා",
    "scientific": "Sterna Bengalensis Bengalensis",
    "image": "lesser_crested_tern.jpg",
    "desc": "The lesser crested tern is a tern in the family, Laridae. Like all Thalasseus terns, lesser crested tern feeds by plunge-diving for fish, usually from saline environments. It usually dives directly, and not from the 'stepped-hover' favoured by Arctic tern. The offering of fish by the male to the female is part of the courtship display.",
    "migrant": 1,
    "endemic": 0,
    "code": "UM",
    "wikipedia": "https://en.wikipedia.org/wiki/Lesser_crested_tern"
  },
  {
    "id": 108,
    "category": 24,
    "name": "Sandwich Tern",
    "sinhala": "සැන්ඩ්විච් මුහුදු ළිහිණියා",
    "scientific": "Sterna Sandvicensis Sandvicensis",
    "image": "sandwich_tern.jpg",
    "desc": "The Sandwich tern is a tern in the family Laridae. It is very closely related to the lesser crested tern (T. bengalensis), Chinese crested tern (T. bernsteini), Cabot's tern (T. acuflavidus), and elegant tern (T. elegans) and has been known to interbreed with the lesser crested.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Sandwich_tern"
  },
  {
    "id": 109,
    "category": 24,
    "name": "Common Tern",
    "sinhala": "පොදු මුහුදු ළිහිණියා",
    "scientific": "Sterna Hirundo Tibetana",
    "image": "common_tern.jpg",
    "desc": "The common tern is a seabird in the family Laridae. This bird has a circumpolar distribution, its four subspecies breeding in temperate and subarctic regions of Europe, Asia and North America. It is strongly migratory, wintering in coastal tropical and subtropical regions. Breeding adults have light grey upperparts, white to very light grey underparts, a black cap, orange-red legs, and a narrow pointed bill. Depending on the subspecies, the bill may be mostly red with a black tip or all black. There are a number of similar species, including the partly sympatric Arctic tern, which can be separated on plumage details, leg and bill colour, or vocalisations.",
    "migrant": 1,
    "endemic": 0,
    "code": "RSM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_tern"
  },
  {
    "id": 110,
    "category": 24,
    "name": "Little Tern",
    "sinhala": "පුංචි මුහුදු ළිහිණියා",
    "scientific": "Sterna Albifrons Sinensis",
    "image": "little_terns.jpg",
    "desc": "The little tern is a seabird of the family Sternidae. It was formerly placed into the genus Sterna, which now is restricted to the large white terns. The genus name is a diminutive of Sterna, 'tern'. The specific albifrons is from Latin albus, 'white', and 'frons', forehead.[3] The former North American (S. a. antillarum) and Red Sea S. a. saundersi subspecies are now considered to be separate species, the least tern (Sternula antillarum) and Saunders's tern (Sternula saundersi).",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Little_tern"
  },
  {
    "id": 111,
    "category": 24,
    "name": "Saunder's Tern",
    "sinhala": "සෝන්ඩර් මුහුදු ළිහිණියා",
    "scientific": "Sterna Saundersi",
    "image": "saunder_s_tern.jpg",
    "desc": "The Saunders's tern is a species of tern in the family Laridae. It is found in Bahrain, Iran, Israel, Kenya, Madagascar, Pakistan, Oman, Saudi Arabia, Sri Lanka, Tanzania, United Arab Emirates, and Yemen.",
    "migrant": 0,
    "endemic": 0,
    "code": "SHR",
    "wikipedia": "https://en.wikipedia.org/wiki/Saunders%27s_tern"
  },
  {
    "id": 112,
    "category": 24,
    "name": "Whiskered Tern",
    "sinhala": "අළුපිය කාඟුල්ළිහිණියා",
    "scientific": "Chlidonias Hybridus Hybridus",
    "image": "whiskered_tern.jpg",
    "desc": "The whiskered tern is a tern in the family Laridae. The genus name is from Ancient Greek khelidonios, 'swallow-like', from khelidon, 'swallow'. The specific hybridus is Latin for hybrid; Pallas thought it might be a hybrid of white-winged black tern and common tern, writing 'Sterna fissipes [Chlidonias leucopterus] et Hirundine [Sterna hirundo] natam'.",
    "migrant": 1,
    "endemic": 0,
    "code": "CM",
    "wikipedia": "https://en.wikipedia.org/wiki/Whiskered_tern"
  },
  {
    "id": 113,
    "category": 24,
    "name": "White-Winged Tern",
    "sinhala": "සුදුපිය කාඟුල්ළිහිණියා",
    "scientific": "Chlidonias Leucopterus",
    "image": "white_winged_tern.jpg",
    "desc": "The white-winged tern, or white-winged black tern, is a species of tern in the family Laridae. It is a small species generally found in or near bodies of fresh water across much of the world, including Europe, Africa, Asia, and Australia. The genus name is from Ancient Greek khelidonios, 'swallow-like', from khelidon, 'swallow'. The specific leptopterus is also Greek from leptos, 'slender', and pteros, 'feathered', itself from pteron, 'wing'.",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/White-winged_tern"
  },
  {
    "id": 114,
    "category": 25,
    "name": "Sri Lanka Wood Pigeon",
    "sinhala": "ශ්‍රී ලංකා මයිල පරෙවියා",
    "scientific": "Columba Torringtonii",
    "image": "sri_lanka_wood_pigeon.jpg",
    "desc": "The Sri Lanka wood pigeon is a pigeon which is an endemic resident breeding bird in the mountains of Sri Lanka. This species nests in damp evergreen woodlands in the central highlands, building a stick nest in a tree and laying a single white egg. Its flight is quick, with the regular beats and an occasional sharp flick of the wings which are characteristic of pigeons in general. Most of its food is vegetable. Normally silent it utters an owl-like hoo call in the breeding season.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_wood_pigeon"
  },
  {
    "id": 115,
    "category": 25,
    "name": "Eurasian Collared Dove",
    "sinhala": "මාල කොබෙයියා",
    "scientific": "Streptopelia Decaota Decaota",
    "image": "eurasian_collared_dove.jpg",
    "desc": "The Eurasian collared dove, most often simply called the collared dove, also sometimes hyphenated as Eurasian collared-dove, is a species of dove native to warm temperate and subtropical Asia, and introduced in North America in the 1980s. In the latter half of the 20th century the species' native range vastly expanded, and it can now be found from Southeast Asia through to Western Europe.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Eurasian_collared_dove"
  },
  {
    "id": 116,
    "category": 25,
    "name": "Spotted Dove",
    "sinhala": "අළු කොබෙයියා",
    "scientific": "Streptopelia Chinensis Ceylonensis",
    "image": "spotted_dove.jpg",
    "desc": "The Eurasian collared dove, most often simply called the collared dove, also sometimes hyphenated as Eurasian collared-dove, is a species of dove native to warm temperate and subtropical Asia, and introduced in North America in the 1980s. In the latter half of the 20th century the species' native range vastly expanded, and it can now be found from Southeast Asia through to Western Europe.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Spotted_dove"
  },
  {
    "id": 117,
    "category": 25,
    "name": "Orange-Breasted Green Pigeon",
    "sinhala": "ළයරන් බටගොයා",
    "scientific": "Treron Bicincta Leggei",
    "image": "orange_breasted_green_pigeon.jpg",
    "desc": "The orange-breasted green pigeon is a pigeon found across tropical Asia south of the Himalaya across parts of the Indian Subcontinent and Southeast Asia. Like other green pigeons, it feeds mainly on small fruit. They may be found in pairs or in small flocks, foraging quietly and moving slowly on trees. The nape is blue-grey and the crown is yellowish green. The uppertail coverts are bronzed and the undertail coverts are unmarked rufous. The male has a pinkish band on the upper breast with a broader orange one below while the female has a bright yellow breast.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Orange-breasted_green_pigeon"
  },
  {
    "id": 118,
    "category": 25,
    "name": "Pompadour Green Pigeon",
    "sinhala": "පොම්පදෝරු බටගොයා",
    "scientific": "Treron Pompadora",
    "image": "pompadour_green_pigeon.jpg",
    "desc": "The pompadour green pigeon (genus Treron) is a pigeon species complex. It is widespread in forests of southern and southeast Asia. It is a widespread group in forests of tropical southern Asia from India, Sri Lanka east to the Philippines and the Moluccas. In India, they are found as disjunct populations in the Western Ghats, some parts of the Eastern Ghats, Northeastern India and in the Andaman Islands.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Pompadour_green_pigeon"
  },
  {
    "id": 119,
    "category": 25,
    "name": "Green Imperial Pigeon",
    "sinhala": "නීලමහගොයා",
    "scientific": "Ducula Aenea Pusilla",
    "image": "green_imperial_pigeon.jpg",
    "desc": "The green imperial pigeon is a large forest pigeon. The green imperial pigeon is a large, plump pigeon, 45 cm in length. Its back, wings and tail are metallic green. The head and underparts are white, apart from maroon undertail coverts. Sexes are similar. The bird's call is deep and resonant, and is often the first indication of the presence of this treetop species. The Nicobar imperial pigeon is sometimes still considered conspecific.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Green_imperial_pigeon"
  },
  {
    "id": 120,
    "category": 26,
    "name": "Ceylon Hanging Parrot",
    "sinhala": "ශ්‍රී ලංකා ගිරාමලිත්තා",
    "scientific": "Loriculus Beryllinus",
    "image": "ceylon_hanging_parrot.jpg",
    "desc": "The Sri Lanka hanging parrot is a small parrot which is a resident endemic breeder in Sri Lanka. The Sri Lanka hanging parrot is a small, mainly green hanging parrot, only 13 cm long with a short tail. The adult has a red crown and rump. The nape and back have on orange tint. The chin and throat are pale blue. The beak is red and the irises are white.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_hanging_parrot"
  },
  {
    "id": 121,
    "category": 26,
    "name": "Alexandrine Parakeet",
    "sinhala": "ලබු ගිරවා",
    "scientific": "Psittacula Eupatria Eupatria",
    "image": "alexandrine_parakeet.jpg",
    "desc": "The Alexandrine parakeet, also known as the Alexandrine parrot, is a medium-sized parrot in the genus Psittacula of the family Psittacidae. It is named after Alexander the Great, who transported numerous birds from Punjab to various European and Mediterranean countries and regions, where they were prized by the royalty, nobility and warlords.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Alexandrine_parakeet"
  },
  {
    "id": 122,
    "category": 26,
    "name": "Rose-ringed Parakeet",
    "sinhala": "රෑන ගිරවා",
    "scientific": "Psittacula Krameri Manillensis",
    "image": "rose_ringed_parakeet.jpg",
    "desc": "The rose-ringed parakeet (Psittacula krameri), also known as the ring-necked parakeet, is a medium-sized parrot in the genus Psittacula of the family Psittacidae and has a very wide range The rose-ringed parakeet is sexually dimorphic. The adult male sports a red and black neck ring and the hen and immature birds of both sexes either show no neck rings, or display shadow-like pale to dark grey neck rings. Both sexes have a distinctive green colour.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Rose-ringed_parakeet"
  },
  {
    "id": 123,
    "category": 26,
    "name": "Plum-Headed Parakeet",
    "sinhala": "පඬු ගිරවා",
    "scientific": "Psittacula Cyanocephala Cyanocephala",
    "image": "plum_headed_parakeet.jpg",
    "desc": "The plum-headed parakeet is a parrot in the family Psittacidae. It is endemic to the Indian Subcontinent and was once thought to be conspecific with the blossom-headed parakeet (Psittacula roseata) but was later elevated to a full species. Plum-headed parakeets are found in flocks, the males having a pinkish purple head and the females, a grey head. They fly swiftly with twists and turns accompanied by their distinctive calls.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Plum-headed_parakeet"
  },
  {
    "id": 124,
    "category": 26,
    "name": "Layard's Parakeet",
    "sinhala": "අළු ගිරවා",
    "scientific": "Psittacula Calthropae",
    "image": "layard_s_parakeet.jpg",
    "desc": "The Layard's parakeet is a parrot which is a resident endemic breeder in Sri Lanka. The common name of this bird commemorates the British naturalist Edgar Leopold Layard; his first wife, Barbara Anne Calthrop, whom he married in 1845, is commemorated in the specific epithet.",
    "migrant": 0,
    "endemic": 1,
    "code": "UE",
    "wikipedia": "https://en.wikipedia.org/wiki/Layard%27s_parakeet"
  },
  {
    "id": 125,
    "category": 27,
    "name": "Pied Cuckoo",
    "sinhala": "ගෝමර කොණ්ඩ කොහා",
    "scientific": "Clamator Jacobinus Jacobinus",
    "image": "pied_cuckoo.jpg",
    "desc": "The Jacobin cuckoo, pied cuckoo, or pied crested cuckoo is a member of the cuckoo order of birds that is found in Africa and Asia. It is partially migratory and in India, it has been considered a harbinger of the monsoon rains due to the timing of its arrival. It has been associated with a bird in Indian mythology and poetry, known as the chataka represented as a bird with a beak on its head that waits for rains to quench its thirst.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Jacobin_cuckoo"
  },
  {
    "id": 126,
    "category": 27,
    "name": "Common Hawk Cuckoo",
    "sinhala": "උකුසු කොහා",
    "scientific": "Hierococcyx Varius Varius",
    "image": "common_hawk_cuckoo.jpg",
    "desc": "The common hawk-cuckoo, popularly known as the brainfever bird, is a medium-sized cuckoo resident in the Indian subcontinent. It bears a close resemblance to the Shikra, even in its style of flying and landing on a perch. The resemblance to hawks gives this group the generic name of hawk-cuckoo and like many other cuckoos these are brood parasites, laying their eggs in nests of babblers. During their breeding season in summer males produce loud, repetitive three note calls that are well-rendered as brain-fever, the second note being longer and higher pitched. These notes rise to a crescendo before ending abruptly and repeat after a few minutes; the calling may go on through the day, well after dusk and before dawn.",
    "migrant": 1,
    "endemic": 0,
    "code": "SHM",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_hawk-cuckoo"
  },
  {
    "id": 127,
    "category": 27,
    "name": "Grey-Bellied Cuckoo",
    "sinhala": "කසළු ගුරු කොහා",
    "scientific": "Cacomantis Passerinus",
    "image": "grey_bellied_cuckoo.jpg",
    "desc": "The grey-bellied cuckoo or the Indian plaintive cuckoo is a cuckoo with widespread occurrence throughout Asia",
    "migrant": 1,
    "endemic": 0,
    "code": "M",
    "wikipedia": "https://en.wikipedia.org/wiki/Grey-bellied_cuckoo"
  },
  {
    "id": 128,
    "category": 27,
    "name": "Square-Tailed Drongo-Cuckoo",
    "sinhala": "කවුඩු කොහා",
    "scientific": "Surniculus Lugubris",
    "image": "square_tailed_drongo_cuckoo.jpg",
    "desc": "The square-tailed drongo-cuckoo is a species of cuckoo that resembles a black drongo. It is found in Sri Lanka and Southeast Asia and is a summer visitor to the Himalayas from Kashmir to eastern Bangladesh. The calls are series of piercing sharp whistles rising in pitch but shrill and choppily delivered.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Square-tailed_drongo-cuckoo"
  },
  {
    "id": 129,
    "category": 27,
    "name": "Asian Koel",
    "sinhala": "කොවුලා",
    "scientific": "Eudynamys Scolopacea Scolopacea",
    "image": "asian_koel.jpg",
    "desc": "The Asian koel is a member of the cuckoo order of birds, the Cuculiformes. It is found in the Indian Subcontinent, China, Bangladesh and Southeast Asia. It forms a superspecies with the closely related black-billed and Pacific koels which are sometimes treated as subspecies. The Asian koel is a brood parasite that lays its eggs in the nests of crows and other hosts, who raise its young. They are unusual among the cuckoos in being largely frugivorous as adults. The name koel is echoic in origin with several language variants. The bird is a widely used symbol in Indian poetry.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Asian_koel"
  },
  {
    "id": 130,
    "category": 27,
    "name": "Blue-Faced Malkoha",
    "sinhala": "වතනිල් මල්කොහා",
    "scientific": "Phaenicophaeus Viridirostris",
    "image": "blue_faced_malkoha.jpg",
    "desc": "The blue-faced malkoha or small green-billed malkoha is a non-parasitic cuckoo found in the scrub and deciduous forests of peninsular India and Sri Lanka. It has a waxy dark blue-grey plumage on its upperparts and has a long tail with graduated white-tipped feathers. The throat and chin are dark with spiny pale feathers that are branched. The lower belly is a dull creamy to rufous colour. The bill is apple green and naked patch of blue skin surrounds the eye. The sexes are alike. The blue-faced malkoha is a bird of open forests and scrub jungle.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Blue-faced_malkoha"
  },
  {
    "id": 131,
    "category": 27,
    "name": "Red-Faced Malkoha",
    "sinhala": "වතරතු මල්කොහා",
    "scientific": "Phaenicophaeus Pyrrhocephalus",
    "image": "red_faced_malkoha.jpg",
    "desc": "The red-faced malkoha is a member of the cuckoo order of birds, the Cuculiformes. This malkoha species is endemic to Sri Lanka. This is a large species at 46 cm with a long graduated tail. Its back is dark green, and the uppertail is green edged with white. The belly and undertail are white, the latter being barred black. The crown and throat are black, and the lower face white. There is a large red patch around the eye and the bill is green. Sexes are similar, but juveniles are much duller.",
    "migrant": 0,
    "endemic": 1,
    "code": "SE",
    "wikipedia": "https://en.wikipedia.org/wiki/Red-faced_malkoha"
  },
  {
    "id": 132,
    "category": 27,
    "name": "Sirkeer Malkoha",
    "sinhala": "පතන් මල්කොහා (පතන් ඇටිකුකුළා) ",
    "scientific": "Phaenicophaeus Leschenaultii Leschenaultii",
    "image": "sirkeer_malkoha.jpg",
    "desc": "The sirkeer malkoha or sirkeer cuckoo, is a non-parasitic cuckoo found in dry scrub forest and open woodland habitats in the Indian subcontinent. The species is long-tailed, largely olive brown on the upper side with a distinctive curved red beak tipped in yellow. They forage singly or in pairs mainly on or close to the ground creeping between grasses and bushes, often on rocky habitats where they feed on small lizards, insects, and sometimes berries and seeds. They are very silent and the sexes are identical in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Sirkeer_malkoha"
  },
  {
    "id": 133,
    "category": 27,
    "name": "Green-billed Coucal",
    "sinhala": "බට ඇටිකුකුළා",
    "scientific": "Centropus Chlororhynchus",
    "image": "green_billed_coucal.jpg",
    "desc": "The green-billed coucal is a member of the cuckoos. It is endemic to Sri Lanka's wet zone and listed as Vulnerable on the IUCN Red List, as the small population declined due to forest destruction and fragmentation. It inhabits the tall rainforests of southwest Sri Lanka and nests in bushes. Its typical clutch is 2–3 eggs.",
    "migrant": 0,
    "endemic": 1,
    "code": "SHE",
    "wikipedia": "https://en.wikipedia.org/wiki/Green-billed_coucal"
  },
  {
    "id": 134,
    "category": 27,
    "name": "Greater Coucal",
    "sinhala": "ඇටිකුකුළා",
    "scientific": "Centropus Sinensis Parroti",
    "image": "greater_coucal.jpg",
    "desc": "The greater coucal or crow pheasant, is a large non-parasitic member of the cuckoo order of birds, the Cuculiformes. A widespread resident in the Indian Subcontinent and Southeast Asia, it is divided into several subspecies, some being treated as full species. They are large, crow-like with a long tail and coppery brown wings and found in wide range of habitats from jungle to cultivation and urban gardens. They are weak fliers, and are often seen clambering about in vegetation or walking on the ground as they forage for insects, eggs and nestlings of other birds. They have a familiar deep resonant call which is associated with omens in many parts of its range.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/Greater_coucal"
  },
  {
    "id": 136,
    "category": 28,
    "name": "Collared Scops Owl",
    "sinhala": "කරපටි බස්සා",
    "scientific": "Otus Bakkamoena Bakkamoena",
    "image": "collared_scops_owl.jpg",
    "desc": "The collared scops owl is an owl which is a resident breeder in south Asia from northern Pakistan, northern India, Bangladesh[2] and the Himalayas east to south China. It is partially migratory, with some birds wintering in India, Sri Lanka and Malaysia. This species was formerly considered to be included within what is now separated as the Indian scops owl (Otus bakkamoena).",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Collared_scops_owl"
  },
  {
    "id": 137,
    "category": 28,
    "name": "Oriental Scops Owl",
    "sinhala": "පෙරදිගුකන් බස්සා",
    "scientific": "Otus Sunia Leggei",
    "image": "oriental_scops_owl.jpg",
    "desc": "The oriental scops owl is a species of scops owl found in eastern and southern Asia. This is a small, variable plumaged, yellow eyed owl with ear-tufts which are not always erect. It can be distinguish from the collared scops owl by its whitish scapular stripe, well marked underparts, and lack of pale collar. There are two colour morphs, grey and rufous; intermediate forms also occur. Sexes are alike. Individuals may freeze with eyes half closed when disturbed. The species has a repeated liquid call sounding like 'tuk tok torok'.",
    "migrant": 0,
    "endemic": 0,
    "code": "SR",
    "wikipedia": "https://en.wikipedia.org/wiki/Collared_scops_owl"
  },
  {
    "id": 138,
    "category": 28,
    "name": "Spot-bellied Eagle Owl",
    "sinhala": "උකුසු බකමූණා (උලමා)",
    "scientific": "Bubo Nipalensis Blighi",
    "image": "spot_bellied_eagle_owl.jpg",
    "desc": "The spot-bellied eagle-owl, also known as the forest eagle-owl is a large bird of prey with a formidable appearance. It is a forest-inhabiting species found in the Indian Subcontinent and Southeast Asia. This species is considered part of a superspecies with the barred eagle-owl (Bubo sumatranus), which looks quite similar but is allopatric in distribution, replacing the larger spot-bellied species in the southern end of the Malay Peninsula and the larger island in Southeast Asia extending down to Borneo.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Spot-bellied_eagle-owl"
  },
  {
    "id": 139,
    "category": 28,
    "name": "Brown Fish Owl",
    "sinhala": "බොර කෙවුල් බකමූණා",
    "scientific": "Ketupa Zeylonensis Zeylonensis",
    "image": "brown_fish_owl.jpg",
    "desc": "The brown fish owl is a species of owl that is part of the family known as typical owls, Strigidae, which contains most living owls. It inhabits the warm subtropical and humid tropical parts of continental Asia and some offshore islands. Of the four living species of fish owl, it is the most widely distributed, most common and best-studied. It occupies a range of over 7,000 km (4,300 mi) from eastern China to Palestine.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Brown_fish_owl"
  },
  {
    "id": 140,
    "category": 28,
    "name": "Jungle Owlet",
    "sinhala": "වන උපබස්සා",
    "scientific": "Glaucidium Radiatum Radiatum",
    "image": "jungle_owlet.jpg",
    "desc": "The jungle owlet, or barred jungle owlet, is found in the Indian Subcontinent. The species is often found singly, in pairs or small groups and are usually detected by their calls at dawn and dusk. There are two subspecies with the form found in the Western Ghats sometimes considered a full species.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Jungle_owlet"
  },
  {
    "id": 141,
    "category": 28,
    "name": "Chestnut-backed Owlet",
    "sinhala": "පිටතඹල උපබස්සා",
    "scientific": "Glaucidium Castanonotum",
    "image": "chestnut_backed_owlet.jpg",
    "desc": "The chestnut-backed owlet (often misspelled Glaucidium castanonotum),[1] is an owl which is endemic to Sri Lanka. This species is a part of the larger grouping of owls known as typical owls, Strigidae, which contains most of the smaller owl species. This species was formerly considered to be a subspecies of the jungle owlet.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Chestnut-backed_owlet"
  },
  {
    "id": 142,
    "category": 28,
    "name": "Serendib Scops Owl",
    "sinhala": "පඬුවන් බස්සා",
    "scientific": "Otus Thilohoffmanni",
    "image": "serendib_scops_owl.jpg",
    "desc": "The Serendib scops owl is the most recently discovered bird of Sri Lanka. It was originally located by its unfamiliar poo-ooo call in the Kitulgala rainforest by prominent Sri Lankan ornithologist Deepal Warakagoda. Six years later, it was finally seen by him on 23 January 2001 in Sinharaja, and formally described as a species new to science in 2004. Apart from Sinharaja and Kitulgala, it has also been found at Runakanda Reserve in Morapitiya and Eratna Gilimale.",
    "migrant": 0,
    "endemic": 1,
    "code": "E",
    "wikipedia": "https://en.wikipedia.org/wiki/Serendib_scops_owl"
  },
  {
    "id": 143,
    "category": 29,
    "name": "Ceylon Frogmouth",
    "sinhala": "ශ්‍රී ලංකා මැඩිමුහුණා",
    "scientific": "Batrachostomus Moniliger",
    "image": "ceylon_frogmouth.jpg",
    "desc": "The Sri Lanka frogmouth, Sri Lankan frogmouth or Ceylon frogmouth is a small frogmouth found in the Western Ghats of south India and Sri Lanka. Related to the nightjars, it is nocturnal and is found in forest habitats. The plumage coloration resembles that of dried leaves and the bird roosts quietly on branches, making it difficult to see. Each has a favourite roost that it uses regularly unless disturbed. It has a distinctive call that is usually heard at dawn and dusk. The sexes differ slightly in plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Sri_Lanka_frogmouth"
  },
  {
    "id": 144,
    "category": 30,
    "name": "Indian Nightjar",
    "sinhala": "ඉන්දු බිම්බස්සා",
    "scientific": "Caprimulgus Asiaticus Eidos",
    "image": "indian_nightjar.jpg",
    "desc": "The Indian nightjar is a small nightjar which is a resident breeder in open lands across South Asia and Southeast Asia. Like most nightjars it is crepuscular and is best detected from its characteristic calls at dawn and dusk that have been likened to a stone skipping on a frozen lake - a series of clicks that become shorter and more rapid. They are sometimes spotted on roads when their eyes gleam red in the spotlight of a vehicle. There is considerable plumage variation across its range and can be hard to differentiate from other nightjars in the region especially in the field.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_nightjar"
  },
  {
    "id": 145,
    "category": 31,
    "name": "Crested Treeswift",
    "sinhala": "සිළු රුක් තුරිතයා",
    "scientific": "Hemiprocne Coronata",
    "image": "crested_treeswift.jpg",
    "desc": "The crested treeswift is a kind of tree swift. The tree swifts are aerial near passerine birds, closely related to, but distinct from the true swifts by their sexual dimorphism, a frontal crest, and toes that allow perching on branches. They are restricted to southeast Asia and Australasia. It was for sometime considered conspecific with its eastern relative, the grey-rumped treeswift (Hemiprocne longipennis), but they do not interbreed where their ranges overlap. They are distinct in flight with long bowed wings and a deeply forked tail that usually appears narrow and pointed.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Crested_treeswift"
  },
  {
    "id": 146,
    "category": 32,
    "name": "Indian Swiftlet",
    "sinhala": "ඉන්දියානු කැදැල් තුරිතයා",
    "scientific": "Collocalia Unicolor",
    "image": "indian_swiftlet.jpg",
    "desc": "The Indian swiftlet, or Indian edible-nest swiftlet, is a small swift. It is a common resident colonial breeder in the hills of Sri Lanka and south west India. The half-cup nest is built on a vertical surface, often in a cave. The male swift uses thick saliva to construct the white, shiny nest into which two eggs are laid. The relatively tasteless nests are harvested, and mixed with chicken, spices, and other flavours as bird's nest soup, a supposed aphrodisiac.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Indian_swiftlet"
  },
  {
    "id": 147,
    "category": 32,
    "name": "Asian Palm Swift",
    "sinhala": "තල් තුරිතයා",
    "scientific": "Cypsiurus Balasiensis Balasiensis",
    "image": "asian_palm_swift.jpg",
    "desc": "The Asian palm swift is a small swift. It is very similar to the African palm swift, Cypsiurus parvus, and was formerly considered to be the same species. It is a common resident breeder in tropical Asia from India to the Philippines. The down and feather nest is glued to the underside of a palm leaf with saliva, which is also used to secure the usually two or three eggs. This is a bird of open country and cultivation, which is strongly associated with oil palms.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Asian_palm_swift"
  },
  {
    "id": 148,
    "category": 33,
    "name": "Malabar Trogon",
    "sinhala": "ලෝහවන්නිච්චා",
    "scientific": "Harpactes Fasciatus Fasciatus",
    "image": "malabar_trogon.jpg",
    "desc": "The Malabar Trogon is a species of bird in the trogon family. It is found in the forests of Sri Lanka and peninsular India. In India it is mainly found in the Western Ghats, hill forests of central India and in parts of the Eastern Ghats. They are insectivorous and although not migratory, may move seasonally in response to rain in hill forest regions. Like in other trogons, males and females vary in plumage. The birds utter low guttural calls that can be heard only at close quarters and the birds perch still on a branch under the forest canopy, often facing away from the viewer making them easy to miss despite their colourful plumage.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Malabar_trogon"
  },
  {
    "id": 149,
    "category": 34,
    "name": "Stork-Billed Kingfisher",
    "sinhala": "මානාතුඩු මහා පිළිහුඩුවා",
    "scientific": "Halcyon Capensis Capensis",
    "image": "stork_billed_kingfisher.jpg",
    "desc": "The stork-billed kingfisher, is a tree kingfisher which is widely but sparsely distributed in the tropical Indian subcontinent and Southeast Asia, from India to Indonesia. This kingfisher is resident throughout its range. t is a very large kingfisher, measuring 35 cm (14 in) in length. The adult has a green back, blue wings and tail, and olive-brown head. Its underparts and neck are buff. The very large bill and legs are bright red. The flight of the stork-billed kingfisher is laboured and flapping, but direct. Sexes are similar.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Stork-billed_kingfisher"
  },
  {
    "id": 150,
    "category": 34,
    "name": "White-Throated Kingfisher",
    "sinhala": "ළයසුදු මැදි-පිළිහුඩුවා",
    "scientific": "Halcyon Smyrnensis Fusca",
    "image": "white_throated_kingfisher.jpg",
    "desc": "The white-throated kingfisher also known as the white-breasted kingfisher is a tree kingfisher, widely distributed in Asia from Turkey east through the Indian subcontinent to the Philippines. This kingfisher is a resident over much of its range, although some populations may make short distance movements. It can often be found well away from water where it feeds on a wide range of prey that includes small reptiles, amphibians, crabs, small rodents and even birds. During the breeding season they call loudly in the mornings from prominent perches including the tops of buildings in urban areas or on wires.",
    "migrant": 0,
    "endemic": 0,
    "code": "CR",
    "wikipedia": "https://en.wikipedia.org/wiki/White-throated_kingfisher"
  },
  {
    "id": 151,
    "category": 34,
    "name": "Black-Capped Kingfisher",
    "sinhala": "කඝු ඉසැසි මැදි-පිළිහුඩුවා",
    "scientific": "Halcyon Pileata",
    "image": "black_capped_kingfisher.jpg",
    "desc": "The black-capped kingfisher is a tree kingfisher which is widely distributed in tropical Asia from India east to China, Korea and Southeast Asia. This most northerly of the Halcyonidae is resident over much of its range, but northern populations are migratory and they wintering south of their range to Sri Lanka, Thailand, Borneo and Java. It is distinctive in having a black cap that contrasts with the whitish throat, purple blue wings and the coral red bill. The species is mainly found in coastal and mangrove habitats but can sometimes be found far inland.",
    "migrant": 1,
    "endemic": 0,
    "code": "SM",
    "wikipedia": "https://en.wikipedia.org/wiki/Black-capped_kingfisher"
  },
  {
    "id": 152,
    "category": 34,
    "name": "Common Kingfisher",
    "sinhala": "මල් පිළිහුඩුවා",
    "scientific": "Alcedo Atthis Taprobana",
    "image": "common_kingfisher.jpg",
    "desc": "The common kingfisher also known as the Eurasian kingfisher, and river kingfisher, is a small kingfisher with seven subspecies recognized within its wide distribution across Eurasia and North Africa. It is resident in much of its range, but migrates from areas where rivers freeze in winter. This sparrow-sized bird has the typical short-tailed, large-headed kingfisher profile; it has blue upperparts, orange underparts and a long bill. It feeds mainly on fish, caught by diving, and has special visual adaptations to enable it to see prey under water. The glossy white eggs are laid in a nest at the end of a burrow in a riverbank.",
    "migrant": 0,
    "endemic": 0,
    "code": "R",
    "wikipedia": "https://en.wikipedia.org/wiki/Common_kingfisher"
  },
  {
    "id": 153,
    "category": 34,
    "name": "Pied Kingfisher",
    "sinhala": "ගෝමර පිළිහුඩුවා",
    "scientific": "Ceryle Rudis Leucomelanura",
    "image": "pied_kingfisher.jpg",
    "desc": "The pied kingfisher is a water kingfisher and is found widely distributed across Africa and Asia. Originally described by Linnaeus in 1758, it has five recognised subspecies. Its black and white plumage, crest and the habit of hovering over clear lakes and rivers before diving for fish make it distinctive. Males have a double band across the breast while females have a single gorget that is often broken in the middle. They are usually found in pairs or small family parties. When perched, they often bob their head and flick up their tail.",
    "migrant": 0,
    "endemic": 0,
    "code": "UR",
    "wikipedia": "https://en.wikipedia.org/wiki/Pied_kingfisher"
  }
]